
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>问卷篇 · 2018中国开源年度报告</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="开源社">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="./" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    引言
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2" data-path="chapter-questionnaire.html">
            
                <a href="chapter-questionnaire.html">
            
                    
                    问卷篇
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" >
            
                <span>
            
                    
                    数据篇
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="chapter-dataanalysis/compass.html">
            
                <a href="chapter-dataanalysis/compass.html">
            
                    
                    指南针篇
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="chapter-dataanalysis/grank.html">
            
                <a href="chapter-dataanalysis/grank.html">
            
                    
                    Grank篇
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="chapter-insight.html">
            
                <a href="chapter-insight.html">
            
                    
                    洞察篇
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="chapter-epilogue.html">
            
                <a href="chapter-epilogue.html">
            
                    
                    结语
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >问卷篇</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h3 id="&#x7B2C;&#x4E00;&#x7BC7;-&#x95EE;&#x5377;&#x7BC7;">&#x7B2C;&#x4E00;&#x7BC7; &#x95EE;&#x5377;&#x7BC7;</h3>
<h4 id="&#x4E00;&#x3001;&#x62A5;&#x544A;&#x6982;&#x8FF0;">&#x4E00;&#x3001;&#x62A5;&#x544A;&#x6982;&#x8FF0;</h4>
<h5 id="11-&#x80CC;&#x666F;"><strong>1.1 &#x80CC;&#x666F;</strong></h5>
<p>2015 &#x5E74;&#xFF0C;&#x5F00;&#x6E90;&#x793E;&#x53D1;&#x5E03;&#x4E86;&#x300A;2015 &#x5E74;&#x4E2D;&#x56FD;&#x5F00;&#x6E90;&#x793E;&#x533A;&#x53C2;&#x4F1A;&#x8C03;&#x67E5;&#x62A5;&#x544A;&#x300B;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E2D;&#x56FD;&#x7684;&#x5F00;&#x6E90;&#x793E;&#x533A;&#x3001;&#x5F00;&#x6E90;&#x751F;&#x6001;&#x3001;&#x5F00;&#x6E90;&#x5F00;&#x53D1;&#x8005;&#xFF0C;&#x505A;&#x4E86;&#x4E00;&#x6B21;&#x5168;&#x9762;&#x7684;&#x6478;&#x5E95;&#x8C03;&#x67E5;&#xFF0C;&#x4E5F;&#x5F97;&#x5230;&#x4E00;&#x7CFB;&#x5217;&#x6709;&#x4EF7;&#x503C;&#x7684;&#x4FE1;&#x606F;&#x3002;3&#x5E74;&#x8FC7;&#x53BB;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x518D;&#x6B21;&#x53D1;&#x8D77;&#x4E86;&#x300A;2018 &#x5E74;&#x4E2D;&#x56FD;&#x5F00;&#x6E90;&#x5F00;&#x53D1;&#x8005;&#x8C03;&#x67E5;&#x300B;&#xFF0C;&#x8FD9;&#x6B21;&#x6211;&#x4EEC;&#x8054;&#x5408;&#x4E86;&#x66F4;&#x591A;&#x7684;&#x5F00;&#x53D1;&#x8005;&#x793E;&#x533A;&#xFF0C;&#x4E5F;&#x6536;&#x96C6;&#x5230;&#x4E86;&#x66F4;&#x591A;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x4E86;&#x89E3;&#x7684;&#xFF0C;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x8FD9;&#x4E00;&#x5E74;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x66F4;&#x5E0C;&#x671B;&#x901A;&#x8FC7;&#x6570;&#x636E;&#x7684;&#x53D8;&#x5316;&#xFF0C;&#x53D1;&#x73B0;&#x4E00;&#x4E9B;&#x503C;&#x5F97;&#x5173;&#x6CE8;&#x7684;&#x8D8B;&#x52BF;&#x3002;</p>
<p>&#x8FD9;&#x6B21;&#x7684;&#x8C03;&#x67E5;&#xFF0C;&#x6211;&#x4EEC;&#x5F97;&#x5230;&#x4E86;&#x6398;&#x91D1;&#x793E;&#x533A;&#x3001;GitChat&amp;CSDN &#x793E;&#x533A;&#x7684;&#x9F0E;&#x529B;&#x652F;&#x6301;&#xFF0C;&#x6536;&#x96C6;&#x5230;&#x4E86; 508 &#x4EFD;&#x95EE;&#x5377;&#xFF0C;&#x8FD9;&#x4F7F;&#x5F97;&#x6211;&#x4EEC;&#x5BF9;&#x4E8E;&#x4E2D;&#x56FD;&#x5F00;&#x6E90;&#x5F00;&#x53D1;&#x8005;&#xFF0C;&#x6709;&#x4E86;&#x66F4;&#x52A0;&#x6DF1;&#x5165;&#x7684;&#x4E86;&#x89E3;&#xFF0C;&#x4E5F;&#x5BF9;&#x4E8E;&#x672A;&#x6765;&#x7684;&#x53D1;&#x5C55;&#x8D8B;&#x52BF;&#xFF0C;&#x6709;&#x4E86;&#x4E00;&#x4E9B;&#x91CD;&#x8981;&#x7684;&#x6D1E;&#x89C1;&#xFF01;</p>
<p>&#x5E0C;&#x671B;&#x8FD9;&#x6837;&#x7684;&#x8C03;&#x67E5;&#x62A5;&#x544A;&#xFF0C;&#x80FD;&#x591F;&#x4E3A;&#x5E7F;&#x5927;&#x5F00;&#x6E90;&#x53C2;&#x4E0E;&#x8005;&#xFF0C;&#x4ECE;&#x4E1A;&#x8005;&#xFF0C;&#x4EE5;&#x53CA;&#x5236;&#x5B9A;&#x5F00;&#x6E90;&#x6218;&#x7565;&#x7684;&#x4F01;&#x4E1A;&#xFF0C;&#x63D0;&#x4F9B;&#x6709;&#x4EF7;&#x503C;&#x7684;&#x53C2;&#x8003;&#x3002;</p>
<ul>
<li>&#x8C03;&#x67E5;&#x5BF9;&#x8C61;&#xFF1A;&#x8986;&#x76D6;&#x5F00;&#x53D1;&#x8005;&#x3001; &#x793E;&#x533A;&#x6210;&#x5458;&#x3001; &#x8D21;&#x732E;&#x8005;&#x3001; &#x5B66;&#x751F;&#x3001; &#x653F;&#x5E9C;&#x4F01;&#x4E1A;&#x7BA1;&#x7406;&#x4EBA;&#x5458;</li>
<li>&#x8C03;&#x67E5;&#x5185;&#x5BB9;&#xFF1A;&#x4E3B;&#x8981;&#x6DB5;&#x76D6;&#x4E2A;&#x4EBA;&#x4FE1;&#x606F;&#x3001; &#x5DE5;&#x4F5C;&#x72B6;&#x51B5;&#x3001; &#x5F00;&#x6E90;&#x793E;&#x533A;&#x4EE5;&#x53CA;&#x5F00;&#x53D1;&#x8005;&#x6280;&#x672F;&#x8C03;&#x67E5;</li>
<li>&#x8C03;&#x67E5;&#x65B9;&#x6CD5;&#xFF1A;&#x4EE5;&#x5728;&#x7EBF;&#x95EE;&#x5377;&#x65B9;&#x5F0F;&#x641C;&#x96C6;&#x6837;&#x672C;&#x548C;&#x6570;&#x636E;&#xFF0C; &#x4EA4;&#x53C9;&#x5BF9;&#x6BD4;&#x6CD5;&#x5206;&#x6790;&#x6570;&#x636E;</li>
<li>&#x63A8;&#x5E7F;&#x65B9;&#x6CD5;&#xFF1A;&#x7EBF;&#x4E0A;&#x793E;&#x4EA4;&#x5A92;&#x4F53;&#x3001;&#x535A;&#x5BA2;&#x3001;&#x5F00;&#x6E90;&#x793E;&#x3001;&#x6398;&#x91D1;&#x3001;GitChat&#x3001; CSDN &#x7F51;&#x7AD9;&#xFF0C;Linux &#x4E2D;&#x56FD;&#x548C;&#x8BBA;&#x575B;&#xFF1B;&#x7EBF;&#x4E0B;&#x6C99;&#x9F99;&#x4F1A;&#x8BAE;&#x641C;&#x96C6;&#x95EE;&#x5377;</li>
<li>&#x95EE;&#x9898;&#x6570;&#x91CF;&#xFF1A;50</li>
<li>&#x6837;&#x672C;&#x91CF;&#xFF1A;508</li>
</ul>
<h5 id="12-&#x7279;&#x9080;&#x4E13;&#x5BB6;"><strong>1.2 &#x7279;&#x9080;&#x4E13;&#x5BB6;</strong></h5>
<ul>
<li><strong>&#x848B;&#x6D9B;</strong>&#xFF1A;CSDN &#x521B;&#x59CB;&#x4EBA; &amp; &#x8463;&#x4E8B;&#x957F;&#xFF0C;&#x6781;&#x5BA2;&#x5E2E;&#x521B;&#x6295;&#x521B;&#x59CB;&#x5408;&#x4F19;&#x4EBA;</li>
<li><strong>&#x8C22;&#x5DE5;</strong>&#xFF1A;GitChat CEO</li>
<li><strong>&#x9634;&#x660E;</strong>&#xFF1A;&#x6398;&#x91D1; CEO</li>
<li><strong>&#x738B;&#x5174;&#x5B87;</strong>&#xFF1A;Linux &#x4E2D;&#x56FD;&#x521B;&#x59CB;&#x4EBA;</li>
<li><strong>&#x738B;&#x542F;&#x6CF0;</strong>&#xFF1A;&#x6307;&#x5357;&#x9488;&#x8054;&#x5408;&#x521B;&#x59CB;&#x4EBA;</li>
<li><strong>&#x6881;&#x8389;</strong>&#xFF1A; FreeBSD &#x57FA;&#x91D1;&#x4F1A;&#x8463;&#x4E8B;&#x603B;&#x76D1;</li>
</ul>
<h4 id="&#x4E8C;&#x3001;&#x91CD;&#x8981;&#x53D1;&#x73B0;">&#x4E8C;&#x3001;&#x91CD;&#x8981;&#x53D1;&#x73B0;</h4>
<p>&#x901A;&#x8FC7;&#x5206;&#x6790; 2018 &#x5E74;&#x7684;&#x7EDF;&#x8BA1;&#x6570;&#x636E;&#xFF0C;&#x5E76;&#x4E14;&#x5BF9;&#x6BD4; 2015 &#x5E74;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x4EE5;&#x53CA;&#x6211;&#x4EEC;&#x80FD;&#x591F;&#x627E;&#x5230;&#x7684;&#x5176;&#x4ED6;&#x4E00;&#x4E9B;&#x516C;&#x5F00;&#x53D1;&#x5E03;&#x7684;&#x7EDF;&#x8BA1;&#x62A5;&#x544A;&#xFF0C;&#x6211;&#x4EEC;&#x6709;&#x4E86;&#x5982;&#x4E0B;&#x4E00;&#x4E9B;&#x91CD;&#x8981;&#x53D1;&#x73B0;&#xFF1A;</p>
<ul>
<li>&#x5973;&#x6027;&#x53C2;&#x4E0E;&#x8005;&#x6BD4;&#x4F8B;&#x6B63;&#x5728;&#x4E0A;&#x5347;&#xFF0C;2015 &#x5E74;&#x4E3A; 11%&#xFF0C;2018 &#x5E74;&#x4E0A;&#x5347;&#x5230; 12%</li>
<li>&#x5F00;&#x6E90;&#x53C2;&#x4E0E;&#x8005;&#xFF0C;20~39 &#x5C81;&#x4EBA;&#x7FA4;&#x662F;&#x7EDD;&#x5BF9;&#x4E3B;&#x529B;&#xFF0C;&#x8D85;&#x8FC7;87%&#x3002;&#x4F46;&#x662F;&#x76F8;&#x6BD4; 2015 &#x5E74;&#xFF0C;30~39 &#x5C81;&#x4EE5;&#x4E0A;&#x7684;&#x4EBA;&#x7FA4;&#x6BD4;&#x4F8B;&#x5728;&#x6301;&#x7EED;&#x589E;&#x957F;</li>
<li>&#x8D85;&#x8FC7;7&#x6210;&#x4EE5;&#x4E0A;&#x7684;&#x53C2;&#x4E0E;&#x8005;&#xFF0C;&#x6765;&#x81EA;&#x4E92;&#x8054;&#x7F51;&#x4F01;&#x4E1A;&#xFF0C;&#x4F46;&#x662F;&#x8F83;&#x4E4B; 2015 &#x5E74;&#xFF0C;&#x66F4;&#x591A;&#x7684;&#x91D1;&#x878D;&#x3001;&#x94F6;&#x884C;&#x9886;&#x57DF;&#x7684;&#x4F01;&#x4E1A;&#x5F00;&#x59CB;&#x5173;&#x6CE8;&#x5F00;&#x6E90;</li>
<li>&#x5F00;&#x6E90;&#x5F00;&#x53D1;&#x8005;&#x7684;&#x6536;&#x5165;&#x5728;&#x6301;&#x7EED;&#x4E0A;&#x5347;&#xFF0C;&#x6839;&#x636E;&#x7EDF;&#x8BA1;&#x6570;&#x636E;&#xFF0C;&#x4F4E;&#x4E8E; 1.4 &#x4E07;&#x4EE5;&#x4E0B;&#x7684;&#x6536;&#x5165;&#x6BD4;&#x4F8B;&#x5728;&#x4E0B;&#x964D;&#xFF08;76%-&gt;60%&#xFF09;&#xFF0C;&#x9AD8;&#x4E8E;1.5  &#x4E07;&#x4EE5;&#x4E0A;&#x7684;&#x6536;&#x5165;&#x6BD4;&#x4F8B;&#x5728;&#x660E;&#x663E;&#x4E0A;&#x5347;&#xFF08;24%-&gt;40%&#xFF09;</li>
<li>&#x5728;&#x5438;&#x5F15;&#x7528;&#x6237;&#x4F7F;&#x7528;&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#x7684;&#x7406;&#x7531;&#x65B9;&#x9762;&#xFF0C;&#x8282;&#x7701;&#x5F00;&#x53D1;&#x6210;&#x672C;&#x4E00;&#x76F4;&#x90FD;&#x4E0D;&#x662F;&#x6700;&#x91CD;&#x8981;&#x7684;&#x56E0;&#x7D20;&#x3002;&#x901A;&#x8FC7;&#x5BF9;&#x6BD4;&#x6570;&#x636E;&#x8FD8;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x8FD1;&#x5E74;&#x6765;&#xFF1A;&#x5927;&#x5BB6;&#x5BF9;&#x4E8E;&#x5F00;&#x6E90;&#x793E;&#x533A;&#x7684;&#x652F;&#x6301;&#x4E0E;&#x5F00;&#x6E90;&#x7CBE;&#x795E;&#x4E0E;&#x7406;&#x5FF5;&#x7684;&#x91CD;&#x89C6;&#xFF0C;&#x6B63;&#x5728;&#x9010;&#x6B65;&#x4E0A;&#x5347;</li>
<li>&#x867D;&#x7136;&#x4F9D;&#x7136;&#x6709;&#x8D85;&#x8FC7; 8 &#x6210;&#x7684;&#x5F00;&#x53D1;&#x8005;&#xFF0C;&#x5F88;&#x5C11;&#x6216;&#x4ECE;&#x672A;&#x901A;&#x8FC7;&#x5F00;&#x6E90;&#x83B7;&#x5F97;&#x6536;&#x5165;&#xFF0C;&#x4F46;&#x662F;&#x76F8;&#x6BD4; 3 &#x5E74;&#x524D;&#xFF0C;&#x786E;&#x5B9E;&#x6709;&#x66F4;&#x591A;&#x7684;&#x5F00;&#x53D1;&#x8005;&#xFF0C;&#x83B7;&#x5F97;&#x4E86;&#x4E00;&#x4E9B;&#x6536;&#x5165;&#x3002;&#x800C;&#x4E14;&#x6709;&#x66F4;&#x591A;&#x7684;&#x5F00;&#x53D1;&#x8005;&#xFF0C;&#x88AB;&#x4F01;&#x4E1A;&#x96C7;&#x4F63;&#x5168;&#x804C;&#x6295;&#x5165;&#x5F00;&#x6E90;&#xFF08;9%-&gt;16.95%&#xFF09;</li>
<li>&#x53E6;&#x4E00;&#x4E2A;&#x6BD4;&#x8F83;&#x53EF;&#x559C;&#x7684;&#x8FDB;&#x6B65;&#xFF0C;&#x662F;&#x5BF9;&#x4E8E;&#x5F00;&#x6E90;&#x7684;&#x4FE1;&#x4EFB;&#x5EA6;&#x4E5F;&#x5728;&#x9010;&#x6B65;&#x4E0A;&#x5347;&#xFF0C;&#x5BF9;&#x4E8E;&#x5F00;&#x6E90;&#x53EF;&#x80FD;&#x4EA7;&#x751F;&#x4E0D;&#x5B89;&#x5168;&#x611F;&#x7684;&#x4EBA;&#xFF0C;&#x4E0B;&#x964D;&#x4E86; 3.6%</li>
<li>&#x5FAE;&#x4FE1;&#x5DF2;&#x7ECF;&#x53D6;&#x4EE3;&#x4E86;&#x4F20;&#x7EDF;&#x7684;&#x90AE;&#x4EF6;&#x5217;&#x8868;&#x6210;&#x4E3A;&#x4E86;&#x5F00;&#x6E90;&#x793E;&#x533A;&#x4EA4;&#x6D41;&#x7684;&#x4E3B;&#x8981;&#x5DE5;&#x5177;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x6709;&#x8DA3;&#x7684;&#x65B0;&#x73B0;&#x8C61;&#xFF0C;&#x662F;&#x7535;&#x62A5;&#x7FA4; + zoom&#xFF0C;&#x6210;&#x4E3A;&#x5F88;&#x591A;&#x793E;&#x533A;&#x4EA4;&#x6D41;&#x7684;&#x5DE5;&#x5177;</li>
<li>&#x5728;&#x201C;&#x54EA;&#x4E2A;&#x516C;&#x53F8;&#x5BF9;&#x4E8E;&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#x7684;&#x8D21;&#x732E;&#x6700;&#x5927;&#x201D;&#x8FD9;&#x4E00;&#x95EE;&#x9898;&#x7684;&#x8C03;&#x67E5;&#x4E2D;&#xFF0C;&#x6709;&#x4E00;&#x4E9B;&#x503C;&#x5F97;&#x6CE8;&#x610F;&#x7684;&#x53D8;&#x5316;&#xFF1A;Google&#x3001;GitHub&#x3001;Alibaba &#x662F;&#x524D;&#x4E09;&#x7532;&#xFF0C;&#x4F46;&#x662F;&#xFF1A;&#x5FAE;&#x8F6F;&#x7684;&#x6392;&#x540D;&#x5927;&#x5E45;&#x5EA6;&#x4E0A;&#x5347;&#xFF0C;&#x5982;&#x679C;&#x8003;&#x8651;&#x5230;&#x88AB;&#x5FAE;&#x8F6F;&#x6536;&#x8D2D;&#x7684; GitHub&#xFF0C;&#x7B80;&#x76F4;&#x6709;&#x4E00;&#x4E3E;&#x8D85;&#x8FC7; Google &#x7684;&#x8D8B;&#x52BF;&#x3002;&#x56FD;&#x5185;&#x516C;&#x53F8;&#xFF0C;&#x5728; 2015 &#x5E74;&#x65F6;&#xFF0C;&#x5373;&#x4F7F;&#x662F; BAT &#x4E5F;&#x6392;&#x540D; 10 &#x540D;&#x4EE5;&#x540E;&#xFF0C;&#x4F46;&#x662F;&#x5230;&#x4E86; 2018 &#x5E74;&#xFF0C;&#x66F4;&#x591A;&#x7684;&#x4E2D;&#x56FD;&#x516C;&#x53F8;&#xFF0C;&#x83B7;&#x5F97;&#x4E86;&#x66F4;&#x9AD8;&#x7684;&#x8BC4;&#x4EF7;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x963F;&#x91CC;&#x548C;&#x534E;&#x4E3A;&#xFF0C;&#x8FDB;&#x6B65;&#x975E;&#x5E38;&#x660E;&#x663E;</li>
</ul>
<h4 id="&#x4E09;&#x3001;&#x5F00;&#x53D1;&#x8005;&#x7FA4;&#x4F53;&#x7279;&#x5F81;">&#x4E09;&#x3001;&#x5F00;&#x53D1;&#x8005;&#x7FA4;&#x4F53;&#x7279;&#x5F81;</h4>
<h5 id="31-&#x8FD1;&#x4E5D;&#x6210;&#x53C2;&#x4E0E;&#x8005;&#x4E3A;&#x7537;&#x6027;&#xFF0C;&#x666E;&#x904D;&#x5E74;&#x8F7B;&#x4E14;&#x6709;&#x8F83;&#x9AD8;&#x5B66;&#x5386;"><strong>3.1 &#x8FD1;&#x4E5D;&#x6210;&#x53C2;&#x4E0E;&#x8005;&#x4E3A;&#x7537;&#x6027;&#xFF0C;&#x666E;&#x904D;&#x5E74;&#x8F7B;&#x4E14;&#x6709;&#x8F83;&#x9AD8;&#x5B66;&#x5386;</strong></h5>
<p>&#x53C2;&#x4E0E;&#x8005;&#x4E2D;&#x7537;&#x6027;&#x5360;&#x6BD4;&#x8FBE;&#x5230; 88%&#xFF0C;&#x4EC5;&#x6709; 12% &#x4E3A;&#x5973;&#x6027;&#x3002;&#x666E;&#x904D;&#x53D7;&#x6559;&#x80B2;&#x7A0B;&#x5EA6;&#x8F83;&#x9AD8;&#xFF0C;&#x5177;&#x6709;&#x672C;&#x79D1;&#x4EE5;&#x4E0A;&#x5B66;&#x5386;&#x7684;&#x5360;&#x5230; 81% &#x4EE5;&#x4E0A;&#xFF0C;&#x800C;&#x5176;&#x4E2D; 90 &#x540E;&#x5DF2;&#x7ECF;&#x6210;&#x4E3A;&#x4E3B;&#x529B;&#x519B;&#x3002;</p>
<p><img src="https://images.gitbook.cn/4302fca0-d40e-11e8-80d1-917ffa8847fa" alt="enter image description here"></p>
<blockquote>
<p>&#x3010;&#x8C22;&#x5DE5;&#x70B9;&#x8BC4;&#x3011;&#x5F00;&#x6E90;&#x662F;&#x4E92;&#x8054;&#x7F51;&#x6280;&#x672F;&#x53D1;&#x5C55;&#x7684;&#x91CD;&#x8981;&#x5F15;&#x64CE;&#xFF0C;&#x867D;&#x7136;&#x5F00;&#x6E90;&#x5F00;&#x53D1;&#x8005;&#x7684;&#x6536;&#x5165;&#x8F83;&#x4E4B;&#x524D;&#x6709;&#x4E86;&#x957F;&#x8DB3;&#x7684;&#x8FDB;&#x6B65;&#xFF0C;&#x4F46;&#x662F;&#x4ECD;&#x7136;&#x4E0D;&#x80FD;&#x4E0E;&#x5176;&#x8D21;&#x732E;&#x76F8;&#x5E73;&#x8861;&#xFF0C;&#x4ECD;&#x7136;&#x9700;&#x8981;&#x62D3;&#x5C55;&#x51FA;&#x66F4;&#x591A;&#x7684;&#x9014;&#x5F84;&#xFF0C;&#x6765;&#x6FC0;&#x52B1;&#x5F00;&#x6E90;&#x5F00;&#x53D1;&#x8005;&#x7684;&#x79EF;&#x6781;&#x6027;&#xFF0C;&#x523A;&#x6FC0;&#x5F00;&#x6E90;&#x5FEB;&#x901F;&#x53D1;&#x5C55;&#xFF0C;&#x53E6;&#x5916;&#x5F00;&#x6E90;&#x793E;&#x533A;&#x5EFA;&#x8BBE;&#x540C;&#x6837;&#x91CD;&#x8981;&#xFF0C;&#x9700;&#x8981;&#x4E3A;&#x5F00;&#x53D1;&#x8005;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x66F4;&#x52A0;&#x6D3B;&#x8DC3;&#x3001;&#x5B8C;&#x5584;&#x7684;&#x4EA7;&#x54C1;&#x548C;&#x5185;&#x5BB9;&#x5E73;&#x53F0;&#xFF0C;&#x6765;&#x5438;&#x7EB3;&#x66F4;&#x591A;&#x5F00;&#x6E90;&#x5F00;&#x53D1;&#x8005;&#x3002;</p>
<p>&#x3010;&#x6881;&#x8389;&#x70B9;&#x8BC4;&#x3011;&#x5728;&#x4ECA;&#x5E74; Stack Overflow &#x5F00;&#x53D1;&#x8005;&#x8C03;&#x67E5;&#x4E2D;&#xFF0C;&#x5168;&#x7403;&#x8303;&#x56F4;&#x5185;&#x53EA;&#x6709; 6.9% &#x7684;&#x5973;&#x6027;&#x5F00;&#x53D1;&#x8005;&#x3002;&#x867D;&#x7136;&#x5728;&#x8FD9;&#x6B21;&#x4E2D;&#x56FD;&#x5F00;&#x6E90;&#x53C2;&#x4E0E;&#x8C03;&#x67E5;&#x4E2D;&#x4E5F;&#x4EC5;&#x6709; 12% &#x7684;&#x5973;&#x6027;&#xFF0C;&#x4F46;&#x76F8;&#x5BF9;&#x4E8E;&#x5168;&#x7403;&#x6765;&#x8BF4;&#x5728;&#x4E2D;&#x56FD;&#x5973;&#x6027;&#x53C2;&#x4E0E;&#x5F00;&#x6E90;&#x5F00;&#x53D1;&#x7684;&#x6BD4;&#x4F8B;&#x8FD8;&#x662F;&#x8BA9;&#x4EBA;&#x6B23;&#x559C;&#x7684;&#x3002;&#x53E6;&#x5916;&#xFF0C;90 &#x540E;&#x4E3B;&#x529B;&#x519B;&#x7684;&#x6D8C;&#x73B0;&#x4E5F;&#x8BA9;&#x6211;&#x4EEC;&#x770B;&#x5230;&#x5F00;&#x6E90;&#x6587;&#x5316;&#x5728;&#x4E2D;&#x56FD;&#x662F;&#x771F;&#x6B63;&#x624E;&#x6839;&#x4E86;&#x3002;</p>
<p>&#x3010;&#x9634;&#x660E;&#x70B9;&#x8BC4;&#x3011;&#x53EF;&#x4EE5;&#x660E;&#x663E;&#x770B;&#x5230;&#x6398;&#x91D1;&#x5E74;&#x8F7B;&#x5F00;&#x53D1;&#x8005;&#x662F;&#x5F00;&#x6E90;&#x7684;&#x4E3B;&#x529B;&#x519B;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x5E74;&#x8F7B;&#x5F00;&#x53D1;&#x8005;&#x5929;&#x7136;&#x5730;&#x63A5;&#x53D7;&#x548C;&#x4F7F;&#x7528;&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x56E0;&#x4E3A; GitHub &#x7684;&#x6210;&#x529F;&#xFF0C;&#x5927;&#x5BB6;&#x5728;&#x63A5;&#x89E6;&#x5F00;&#x6E90;&#x4EE3;&#x7801;&#x4E0A;&#x6709;&#x4E86;&#x66F4;&#x65B9;&#x4FBF;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x540C;&#x65F6;&#x53EF;&#x4EE5;&#x5FEB;&#x901F;&#x53C2;&#x4E0E;&#x5230;&#x6E90;&#x4EE3;&#x7801;&#x7684;&#x4F7F;&#x7528;&#x548C;&#x8D21;&#x732E;&#x5F53;&#x4E2D;&#x3002;&#x66F4;&#x6DF1;&#x5C42;&#x6B21;&#x7684;&#x601D;&#x8003;&#xFF0C;&#x968F;&#x7740;&#x8FD9;&#x4E00;&#x6279;&#x5E74;&#x8F7B;&#x5F00;&#x53D1;&#x8005;&#x9010;&#x6E10;&#x5728;&#x8F6F;&#x4EF6;&#x884C;&#x4E1A;&#x6709;&#x66F4;&#x5927;&#x7684;&#x53C2;&#x4E0E;&#x5EA6;&#xFF0C;&#x4ED6;&#x4EEC;&#x5BF9;&#x5F00;&#x6E90;&#x7684;&#x719F;&#x6089;&#x4F1A;&#x7EE7;&#x7EED;&#x589E;&#x5F3A;&#x5F00;&#x6E90;&#x751F;&#x6001;&#x5728;&#x4E2D;&#x56FD;&#x5F00;&#x53D1;&#x8005;&#x4E2D;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x5F00;&#x6E90;&#x672C;&#x8EAB;&#x4E5F;&#x4F1A;&#x5728;&#x672A;&#x6765;&#x53EF;&#x9884;&#x671F;&#x7684;&#x65F6;&#x95F4;&#x91CC;&#x52A0;&#x901F;&#x6210;&#x719F;&#x3002;</p>
</blockquote>
<h5 id="32-&#x4ECE;&#x4E1A;&#x65F6;&#x95F4;"><strong>3.2 &#x4ECE;&#x4E1A;&#x65F6;&#x95F4;</strong></h5>
<p>&#x53C2;&#x4E0E;&#x8005;&#x4E2D;&#x6709;&#x8FD1;&#x4E03;&#x6210;&#x5DE5;&#x4F5C;&#x65F6;&#x95F4;&#x4E0D;&#x8DB3; 5 &#x5E74;&#xFF0C;&#x5973;&#x6027;&#x7684;&#x6BD4;&#x4F8B;&#x5728;&#x672A;&#x53C2;&#x52A0;&#x5DE5;&#x4F5C;&#x7684;&#x6BD4;&#x4F8B;&#x6700;&#x5927;&#xFF0C;&#x5176;&#x6B21;&#x662F;&#x5DE5;&#x4F5C; 15 &#x5E74;&#x4EE5;&#x4E0A;&#x53CA;&#x5DE5;&#x4F5C;&#x5E74;&#x9650;&#x4E3A; 10-15 &#x5E74;&#x8FD9;&#x4E2A;&#x533A;&#x95F4;&#x5973;&#x6027;&#x6BD4;&#x4F8B;&#x4E5F;&#x6BD4;&#x8F83;&#x9AD8;&#x3002;</p>
<p><img src="https://images.gitbook.cn/7b83b560-d40e-11e8-80d1-917ffa8847fa" alt="enter image description here"></p>
<p><img src="https://images.gitbook.cn/97323200-d40e-11e8-80d1-917ffa8847fa" alt="enter image description here"></p>
<blockquote>
<p>&#x3010;&#x738B;&#x542F;&#x6CF0;&#x70B9;&#x8BC4;&#x3011;17% &#x672A;&#x5C31;&#x4E1A;&#x662F;&#x4EE5;&#x5B66;&#x751F;&#x4E3A;&#x4E3B;&#x7684;&#x7FA4;&#x4F53;&#xFF0C;&#x8FD9;&#x4E2A;&#x6BD4;&#x4F8B;&#x5F88;&#x8BA9;&#x4EBA;&#x6B23;&#x6170;&#x3002;12% &#x7684;&#x6BD4;&#x4F8B;&#x6765;&#x81EA;&#x521A;&#x8FDB;&#x5165;&#x5DE5;&#x4F5C;&#x7FA4;&#x4F53;&#xFF0C;&#x56E0;&#x4E3A;&#x719F;&#x6089;&#x5DE5;&#x4F5C;&#xFF0C;&#x6240;&#x4EE5;&#x5360;&#x6574;&#x4F53;&#x6BD4;&#x4F8B;&#x6BD4;&#x8F83;&#x4F4E;&#x662F;&#x5408;&#x7406;&#x7684;&#x3002;&#x8FD9;&#x4E2A;&#x6BD4;&#x4F8B;&#x9010;&#x6E10;&#x5347;&#x5230; 20% &#x7684;&#x5DE5;&#x4F5C; 1-2 &#x5E74;&#x7684;&#x7FA4;&#x4F53;&#xFF0C;&#x5230;&#x4E3B;&#x529B;&#x7684; 24% &#x7684; 3-5 &#x5E74;&#x5DE5;&#x4F5C;&#x7684;&#x7FA4;&#x4F53;&#xFF0C;&#x968F;&#x7740;&#x5DE5;&#x4F5C;&#x5E74;&#x6570;&#x7684;&#x589E;&#x52A0;&#xFF0C;&#x5DE5;&#x4F5C;&#x7684;&#x91CD;&#x5FC3;&#x8F6C;&#x79BB;&#x5F00;&#x6E90;&#x7684;&#x53C2;&#x4E0E;&#x6BD4;&#x4F8B;&#x4E0B;&#x964D;&#x3002;&#x8FD9;&#x4E2A;&#x662F;&#x4E00;&#x4E2A;&#x5408;&#x4E4E;&#x60C5;&#x7406;&#x7684;&#x6F14;&#x8FDB;&#xFF0C;&#x4F46;&#x662F;&#x8FD8;&#x662F;&#x671F;&#x671B;&#x66F4;&#x6709;&#x7ECF;&#x9A8C;&#x7684;&#x8D44;&#x6DF1;&#x4EBA;&#x5458;&#x80FD;&#x591F;&#x53C2;&#x4E0E;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x4E2D;&#x3002;</p>
</blockquote>
<h5 id="33-&#x884C;&#x4E1A;&#x9886;&#x57DF;"><strong>3.3 &#x884C;&#x4E1A;&#x9886;&#x57DF;</strong></h5>
<p>&#x53C2;&#x4E0E;&#x8C03;&#x67E5;&#x8005;&#x4E2D;&#xFF0C;&#x6709;&#x8D85;&#x8FC7;&#x4E03;&#x6210;&#x7684;&#x8C03;&#x67E5;&#x8005;&#x5747;&#x5C31;&#x804C;&#x4E8E;&#x4E92;&#x8054;&#x7F51;&#x5F00;&#x53D1;&#x548C;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x9886;&#x57DF;&#xFF0C;<del>&#x5176;&#x6B21;</del>&#x6559;&#x80B2;/&#x5B66;&#x672F;/&#x79D1;&#x7814;&#x9886;&#x57DF;&#x7684;&#x5360;&#x6BD4;&#x4E5F;&#x8FBE;&#x5230;&#x4E86; 5%&#x3002;</p>
<p><img src="https://images.gitbook.cn/0dd4adc0-d40f-11e8-80d1-917ffa8847fa" alt="enter image description here"></p>
<blockquote>
<p>&#x3010;&#x738B;&#x542F;&#x6CF0;&#x70B9;&#x8BC4;&#x3011;&#x8FD9;&#x4E2A;&#x5206;&#x7C7B;&#x6BD4;&#x8F83;&#x5E7F;&#xFF0C;&#x5982;&#x679C;&#x80FD;&#x591F;&#x628A;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x5206;&#x7684;&#x66F4;&#x7EC6;&#x4F1A;&#x66F4;&#x52A0;&#x7CBE;&#x786E;&#x3002;&#x603B;&#x4F53;&#x800C;&#x8BBA;&#xFF0C;&#x4E92;&#x8054;&#x7F51;&#x5F00;&#x53D1;&#x5E94;&#x8BE5;&#x4E5F;&#x662F;&#x5E7F;&#x4E49;&#x7684;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x7684;&#x4E00;&#x7C7B;&#x3002;&#x8FD9;&#x4E2A;&#x8C03;&#x67E5;&#x7ED3;&#x679C;&#x53CD;&#x6620;&#x51FA;&#x8F6F;&#x4EF6;&#x884C;&#x4E1A;&#x5BF9;&#x4E8E;&#x5F00;&#x6E90;&#x7684;&#x8D21;&#x732E;&#x53C2;&#x4E0E;&#x662F;&#x6BD4;&#x8F83;&#x6709;&#x5B9E;&#x7528;&#x7684;&#x89D2;&#x5EA6;&#xFF0C;&#x76F8;&#x5BF9;&#x4E8E;&#x5B66;&#x672F;&#x79D1;&#x7814;&#x7684;&#x8D21;&#x732E;&#x662F;&#x6BD4;&#x8F83;&#x5148;&#x8FDB;&#x548C;&#x5B9E;&#x9A8C;&#x6027;&#x8D28;&#x591A;&#x7684;&#x3002;</p>
</blockquote>
<h5 id="34-&#x5973;&#x6027;&#x8F83;&#x504F;&#x91CD;&#x524D;&#x7AEF;&#x4E0E;&#x5BA2;&#x6237;&#x7AEF;&#x5F00;&#x53D1;"><strong>3.4 &#x5973;&#x6027;&#x8F83;&#x504F;&#x91CD;&#x524D;&#x7AEF;&#x4E0E;&#x5BA2;&#x6237;&#x7AEF;&#x5F00;&#x53D1;</strong></h5>
<p>&#x5C31;&#x6280;&#x672F;&#x9886;&#x57DF;&#x800C;&#x8A00;&#xFF0C;&#x540E;&#x7AEF;&#x5F00;&#x53D1;&#x5360;&#x636E;&#x4E86;&#x8FD1;&#x4E09;&#x5206;&#x4E4B;&#x4E00;&#x7684;&#x4EFD;&#x989D;&#xFF0C;&#x800C;&#x4ECE;&#x4E0E;&#x6027;&#x522B;&#x7684;&#x4EA4;&#x53C9;&#x5BF9;&#x6BD4;&#x4E2D;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x5973;&#x6027;&#x8F83;&#x504F;&#x91CD; AI &#x5F00;&#x53D1;&#x4E0E;&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x5458;&#x7684;&#x5DE5;&#x4F5C;&#x3002;</p>
<p><img src="https://images.gitbook.cn/dd980bc0-d40e-11e8-80d1-917ffa8847fa" alt="enter image description here"></p>
<p><img src="https://images.gitbook.cn/faa247d0-d40e-11e8-80d1-917ffa8847fa" alt="enter image description here"></p>
<h5 id="35-&#x6536;&#x5165;&#x6C34;&#x5E73;"><strong>3.5 &#x6536;&#x5165;&#x6C34;&#x5E73;</strong></h5>
<p>&#x5F00;&#x6E90;&#x5F00;&#x53D1;&#x8005;&#x6536;&#x5165;&#x6C34;&#x5E73;&#x666E;&#x904D;&#x8F83;&#x9AD8;&#xFF0C;&#x6709; 77% &#x7684;&#x5F00;&#x53D1;&#x8005;&#x6708;&#x6536;&#x5165;&#x8D85;&#x8FC7; 5000 &#x5143;&#x3002;&#x6536;&#x5165;&#x5728; 1.5-3W &#x8FD9;&#x4E2A;&#x533A;&#x95F4;&#x7684;&#x6BD4;&#x4F8B;&#x4ECE; 2015 &#x5E74;&#x7684; 18.6% &#x589E;&#x957F;&#x5230; 27.35%&#x3002;&#x9AD8;&#x6536;&#x5165;&#x4EBA;&#x7FA4;&#x4F8B;&#x5982; 5 &#x4E07;&#x4EE5;&#x4E0A;&#x4ECE; 2015 &#x5E74;&#x7684; 1.5% &#x589E;&#x957F;&#x5230; 5.1%&#x3002;</p>
<p><img src="https://images.gitbook.cn/2cf45c50-d40f-11e8-80d1-917ffa8847fa" alt="enter image description here"></p>
<p>&#x53E6;&#x5916;&#xFF0C;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x53C2;&#x4E0E;&#x8005;&#x6536;&#x5165;&#x6C34;&#x5E73;&#x4E0E;&#x884C;&#x4E1A;&#x7ECF;&#x9A8C;&#x6709;&#x8F83;&#x76F4;&#x63A5;&#x5173;&#x7CFB;&#xFF0C;&#x4ECE;&#x4E1A;&#x65F6;&#x95F4;&#x8D8A;&#x957F;&#x8005;&#x5E73;&#x5747;&#x6708;&#x6536;&#x5165;&#x660E;&#x663E;&#x8D8A;&#x9AD8;&#x3002;</p>
<p><img src="https://images.gitbook.cn/435f7f10-d40f-11e8-80d1-917ffa8847fa" alt="enter image description here"></p>
<blockquote>
<p>&#x3010;&#x9634;&#x660E;&#x70B9;&#x8BC4;&#x3011;&#x901A;&#x8FC7;&#x4E0A;&#x8FF0;&#x7684;&#x5E74;&#x9F84;&#x3001;&#x5DE5;&#x4F5C;&#x5E74;&#x9650;&#x548C;&#x85AA;&#x8D44;&#x60C5;&#x51B5;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x76EE;&#x524D;&#x5F00;&#x6E90;&#x7684;&#x53C2;&#x4E0E;&#x8005;&#x504F;&#x4E8E;&#x5E74;&#x8F7B;&#x5316;&#xFF0C;&#x5B66;&#x751F;&#x7FA4;&#x4F53;&#x548C;&#x521D;&#x5165;&#x804C;&#x573A;&#x7684;&#x5F00;&#x53D1;&#x7EC4;&#x4E3A;&#x4E3B;&#x8981;&#x4EBA;&#x7FA4;&#x3002;&#x8FD9;&#x91CC;&#x8981;&#x6CE8;&#x610F;&#xFF0C;&#x4ED6;&#x4EEC;&#x5BF9;&#x4E8E;&#x5F00;&#x6E90;&#x7684;&#x70ED;&#x7231;&#x66F4;&#x591A;&#x7684;&#x5F97;&#x76CA;&#x4E8E;&#x6536;&#x76CA;&#xFF0C;&#x800C;&#x975E;&#x8D21;&#x732E;&#xFF0C;&#x8FD9;&#x5176;&#x4E2D;&#x5927;&#x6BD4;&#x4F8B;&#x7684;&#x5F00;&#x53D1;&#x8005;&#x5728;&#x5229;&#x7528;&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#x5B66;&#x4E60;&#x548C;&#x5B9E;&#x73B0;&#x4E1A;&#x52A1;&#xFF0C;&#x800C;&#x662F;&#x5426;&#x6709;&#x53C2;&#x4E0E;&#x4EE5;&#x53CA;&#x5728;&#x672A;&#x6765;&#x7684;&#x5DE5;&#x4F5C;&#x4E2D;&#x80FD;&#x5426;&#x771F;&#x6B63;&#x8D21;&#x732E;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#xFF0C;&#x662F;&#x5F00;&#x6E90;&#x5E02;&#x573A;&#x672C;&#x8EAB;&#x7684;&#x91CD;&#x8981;&#x95EE;&#x9898;&#x3002;&#x56E0;&#x800C;&#xFF0C;&#x5C31;&#x76EE;&#x524D;&#x6765;&#x770B;&#xFF0C;&#x5982;&#x4F55;&#x5F15;&#x5BFC;&#x548C;&#x652F;&#x6301;&#x8FD9;&#x4E9B;&#x5E74;&#x8F7B;&#x7684;&#x5F00;&#x6E90;&#x7231;&#x597D;&#x8005;&#x6210;&#x4E3A;&#x5F00;&#x6E90;&#x8D21;&#x732E;&#x8005;&#x662F;&#x5F00;&#x6E90;&#x4E16;&#x754C;&#x7684;&#x6240;&#x6709;&#x53C2;&#x4E0E;&#x65B9;&#x9700;&#x8981;&#x52AA;&#x529B;&#x7684;&#x65B9;&#x5411;&#x3002;</p>
</blockquote>
<h4 id="&#x56DB;&#x3001;&#x5F00;&#x6E90;&#x5DE5;&#x4F5C;&#x73B0;&#x72B6;">&#x56DB;&#x3001;&#x5F00;&#x6E90;&#x5DE5;&#x4F5C;&#x73B0;&#x72B6;</h4>
<h5 id="41-&#x5728;&#x5F00;&#x6E90;&#x4E2D;&#x7684;&#x65F6;&#x95F4;&#x6295;&#x5165;"><strong>4.1 &#x5728;&#x5F00;&#x6E90;&#x4E2D;&#x7684;&#x65F6;&#x95F4;&#x6295;&#x5165;</strong></h5>
<p>&#x53C2;&#x4E0E;&#x8005;&#x6BCF;&#x5468;&#x6295;&#x5165;&#x7684;&#x5F00;&#x6E90;&#x65F6;&#x95F4;&#x4E2D;&#xFF0C;&#x534A;&#x6570;&#x4E0D;&#x8DB3; 2 &#x5C0F;&#x65F6;&#x3002;&#x4F46;&#x660E;&#x663E;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x53C2;&#x4E0E;&#x5DE5;&#x4F5C;&#x8D8A;&#x4E45;&#x7684;&#x4EBA;&#xFF0C;&#x5176;&#x6BCF;&#x5468;&#x53C2;&#x4E0E;&#x5F00;&#x6E90;&#x5DE5;&#x4F5C;&#x7684;&#x65F6;&#x95F4;&#x4E5F;&#x660E;&#x663E;&#x8D8A;&#x957F;&#xFF0C;15 &#x5E74;&#x4EE5;&#x4E0A;&#x5DE5;&#x4F5C;&#x7ECF;&#x5386;&#x7684;&#x53C2;&#x4E0E;&#x8005;&#x4E2D;&#xFF0C;&#x6709;&#x8FD1; 12% &#x6BCF;&#x5468;&#x7684;&#x53C2;&#x4E0E;&#x65F6;&#x95F4;&#x9AD8;&#x8FBE; 40 &#x5C0F;&#x65F6;&#x4EE5;&#x4E0A;&#x3002;</p>
<p><img src="https://images.gitbook.cn/6db497f0-d40f-11e8-80d1-917ffa8847fa" alt="enter image description here"></p>
<p><img src="https://images.gitbook.cn/8580d150-d40f-11e8-80d1-917ffa8847fa" alt="enter image description here"></p>
<blockquote>
<p>&#x3010;&#x848B;&#x6D9B;&#x70B9;&#x8BC4;&#x3011;&#x4ECE; 2018 &#x5E74;&#x7684;&#x6570;&#x636E;&#x4E0A;&#x770B;&#xFF0C;&#x6BCF;&#x5468;&#x5728;&#x5F00;&#x6E90;&#x4E0A;&#x6295;&#x5165; 40 &#x5C0F;&#x65F6;&#x4EE5;&#x4E0A;&#x7684;&#x5168;&#x804C;&#x5F00;&#x53D1;&#x8005;&#x5360;&#x6BD4;&#x4E0B;&#x964D;&#x663E;&#x8457;&#xFF0C;&#x8FD9;&#x8BF4;&#x660E;&#x5F00;&#x6E90;&#x793E;&#x533A;&#x4ECD;&#x672A;&#x5F62;&#x6210;&#x6709;&#x6548;&#x7684;&#x6FC0;&#x52B1;&#x673A;&#x5236;&#xFF0C;&#x4EE5;&#x5438;&#x5F15;&#x5F00;&#x53D1;&#x8005;&#x4EEC;&#x5168;&#x804C;&#x6765;&#x53C2;&#x4E0E;&#x3002;&#x8FD9;&#x5C31;&#x610F;&#x5473;&#x7740;&#xFF0C;&#x50CF; 2014 &#x5E74; OpenSSL &#x9879;&#x76EE;&#x56E0;&#x7F3A;&#x4E4F;&#x7EF4;&#x62A4;&#x800C;&#x51FA;&#x73B0;&#x7684;&#x201C;&#x5FC3;&#x810F;&#x51FA;&#x8840;&#x201D;&#x6F0F;&#x6D1E;&#xFF0C;&#x6781;&#x6709;&#x53EF;&#x80FD;&#x8FD8;&#x4F1A;&#x5728;&#x5176;&#x4ED6;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x4E0A;&#x91CD;&#x6F14;&#x3002;&#x8FD9;&#x4E00;&#x95EE;&#x9898;&#x7684;&#x91CD;&#x8981;&#x6027;&#xFF0C;&#x4E0D;&#x4EC5;&#x9700;&#x8981;&#x5F00;&#x6E90;&#x793E;&#x533A;&#x548C;&#x5F00;&#x53D1;&#x8005;&#x4EEC;&#x5F15;&#x8D77;&#x91CD;&#x89C6;&#xFF0C;&#x56E0;&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#x800C;&#x6781;&#x5927;&#x53D7;&#x76CA;&#x7684;&#x4F01;&#x4E1A;&#x754C;&#x66F4;&#x9700;&#x8981;&#x91CD;&#x89C6;&#x5176;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x7A33;&#x56FA;&#x7A0B;&#x5EA6;&#x3002;&#x9664;&#x4E86;&#x91D1;&#x94B1;&#x4E0A;&#x7684;&#x6FC0;&#x52B1;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x53EF;&#x4EE5;&#x5C1D;&#x8BD5;&#x6FC0;&#x52B1;&#x7684;&#x5176;&#x4ED6;&#x7EF4;&#x5EA6;&#xFF0C;&#x6BD4;&#x5982;&#x5F15;&#x5165;&#x533A;&#x5757;&#x94FE;&#x548C;&#x901A;&#x8BC1;&#x7ECF;&#x6D4E;&#xFF0C;&#x6FC0;&#x52B1;&#x673A;&#x5236;&#x53EF;&#x80FD;&#x662F;&#x73B0;&#x5728;&#x5F00;&#x6E90;&#x4E0A;&#x6700;&#x9700;&#x8981;&#x521B;&#x65B0;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x800C;&#x8FD9;&#x4E00;&#x70B9;&#x9700;&#x8981;&#x5F00;&#x6E90;&#x793E;&#x533A;&#x3001;&#x5F00;&#x53D1;&#x8005;&#x548C;&#x4F01;&#x4E1A;&#x754C;&#x7684;&#x5171;&#x540C;&#x52AA;&#x529B;&#x624D;&#x80FD;&#x505A;&#x5230;&#xFF0C;CSDN &#x6B63;&#x5728;&#x79EF;&#x6781;&#x63A2;&#x7D22;&#x8FD9;&#x4E00;&#x8BFE;&#x9898;&#x3002;</p>
<p>&#x3010;&#x9634;&#x660E;&#x70B9;&#x8BC4;&#x3011;&#x540C;&#x6837;&#x4ECE;&#x6295;&#x5165;&#x5B9E;&#x8DF5;&#x6765;&#x770B;&#xFF0C;&#x9AD8;&#x6BD4;&#x4F8B;&#x5F00;&#x53D1;&#x8005;&#x7684;&#x53C2;&#x4E0E;&#x65F6;&#x95F4;&#x662F;&#x975E;&#x5E38;&#x5C11;&#x7684;&#xFF0C;&#x751A;&#x81F3;&#x6709;&#x8FD1;&#x4E00;&#x534A;&#x7684;&#x5F00;&#x53D1;&#x8005;&#x53EA;&#x4F1A;&#x8D21;&#x732E;&#x6BCF;&#x5468; 1-2 &#x5C0F;&#x65F6;&#x65F6;&#x95F4;&#x3002;&#x5982;&#x679C;&#x6DF1;&#x5165;&#x7406;&#x89E3;&#x7684;&#x8BDD;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x65F6;&#x95F4;&#x66F4;&#x591A;&#x53EF;&#x80FD;&#x53EA;&#x80FD;&#x652F;&#x6301;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x7684;&#x4F7F;&#x7528;&#x3001;&#x8BA8;&#x8BBA;&#xFF0C;&#x7EDD;&#x65E0;&#x6CD5;&#x771F;&#x6B63;&#x4ECE;&#x4EE3;&#x7801;&#x5C42;&#x53C2;&#x4E0E;&#x548C;&#x8D21;&#x732E;&#x3002;&#x56E0;&#x800C;&#xFF0C;&#x5982;&#x4F55;&#x5F15;&#x5BFC;&#x548C;&#x652F;&#x6301;&#x5F00;&#x53D1;&#x8005;&#x4ECE;&#x6280;&#x672F;&#x5C42;&#x9762;&#x53C2;&#x4E0E;&#x5230;&#x5F00;&#x6E90;&#x5E93;&#x4E2D;&#x66F4;&#x4E3A;&#x91CD;&#x8981;&#x3002;</p>
<p>&#x3010;&#x738B;&#x5174;&#x5B87;&#x70B9;&#x8BC4;&#x3011;&#x4ECE; 2015 &#x5E74;&#x5230; 2018 &#x5E74;&#x7684;&#x201C;&#x6BCF;&#x5468; 1 &#x5230; 2 &#x5C0F;&#x65F6;&#x201D;&#x7684;&#x53D8;&#x5316;&#x6765;&#x770B;&#xFF0C;&#x6709;&#x53EF;&#x80FD;&#x662F;&#x7531;&#x4E8E;&#x7ECF;&#x6D4E;&#x5F62;&#x52BF;&#x53D8;&#x5316;&#xFF0C;&#x8F83;&#x6D45;&#x53C2;&#x4E0E;&#x5F00;&#x6E90;&#x7684;&#x5F00;&#x53D1;&#x8005;&#xFF08;&#x5927;&#x591A;&#x662F;&#x5F00;&#x6E90;&#x4E0E;&#x5176;&#x5DE5;&#x4F5C;&#x76F8;&#x5173;&#x5EA6;&#x4E0D;&#x5927;&#xFF09;&#x7531;&#x4E8E;&#x5DE5;&#x4F5C;&#x538B;&#x529B;&#x7684;&#x52A0;&#x5927;&#x800C;&#x51CF;&#x5C11;&#x4E86;&#x5BF9;&#x5F00;&#x6E90;&#x7684;&#x53C2;&#x4E0E;&#xFF0C;&#x4ECE; Linux &#x4E2D;&#x56FD;&#x7684;&#x8D21;&#x732E;&#x8005;&#x4E5F;&#x80FD;&#x770B;&#x51FA;&#x7C7B;&#x4F3C;&#x7684;&#x60C5;&#x5F62;&#xFF0C;&#x5728;&#x6574;&#x4F53;&#x53C2;&#x4E0E;&#x4EBA;&#x6570;&#x589E;&#x52A0;&#x7684;&#x540C;&#x65F6;&#x957F;&#x5C3E;&#x7684;&#x77ED;&#x65F6;&#x8D21;&#x732E;&#x8005;&#x6BD4;&#x4F8B;&#x5728;&#x52A0;&#x5927;&#x3002;</p>
<p>&#x3010;&#x6881;&#x8389;&#x70B9;&#x8BC4;&#x3011;&#x5173;&#x6CE8;&#x5F00;&#x6E90;&#x6280;&#x672F;&#x6216;&#x4F7F;&#x7528;&#x5F00;&#x6E90;&#x4EA7;&#x54C1;&#x548C;&#x53C2;&#x4E0E;&#x5E76;&#x6295;&#x5165;&#x5230;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x7684;&#x5F00;&#x53D1;&#x8FD9;&#x4E4B;&#x95F4;&#x8FD8;&#x662F;&#x9700;&#x8981;&#x4E00;&#x5B9A;&#x7684;&#x65F6;&#x95F4;&#x6765;&#x5B66;&#x4E60;&#x548C;&#x6478;&#x7D22;&#x3002;&#x5728;&#x8FD1;&#x51E0;&#x5E74;&#x7684;&#x5F00;&#x6E90;&#x793E;&#x533A;&#x6D3B;&#x52A8;&#x4E2D;&#x4E0D;&#x4E4F;&#x770B;&#x5230;&#x5E74;&#x8F7B;&#x5F00;&#x53D1;&#x8005;&#x4EEC;&#x7684;&#x8EAB;&#x5F71;&#xFF0C;&#x671F;&#x5F85;&#x770B;&#x5230;&#x66F4;&#x591A;&#x7684;&#x5E74;&#x8F7B;&#x5F00;&#x53D1;&#x8005;&#x6295;&#x5165;&#x5230;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x7684;&#x5F00;&#x53D1;&#x3002;</p>
</blockquote>
<h5 id="42-&#x5F00;&#x6E90;&#x76F8;&#x5173;&#x6D3B;&#x52A8;&#x53C2;&#x4E0E;&#x5EA6;"><strong>4.2 &#x5F00;&#x6E90;&#x76F8;&#x5173;&#x6D3B;&#x52A8;&#x53C2;&#x4E0E;&#x5EA6;</strong></h5>
<p>&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x76EE;&#x524D;&#x5927;&#x5BB6;&#x7684;&#x5BF9;&#x4E8E;&#x5F00;&#x6E90;&#x76F8;&#x5173;&#x6D3B;&#x52A8;&#x7684;&#x53C2;&#x4E0E;&#x5EA6;&#x4E0D;&#x9AD8;&#xFF0C;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x53C2;&#x4E0E;&#x8005;&#x53EA;&#x6709;&#x6BCF;&#x5E74;&#x51E0;&#x6B21;&#x7684;&#x53C2;&#x4E0E;&#x3002;&#x53C2;&#x4E0E;&#x8005;&#x7EBF;&#x4E0A;&#x7EBF;&#x4E0B;&#x7684;&#x53C2;&#x4E0E;&#x60C5;&#x51B5;&#x57FA;&#x672C;&#x4E00;&#x81F4;&#x3002;</p>
<p><img src="https://images.gitbook.cn/b670e4d0-d40f-11e8-80d1-917ffa8847fa" alt="enter image description here"></p>
<blockquote>
<p>&#x3010;&#x9634;&#x660E;&#x70B9;&#x8BC4;&#x3011;&#x8FD9;&#x91CC;&#x9700;&#x8981;&#x533A;&#x5206;&#x5F00;&#x6E90;&#x6D3B;&#x52A8;&#xFF0C;&#x5F00;&#x6E90;&#x6280;&#x672F;&#x76F8;&#x5173;&#x7684;&#x6D3B;&#x52A8;&#x3002;&#x5982;&#x679C;&#x4EE5;&#x5F00;&#x6E90;&#x672C;&#x8EAB;&#x4E3A;&#x4E3B;&#x9898;&#xFF0C;&#x4E0D;&#x4EC5;&#x53C2;&#x4E0E;&#x8005;&#x5F88;&#x5C11;&#xFF0C;&#x751A;&#x81F3;&#x76EE;&#x524D;&#x6765;&#x770B;&#x7684;&#x6D3B;&#x52A8;&#x5185;&#x5BB9;&#x5728;&#x56FD;&#x5185;&#x90FD;&#x5F88;&#x5C11;&#xFF0C;&#x56E0;&#x800C;&#x6709;&#x8FD9;&#x6837;&#x7684;&#x9AD8;&#x6BD4;&#x4F8B;&#x4ECE;&#x4E0D;&#x53C2;&#x52A0;&#x53EF;&#x4EE5;&#x88AB;&#x7406;&#x89E3;&#x3002;&#x76F8;&#x5BF9;&#x7684;&#xFF0C;&#x57FA;&#x4E8E;&#x5F00;&#x6E90;&#x6280;&#x672F;&#x7684;&#x7EBF;&#x4E0B;&#x6D3B;&#x52A8;&#x5728;&#x5317;&#x4E0A;&#x5E7F;&#x6DF1;&#x676D;&#x6280;&#x672F;&#x805A;&#x96C6;&#x57CE;&#x5E02;&#x8FD8;&#x662F;&#x6709;&#x5F88;&#x591A;&#x9009;&#x62E9;&#x7684;&#xFF0C;&#x4E0D;&#x8FC7;&#x4ECE;&#x4E3E;&#x529E;&#x7C7B;&#x522B;&#x4E0A;&#xFF0C;&#x9700;&#x8981;&#x66F4;&#x597D;&#x5730;&#x53D1;&#x52A8;&#x793E;&#x533A;&#x7684;&#x529B;&#x91CF;&#xFF0C;&#x8BA9;&#x793E;&#x533A;&#x4E2D;&#x7684;&#x8D21;&#x732E;&#x8005;&#x6765;&#x52A8;&#x5458;&#x548C;&#x652F;&#x6301;&#x6D3B;&#x52A8;&#x3002;</p>
<p>&#x3010;&#x6881;&#x8389;&#x70B9;&#x8BC4;&#x3011;&#x8FD1;&#x5E74;&#x6765;&#x4E2D;&#x56FD;&#x5F00;&#x53D1;&#x8005;&#x53C2;&#x4E0E;&#x5168;&#x7403;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x7684;&#x6BD4;&#x4F8B;&#x5728;&#x6301;&#x7EED;&#x589E;&#x957F;&#xFF0C;&#x4F46;&#x5728;&#x4E00;&#x4E9B;&#x5168;&#x7403;&#x5F00;&#x6E90;&#x793E;&#x533A;&#x7684;&#x4F1A;&#x8BAE;&#x4E0A;&#xFF0C;&#x4E2D;&#x56FD;&#x5F00;&#x53D1;&#x8005;&#x7684;&#x8EAB;&#x5F71;&#x8FD8;&#x662F;&#x76F8;&#x5BF9;&#x6709;&#x9650;&#x7684;&#x3002;&#x901A;&#x8FC7;&#x5F00;&#x6E90;&#x6D3B;&#x52A8;&#x6765;&#x5B66;&#x4E60;&#x5F00;&#x6E90;&#x6280;&#x672F;&#x5E76;&#x548C;&#x5F00;&#x6E90;&#x793E;&#x533A;&#x7684;&#x4EE3;&#x7801;&#x7EF4;&#x62A4;&#x8005;&#x4EEC;&#x9762;&#x5BF9;&#x9762;&#x4EA4;&#x6D41;&#x90FD;&#x662F;&#x6709;&#x52A9;&#x4E8E;&#x63D0;&#x5347;&#x4E2A;&#x4EBA;&#x5BF9;&#x4E8E;&#x5F00;&#x6E90;&#x7684;&#x7406;&#x89E3;&#x3002;</p>
</blockquote>
<h5 id="43-&#x5F00;&#x6E90;&#x6536;&#x5165;"><strong>4.3 &#x5F00;&#x6E90;&#x6536;&#x5165;</strong></h5>
<p>&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x591A;&#x6570;&#x4EBA;&#x53C2;&#x4E0E;&#x5F00;&#x6E90;&#x5E76;&#x4E0D;&#x8FFD;&#x6C42;&#x7269;&#x8D28;&#x56DE;&#x62A5;&#xFF0C;&#x5373;&#x4F7F;&#x4E03;&#x6210;&#x7684;&#x53C2;&#x4E0E;&#x8005;&#x6CA1;&#x6709;&#x5F00;&#x6E90;&#x6536;&#x5165;&#xFF0C;&#x4F46;&#x8FD8;&#x662F;&#x70ED;&#x8877;&#x4E8E;&#x53C2;&#x4E0E;&#x5F00;&#x6E90;&#x5DE5;&#x4F5C;&#x3002;&#x4E0E;&#x6B64;&#x540C;&#x65F6;&#xFF0C;&#x6301;&#x7EED;&#x6295;&#x5165;&#x5E76;&#x4EE5;&#x5F00;&#x6E90;&#x4E3A;&#x804C;&#x4E1A;&#x9009;&#x62E9;&#x4E5F;&#x80FD;&#x5F97;&#x5230;&#x53EF;&#x89C2;&#x6536;&#x5165;&#xFF0C;&#x4E14;&#x6536;&#x5165;&#x6C34;&#x5E73;&#x8D8A;&#x9AD8;&#x8005;&#xFF0C;&#x4ECE;&#x5F00;&#x6E90;&#x4E2D;&#x83B7;&#x5F97;&#x7684;&#x6536;&#x5165;&#x4E5F;&#x8D8A;&#x591A;&#xFF0C;&#x6708;&#x85AA; 5W &#x4EE5;&#x4E0A;&#x8005;&#xFF0C;&#x4E0D;&#x4ECE;&#x5F00;&#x6E90;&#x4E2D;&#x83B7;&#x5F97;&#x6536;&#x5165;&#x7684;&#x6BD4;&#x4F8B;&#x4E0D;&#x8DB3;&#x4E00;&#x534A;&#x3002;</p>
<p><img src="https://images.gitbook.cn/d2db3760-d40f-11e8-80d1-917ffa8847fa" alt="enter image description here">
<img src="https://images.gitbook.cn/e477e220-d40f-11e8-80d1-917ffa8847fa" alt="enter image description here"></p>
<blockquote>
<p>&#x3010;&#x8C22;&#x5DE5;&#x70B9;&#x8BC4;&#x3011;&#x76F4;&#x63A5;&#x4ECE;&#x5F00;&#x6E90;&#x4E2D;&#x83B7;&#x5F97;&#x7684;&#x6350;&#x8D60;&#x8FD8;&#x662F;&#x6709;&#x9650;&#x7684;&#xFF0C;&#x76EE;&#x524D;&#x6536;&#x5165;&#x4E3B;&#x8981;&#x8FD8;&#x662F;&#x901A;&#x8FC7;&#x76F8;&#x5E94;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x884D;&#x751F;&#x51FA;&#x6765;&#x7684;&#x5DE5;&#x4F5C;&#x3001;&#x5B9A;&#x5236;&#x5316;&#x53CA;&#x884D;&#x751F;&#x4E1A;&#x52A1;&#x83B7;&#x5F97;&#x6536;&#x5165;&#xFF0C;&#x540C;&#x65F6;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x4F1A;&#x63D0;&#x5347;&#x4F5C;&#x8005;&#x7684;&#x77E5;&#x540D;&#x5EA6;&#x548C;&#x76F8;&#x5E94;&#x9886;&#x57DF;&#x5185;&#x7684;&#x5730;&#x4F4D;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x5438;&#x5F15;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7684;&#x5F00;&#x53D1;&#x8005;&#x4ECE;&#x4E8B;&#x5F00;&#x6E90;&#x5DE5;&#x4F5C;&#x7684;&#x4E00;&#x4E2A;&#x539F;&#x56E0;&#x3002;</p>
<p>&#x3010;&#x6881;&#x8389;&#x70B9;&#x8BC4;&#x3011;&#x975E;&#x5E38;&#x540C;&#x610F; GitChat &#x8C22;&#x5DE5;&#x7684;&#x70B9;&#x8BC4; &#x3002;&#x6709;&#x65F6;&#x5019;&#x5728;&#x7B80;&#x5386;&#x4E0A;&#x6DFB;&#x52A0;&#x4E0A;&#x5728;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x4E2D;&#x8D21;&#x732E;&#x7684;&#x6838;&#x5FC3;&#x4EE3;&#x7801;&#x7684;&#x94FE;&#x63A5;&#x8FDC;&#x80DC;&#x4E8E;&#x5927;&#x6BB5;&#x7684;&#x63CF;&#x8FF0;&#x3002;</p>
<p>&#x3010;&#x9634;&#x660E;&#x70B9;&#x8BC4;&#x3011;&#x8FD9;&#x91CC;&#x4E00;&#x5B9A;&#x8981;&#x533A;&#x5206;&#xFF0C;&#x6536;&#x5165;&#x7684;&#x76EE;&#x7684;&#x3002;&#x5F00;&#x6E90;&#x672C;&#x8EAB;&#x4E0D;&#x662F;&#x4EE5;&#x6536;&#x5165;&#x4E3A;&#x76EE;&#x7684;&#x7684;&#xFF0C;&#x6709;&#x6536;&#x5165;&#x53EA;&#x662F;&#x8BA9;&#x5F00;&#x6E90;&#x5DE5;&#x4F5C;&#x66F4;&#x597D;&#x7684;&#x5C55;&#x5F00;&#x3002;&#x800C;&#x5F00;&#x6E90;&#x7684;&#x53C2;&#x4E0E;&#x548C;&#x8D21;&#x732E;&#x6240;&#x5E26;&#x6765;&#x7684;&#x4EF7;&#x503C;&#x5E94;&#x8BE5;&#x9AD8;&#x4E8E;&#x6536;&#x5165;&#xFF0C;&#x4E5F;&#x6B63;&#x662F;&#x8FD9;&#x4E9B;&#x4EF7;&#x503C;&#x548C;&#x610F;&#x4E49;&#x8BA9;&#x66F4;&#x591A;&#x5F00;&#x53D1;&#x8005;&#x6295;&#x5165;&#x5176;&#x4E2D;&#x3002;</p>
<p>&#x53E6;&#x5916;&#xFF0C;&#x7537;&#x5973;&#x6027;&#x522B;&#x5206;&#x5E03;&#x5728;&#x5404;&#x4E2A;&#x6536;&#x5165;&#x9636;&#x6BB5;&#x76F8;&#x5BF9;&#x6765;&#x8BF4;&#x6BD4;&#x8F83;&#x5E73;&#x5747;&#xFF0C; &#x81EA;&#x6211;&#x8BC4;&#x6D4B;&#x901A;&#x8FC7;&#x5F00;&#x6E90;&#x83B7;&#x5F97;&#x6536;&#x5165;&#x5F88;&#x591A;&#x7684;&#x90A3;&#x4E2A;&#x533A;&#x95F4;&#xFF0C; &#x5973;&#x6027;&#x6BD4;&#x4F8B;&#x76F8;&#x5BF9;&#x6765;&#x8BF4;&#x6700;&#x9AD8;&#xFF0C;&#x8BF4;&#x660E;&#x6709;&#x5F88;&#x591A;&#x5973;&#x6027;&#x5168;&#x804C;&#x4ECE;&#x4E8B;&#x4E8E;&#x5F00;&#x6E90;&#x76F8;&#x5173;&#x7684;&#x5DE5;&#x4F5C;&#x3002;</p>
</blockquote>
<p><img src="https://images.gitbook.cn/062c4550-d410-11e8-80d1-917ffa8847fa" alt="enter image description here"></p>
<h5 id="44-&#x7B2C;&#x4E00;&#x6B21;&#x63A5;&#x89E6;&#x7684;&#x5F00;&#x6E90;&#x4EA7;&#x54C1;"><strong>4.4 &#x7B2C;&#x4E00;&#x6B21;&#x63A5;&#x89E6;&#x7684;&#x5F00;&#x6E90;&#x4EA7;&#x54C1;</strong></h5>
<p>&#x6709;&#x8D85;&#x8FC7; 37% &#x7684;&#x53C2;&#x4E0E;&#x8005;&#x7B2C;&#x4E00;&#x6B21;&#x7684;&#x63A5;&#x89E6;&#x7684;&#x5F00;&#x6E90;&#x4EA7;&#x54C1;&#x4E3A;&#x4E92;&#x8054;&#x7F51;&#x4EA7;&#x54C1;&#xFF0C;&#x7D27;&#x968F;&#x5176;&#x540E;&#x7684;&#x4FBF;&#x662F;&#x5F00;&#x53D1;&#x5DE5;&#x5177;&#x4E0E;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x76F8;&#x5173;&#x7684;&#x4EA7;&#x54C1;&#x3002;2015 &#x5E74;&#x7684;&#x8C03;&#x67E5;&#x7ED3;&#x679C;&#x6392;&#x540D;&#x7B2C;&#x4E00;&#x7684;&#x4E3A;&#x5F00;&#x6E90;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x3002;&#x8BF4;&#x660E;&#x4E92;&#x8054;&#x7F51;&#x4EA7;&#x54C1;&#x5728;&#x8FD1;&#x4E09;&#x5E74;&#x7684;&#x84EC;&#x52C3;&#x53D1;&#x5C55;&#x4EE5;&#x53CA;&#x4E92;&#x8054;&#x7F51;&#x548C;&#x5F00;&#x6E90;&#x7684;&#x5BC6;&#x4E0D;&#x53EF;&#x5206;&#x3002;</p>
<p><img src="https://images.gitbook.cn/203946f0-d410-11e8-80d1-917ffa8847fa" alt="enter image description here"></p>
<h5 id="45-&#x6700;&#x5E0C;&#x671B;&#x5F00;&#x6E90;&#x7684;&#x4EA7;&#x54C1;"><strong>4.5 &#x6700;&#x5E0C;&#x671B;&#x5F00;&#x6E90;&#x7684;&#x4EA7;&#x54C1;</strong></h5>
<p>&#x5F00;&#x53D1;&#x5DE5;&#x5177;&#x548C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4F5C;&#x4E3A;&#x76F8;&#x5BF9;&#x590D;&#x6742;&#x800C;&#x5168;&#x9762;&#x7684;&#x6280;&#x672F;&#x4EA7;&#x54C1;&#xFF0C;&#x6210;&#x4E3A;&#x5927;&#x5BB6;&#x6700;&#x5E0C;&#x671B;&#x5F00;&#x6E90;&#x7684;&#x4EA7;&#x54C1;&#x3002;</p>
<p><img src="https://images.gitbook.cn/3aef59d0-d410-11e8-80d1-917ffa8847fa" alt="enter image description here"></p>
<blockquote>
<p>&#x3010;&#x738B;&#x542F;&#x6CF0;&#x70B9;&#x8BC4;&#x3011;&#x8FD9;&#x4E2A;&#x8C03;&#x67E5;&#x7ED3;&#x679C;&#x53CD;&#x6620;&#x51FA;&#x56FD;&#x5185;&#x66F4;&#x504F;&#x5411;&#x4E8E;&#x5F00;&#x53D1;&#x5DE5;&#x5177;&#x7B49;&#x4EA7;&#x54C1;&#x7C7B;&#x7684;&#x65B9;&#x5411;&#xFF0C;&#x76F8;&#x5BF9;&#x4E8E;&#x56FD;&#x5916;&#x7684;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x7684;&#x9009;&#x62E9;&#xFF0C;&#x53EF;&#x80FD;&#x66F4;&#x5168;&#x9762;&#x548C;&#x5E7F;&#x6CDB;&#xFF0C;&#x4F8B;&#x5982;&#x67B6;&#x6784;&#x7684;&#x642D;&#x5EFA;&#xFF0C;&#x6280;&#x672F;&#x751F;&#x6001;&#x5708;&#x7684;&#x5EFA;&#x7ACB;&#x3002;</p>
<p>&#x3010;&#x738B;&#x5174;&#x5B87;&#x70B9;&#x8BC4;&#x3011;&#x8FD9;&#x5E94;&#x8BE5;&#x53CD;&#x6620;&#x7684;&#x662F;&#x5927;&#x5BB6;&#x5FC3;&#x7406;&#x7684;&#x9884;&#x671F;&#xFF0C;&#x5E0C;&#x671B;&#x5176;&#x5F00;&#x6E90;&#x7684;&#x76EE;&#x7684;&#x5927;&#x6982;&#x6709;&#x4E8C;&#xFF1A;&#x5F00;&#x6E90;&#x4EE5;&#x5728;&#x5176;&#x57FA;&#x7840;&#x4E0A;&#x521B;&#x9020;&#x66F4;&#x591A;&#x884D;&#x751F;&#x6216;&#x76F8;&#x5173;&#x4EA7;&#x54C1;&#xFF1B;&#x5F00;&#x6E90;&#x4EE5;&#x786E;&#x4FDD;&#x5176;&#x751F;&#x6001;&#x5065;&#x5EB7;&#x53D1;&#x5C55;&#x3002;</p>
</blockquote>
<h4 id="&#x4E94;&#x3001;&#x5F00;&#x6E90;&#x793E;&#x533A;&#x53C2;&#x4E0E;&#x73B0;&#x72B6;">&#x4E94;&#x3001;&#x5F00;&#x6E90;&#x793E;&#x533A;&#x53C2;&#x4E0E;&#x73B0;&#x72B6;</h4>
<h5 id="51-&#x5F00;&#x6E90;&#x6700;&#x5438;&#x5F15;&#x4F60;&#x7684;&#x56E0;&#x7D20;"><strong>5.1 &#x5F00;&#x6E90;&#x6700;&#x5438;&#x5F15;&#x4F60;&#x7684;&#x56E0;&#x7D20;</strong></h5>
<p>&#x5F00;&#x653E;&#x900F;&#x660E;&#x7684;&#x4EE3;&#x7801;&#x548C;&#x77E5;&#x8BC6;&#x5171;&#x4EAB;&#xFF0C;&#x4EE5;&#x53CA;&#x5F00;&#x6E90;&#x7684;&#x7CBE;&#x795E;&#x7406;&#x5FF5;&#x6210;&#x4E3A;&#x5F00;&#x6E90;&#x6700;&#x5438;&#x5F15;&#x53C2;&#x4E0E;&#x8005;&#x7684;&#x56E0;&#x7D20;&#xFF0C;&#x800C;&#x8F6F;&#x4EF6;&#x7684;&#x8D2D;&#x4E70;&#x6210;&#x672C;&#x5374;&#x5E76;&#x4E0D;&#x662F;&#x4E3B;&#x8981;&#x7684;&#x56E0;&#x7D20;&#x3002;</p>
<p><img src="https://images.gitbook.cn/56878f50-d410-11e8-80d1-917ffa8847fa" alt="enter image description here"></p>
<blockquote>
<p>&#x3010;&#x738B;&#x542F;&#x6CF0;&#x70B9;&#x8BC4;&#x3011;&#x53C2;&#x4E0E;&#x8C03;&#x67E5;&#x7684;&#x4EBA;&#x5458;&#x5E94;&#x8BE5;&#x4EE5;&#x53C2;&#x4E0E;&#x8005;&#x5C45;&#x591A;&#xFF0C;&#x6240;&#x4EE5;&#x6BD4;&#x8F83;&#x4E0D;&#x91CD;&#x89C6;&#x8F6F;&#x4EF6;&#x7684;&#x8D2D;&#x4E70;&#x7684;&#x56E0;&#x7D20;&#x3002;&#x5BF9;&#x4E8E;&#x516C;&#x53F8;&#x7684;&#x8425;&#x8FD0;&#x548C;&#x51FA;&#x8D44;&#x65B9;&#xFF0C;&#x80FD;&#x591F;&#x4ECE;&#x5F00;&#x6E90;&#x793E;&#x533A;&#x83B7;&#x53D6;&#x54C1;&#x8D28;&#x9AD8;&#x800C;&#x4E14;&#x6210;&#x672C;&#x5148;&#x5BF9;&#x4F4E;&#x7684;&#x56E0;&#x7D20;&#x8FD8;&#x662F;&#x6709;&#x5438;&#x5F15;&#x529B;&#x7684;&#x3002;</p>
<p>&#x3010;&#x9634;&#x660E;&#x70B9;&#x8BC4;&#x3011;&#x6B63;&#x5982;&#x7ECF;&#x5178;&#x7684;&#x4E66;&#x7C4D; The Cathedral and the Bazaar &#x4E2D;&#x5199;&#x7684;&#xFF0C;&#x5F00;&#x6E90;&#x6216;&#x8005;&#x8BF4;&#x5927;&#x5BB6;&#x901A;&#x8FC7;&#x6C9F;&#x901A;&#x548C;&#x96C6;&#x4F53;&#x51B3;&#x7B56;&#x6765;&#x53D1;&#x5C55;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x672C;&#x8EAB;&#x662F;&#x4E00;&#x79CD;&#x5408;&#x4F5C;&#x65B9;&#x5F0F;&#x7684;&#x9009;&#x62E9;&#x3002;&#x800C;&#x8FD9;&#x79CD;&#x5408;&#x4F5C;&#x65B9;&#x5F0F;&#x5982;&#x679C;&#x9700;&#x8981;&#x6709;&#x597D;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x6700;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x4E2A;&#x5E95;&#x5C42;&#x4EF7;&#x503C;&#x89C2;&#x5C31;&#x662F;&#x5206;&#x4EAB;&#xFF0C;&#x8FD9;&#x90E8;&#x5206;&#x7684;&#x7CBE;&#x795E;&#x548C;&#x7406;&#x5FF5;&#x662F;&#x5F00;&#x6E90;&#x4E16;&#x754C;&#x6784;&#x5EFA;&#x7684;&#x57FA;&#x7840;&#x3002;</p>
</blockquote>
<h5 id="52-&#x6700;&#x559C;&#x6B22;&#x7684;&#x5F00;&#x6E90;&#x4EA7;&#x54C1;&#x662F;&#x4EC0;&#x4E48;"><strong>5.2 &#x6700;&#x559C;&#x6B22;&#x7684;&#x5F00;&#x6E90;&#x4EA7;&#x54C1;&#x662F;&#x4EC0;&#x4E48;</strong></h5>
<p>Linux &#x4EE5;&#x5DE8;&#x5927;&#x4F18;&#x52BF;&#xFF0C;&#x6210;&#x4E3A;&#x53C2;&#x4E0E;&#x8005;&#x6700;&#x559C;&#x7231;&#x7684;&#x5F00;&#x6E90;&#x4EA7;&#x54C1;&#xFF0C;&#x7D27;&#x968F;&#x5176;&#x540E;&#x7684;&#x662F; Chrome &#x4E0E; MySQL&#x3002;</p>
<p><img src="https://images.gitbook.cn/8772c0d0-d410-11e8-80d1-917ffa8847fa" alt="enter image description here"></p>
<blockquote>
<p>&#x3010;&#x738B;&#x542F;&#x6CF0;&#x70B9;&#x8BC4;&#x3011;Linux &#x4F5C;&#x4E3A;&#x65E9;&#x671F;&#x5F00;&#x6E90;&#x7684;&#x9879;&#x76EE;&#x548C;&#x6307;&#x6807;&#x6027;&#x7684;&#x610F;&#x4E49;&#xFF0C;&#x81EA;&#x7136;&#x6709;&#x4F17;&#x591A;&#x7684;&#x53C2;&#x4E0E;&#x4EBA;&#x5458;&#x3002;Chrome &#x53D6;&#x4EE3; Firefox &#x6210;&#x4E3A;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x8D21;&#x732E;&#x5F00;&#x6E90;&#x7684;&#x9009;&#x62E9;&#x3002;&#x5BB9;&#x5668;&#x6280;&#x672F;&#x5728; Docker &#x5177;&#x6709;&#x5DE8;&#x5927;&#x7684;&#x52A8;&#x80FD;&#xFF0C;&#x5360;&#x5230;&#x6BD4;&#x8F83;&#x9AD8;&#x7684;&#x6392;&#x540D;&#x662F;&#x663E;&#x793A;&#x5BF9;&#x4E8E;&#x8F6F;&#x4EF6;&#x5305;&#x88C5;&#x90E8;&#x7F72;&#x7684;&#x91CD;&#x89C6;&#x3002;</p>
<p>&#x3010;&#x738B;&#x5174;&#x5B87;&#x70B9;&#x8BC4;&#x3011;Linux &#x4F5C;&#x4E3A;&#x5B9E;&#x8D28;&#x6027;&#x5F00;&#x521B;&#x4E86;&#x5F00;&#x6E90;&#x65F6;&#x4EE3;&#x7684;&#x8F6F;&#x4EF6;&#xFF0C;&#x8D62;&#x5F97;&#x4E86;&#x5927;&#x4F17;&#x7684;&#x4E00;&#x81F4;&#x559C;&#x7231;&#x6BEB;&#x65E0;&#x610F;&#x5916;&#x3002;</p>
</blockquote>
<h5 id="53-&#x5177;&#x4F53;&#x53C2;&#x4E0E;&#x7684;&#x793E;&#x533A;&#x5DE5;&#x4F5C;"><strong>5.3 &#x5177;&#x4F53;&#x53C2;&#x4E0E;&#x7684;&#x793E;&#x533A;&#x5DE5;&#x4F5C;</strong></h5>
<p>&#x6709; 65% &#x7684;&#x53C2;&#x4E0E;&#x8005;&#x5728;&#x793E;&#x533A;&#x5747;&#x53C2;&#x4E0E;&#x4EE3;&#x7801;&#x8D21;&#x732E;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x800C;&#x6587;&#x6863;&#x4E0E;&#x6D4B;&#x8BD5;&#x5DE5;&#x4F5C;&#x4E5F;&#x5360;&#x6709;&#x5F88;&#x5927;&#x7684;&#x6BD4;&#x4F8B;&#x3002;</p>
<p><img src="https://images.gitbook.cn/baf258d0-d410-11e8-80d1-917ffa8847fa" alt="enter image description here"></p>
<blockquote>
<p>&#x3010;&#x8C22;&#x5DE5;&#x70B9;&#x8BC4;&#x3011;&#x4E00;&#x4E2A;&#x6D3B;&#x8DC3;&#x7684;&#x3001;&#x5B8C;&#x5584;&#x7684;&#x5F00;&#x6E90;&#x793E;&#x533A;&#xFF0C;&#x6709;&#x52A9;&#x4E8E;&#x5438;&#x7EB3;&#x66F4;&#x591A;&#x7684;&#x5F00;&#x53D1;&#x8005;&#xFF0C;&#x4F7F;&#x4E4B;&#x8F6C;&#x5316;&#x4E3A;&#x5F00;&#x6E90;&#x5F00;&#x53D1;&#x8005;&#xFF0C;&#x76EE;&#x524D;&#x5F00;&#x6E90;&#x793E;&#x533A;&#x7684;&#x53D1;&#x5C55;&#x5DF2;&#x7ECF;&#x53D6;&#x5F97;&#x4E86;&#x957F;&#x8DB3;&#x7684;&#x8FDB;&#x6B65;&#xFF0C;&#x793E;&#x533A;&#x5E94;&#x8BE5;&#x6709;&#x66F4;&#x52A0;&#x5F3A;&#x6709;&#x529B;&#x7684;&#x6FC0;&#x52B1;&#x673A;&#x5236;&#xFF0C;&#x6765;&#x5438;&#x5F15;&#x5E74;&#x8F7B;&#x4E00;&#x4EE3;&#x7684;&#x65B0;&#x4EBA;&#x4E3A;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x8D21;&#x732E;&#x4EE3;&#x7801;&#x3002;</p>
</blockquote>
<h5 id="54-&#x6700;&#x770B;&#x597D;&#x7684;&#x5F00;&#x6E90;&#x4EA7;&#x54C1;"><strong>5.4 &#x6700;&#x770B;&#x597D;&#x7684;&#x5F00;&#x6E90;&#x4EA7;&#x54C1;</strong></h5>
<p>&#x5F00;&#x6E90;&#x4EA7;&#x54C1;&#x7684;&#x524D;&#x666F;&#x5C55;&#x671B;&#x4E2D;&#xFF0C;&#x4E92;&#x8054;&#x7F51;&#x4EA7;&#x54C1;&#x4EE5;&#x8FD1; 40% &#x7684;&#x6BD4;&#x4F8B;&#x6210;&#x4E3A;&#x53C2;&#x4E0E;&#x8005;&#x6700;&#x770B;&#x597D;&#x7684;&#x5F00;&#x6E90;&#x4EA7;&#x54C1;&#x53D1;&#x5C55;&#x65B9;&#x5411;&#x3002;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x5F02;&#x519B;&#x7A81;&#x8D77;&#xFF0C; &#x6210;&#x4E3A;&#x73B0;&#x5728;&#x5F00;&#x6E90;&#x4EA7;&#x54C1;&#x4E2D;&#x7684;&#x98CE;&#x53E3;&#x548C;&#x70ED;&#x70B9;&#x3002;</p>
<p><img src="https://images.gitbook.cn/d3d81880-d410-11e8-80d1-917ffa8847fa" alt="enter image description here"></p>
<blockquote>
<p>&#x3010;&#x738B;&#x542F;&#x6CF0;&#x70B9;&#x8BC4;&#x3011;&#x4ECE; 2016 &#x540E;&#x534A;&#x5E74;&#x5F00;&#x59CB;&#xFF0C;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x518D;&#x5EA6;&#x8FDB;&#x5165;&#x4E16;&#x4EBA;&#x7684;&#x5173;&#x6CE8;&#x8303;&#x56F4;&#x3002;&#x5404;&#x79CD;&#x6307;&#x6807;&#x90FD;&#x663E;&#x793A;&#x91CD;&#x89C6;&#x7684;&#x7A0B;&#x5EA6;&#xFF0C;&#x7531;&#x53C2;&#x4E0E;&#x7684;&#x4EBA;&#x6570;&#xFF0C;&#x5E94;&#x7528;&#x7684;&#x8303;&#x56F4;&#xFF0C;&#x8D44;&#x6E90;&#x7684;&#x6295;&#x5165;&#x90FD;&#x8BC1;&#x5B9E;&#x8FD9;&#x4E2A;&#x8D8B;&#x52BF;&#x3002;</p>
</blockquote>
<h5 id="55-&#x5F00;&#x6E90;&#x793E;&#x533A;&#x7684;&#x4EA4;&#x6D41;&#x65B9;&#x5F0F;"><strong>5.5 &#x5F00;&#x6E90;&#x793E;&#x533A;&#x7684;&#x4EA4;&#x6D41;&#x65B9;&#x5F0F;</strong></h5>
<p>&#x5728;&#x793E;&#x533A;&#x7684;&#x4EA4;&#x6D41;&#x65B9;&#x5F0F;&#x4E2D;&#xFF0C;&#x5FAE;&#x4FE1;&#x5DF2;&#x7ECF;&#x53D6;&#x4EE3;&#x4E86;&#x4F20;&#x7EDF;&#x7684;&#x90AE;&#x4EF6;&#x5217;&#x8868;&#x6210;&#x4E3A;&#x4E86;&#x5F00;&#x6E90;&#x793E;&#x533A;&#x4EA4;&#x6D41;&#x7684;&#x4E3B;&#x8981;&#x5DE5;&#x5177;&#xFF0C;&#x5FAE;&#x4FE1;&#x6C9F;&#x901A;&#x7684;&#x6BD4;&#x4F8B;&#x4ECE; 2015 &#x5E74;&#x7684; 28.1% &#x4E0A;&#x5347;&#x5230; 48.78%&#xFF0C;&#x5FAE;&#x535A;&#x4F7F;&#x7528;&#x6BD4;&#x4F8B;&#x6709;&#x660E;&#x663E;&#x7684;&#x4E0B;&#x964D;&#x3002;&#x65B0;&#x9510;&#x7684;&#x4EA4;&#x6D41;&#x5DE5;&#x5177;&#x6BD4;&#x4F8B;&#x4E0A;&#x5347;&#xFF1A;Telegram &#x548C; Zoom &#x4E5F;&#x662F;&#x503C;&#x5F97;&#x5173;&#x6CE8;&#x7684;&#x73B0;&#x8C61;&#x3002;</p>
<p><img src="https://images.gitbook.cn/f50e7210-d410-11e8-80d1-917ffa8847fa" alt="enter image description here"></p>
<blockquote>
<p> &#x3010;&#x8C22;&#x5DE5;&#x70B9;&#x8BC4;&#x3011;&#x5FAE;&#x4FE1;&#x751F;&#x6001;&#x5708;&#x4EA7;&#x54C1;&#x548C; QQ &#x5728;&#x5373;&#x65F6;&#x548C;&#x65F6;&#x6548;&#x4E0A;&#x6709;&#x4F18;&#x52BF;&#xFF0C;&#x4F46;&#x662F;&#x6C9F;&#x901A;&#x5185;&#x5BB9;&#x8FDB;&#x884C;&#x7559;&#x5B58;&#x548C;&#x5B66;&#x4E60;&#x6C89;&#x6DC0;&#x65F6;&#xFF0C;&#x4F53;&#x9A8C;&#x4E0D;&#x597D;&#xFF0C;&#x7F16;&#x8F91;&#x96BE;&#x5EA6;&#x8F83;&#x5927;&#xFF0C;&#x800C;&#x4E14;&#x5728;&#x56FD;&#x9645;&#x5316;&#x65B9;&#x9762;&#x7684;&#x4F53;&#x9A8C;&#x4E5F;&#x4E0D;&#x592A;&#x597D;&#x3002;</p>
<p>Telegram &#x7684;&#x4F18;&#x52BF;&#x5728;&#x4E8E;&#x901A;&#x4FE1;&#x7684;&#x5B89;&#x5168;&#x6027;&#xFF0C;&#x7AEF;&#x5BF9;&#x7AEF;&#x901A;&#x4FE1;&#x65F6;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x4E0D;&#x4F1A;&#x5B58;&#x50A8;&#x804A;&#x5929;&#x5185;&#x5BB9;</p>
<p>&#x3010;&#x9634;&#x660E;&#x70B9;&#x8BC4;&#x3011;Gitter &#x4EE5;&#x67D0;&#x4E00;&#x4E2A;&#x5F00;&#x6E90;&#x5E93;&#x4E3A;&#x57FA;&#x7840;&#x7684;&#x7C7B;&#x4F3C;&#x4E8E; Slack &#x7684;&#x5DE5;&#x5177;&#x8FD8;&#x662F;&#x5F88;&#x597D;&#x7528;&#x7684;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x7ED1;&#x5B9A;&#x4E86;&#x76F8;&#x5173; Issue &#x7B49;&#x8BA8;&#x8BBA;&#x529F;&#x80FD;&#xFF0C;&#x76EE;&#x524D;&#x56FD;&#x5185;&#x8FD8;&#x6CA1;&#x6709;&#x5F88;&#x597D;&#x7684;&#x5DE5;&#x5177;&#x3002;</p>
</blockquote>
<h5 id="56-&#x53C2;&#x4E0E;&#x8005;&#x8BA4;&#x4E3A;&#x5F00;&#x6E90;&#x8D21;&#x732E;&#x6700;&#x5927;&#x7684;&#x516C;&#x53F8;"><strong>5.6 &#x53C2;&#x4E0E;&#x8005;&#x8BA4;&#x4E3A;&#x5F00;&#x6E90;&#x8D21;&#x732E;&#x6700;&#x5927;&#x7684;&#x516C;&#x53F8;</strong></h5>
<p>&#x5728;&#x4F17;&#x591A;&#x6280;&#x672F;&#x516C;&#x53F8;&#x4E2D;&#xFF0C;Google &#x548C; Github &#x88AB;&#x4F17;&#x591A;&#x53C2;&#x4E0E;&#x8005;&#x8BA4;&#x4E3A;&#x662F;&#x5728;&#x5F00;&#x6E90;&#x65B9;&#x9762;&#x8D21;&#x732E;&#x6700;&#x5927;&#x7684;&#x4E24;&#x5BB6;&#x516C;&#x53F8;&#xFF0C;&#x4E2D;&#x56FD;&#x7684; BAT &#x548C;&#x534E;&#x4E3A;&#x4ECA;&#x5E74;&#x6765;&#x5728;&#x4E2D;&#x56FD;&#x5F00;&#x6E90;&#x5F00;&#x53D1;&#x8005;&#x5FC3;&#x4E2D;&#x53C2;&#x4E0E;&#x5F00;&#x6E90;&#x7684;&#x5F62;&#x8C61;&#x6B63;&#x5728;&#x660E;&#x663E;&#x589E;&#x5F3A;&#x3002;</p>
<p><img src="https://images.gitbook.cn/18fb3910-d411-11e8-80d1-917ffa8847fa" alt="enter image description here"></p>
<blockquote>
<p>&#x3010;&#x738B;&#x542F;&#x6CF0;&#x70B9;&#x8BC4;&#x3011; GitHub &#x7684;&#x6392;&#x540D;&#x548C; repo &#x6570;&#x3001;&#x8D21;&#x732E;&#x8005;&#x6570;&#x3001;&#x83B7;&#x5F97;&#x661F;&#x6570;&#x7B49;&#x65B9;&#x5411;&#xFF0C;&#x548C;&#x8C03;&#x67E5;&#x7ED3;&#x679C;&#x6709;&#x76F8;&#x5F53;&#x9AD8;&#x7684;&#x543B;&#x5408;&#x3002;Google &#x4EE5;&#x521B;&#x65B0;&#x7684;&#x5F62;&#x8C61;&#x6DF1;&#x690D;&#x5728;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x7684;&#x5FC3;&#x4E2D;&#xFF0C;&#x5BF9;&#x5F00;&#x6E90;&#x7684;&#x8D21;&#x732E;&#x4F8B;&#x5982;&#x5728;&#x5927;&#x6570;&#x636E;&#xFF08;Hadoop&#x3001;HDFS&#x7B49;&#xFF09;&#x3001;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#xFF08;&#x5982;TensorFlow&#xFF09;&#x90FD;&#x662F;&#x6709;&#x76EE;&#x5171;&#x7779;&#x3002;GitHub &#x4F5C;&#x4E3A;&#xFF08;&#x514D;&#x8D39;&#x6216;&#x662F;&#x4ED8;&#x8D39;&#xFF09;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x7684;&#x50A8;&#x5B58;&#x5E93;&#x7684;&#x8FD0;&#x7EF4;&#x548C;&#x8D21;&#x732E;&#xFF0C;&#x5DE8;&#x5927;&#xFF0C;&#x867D;&#x7136;&#x672C;&#x8EAB;&#x6CA1;&#x6709;&#x7279;&#x522B;&#x53C2;&#x4E0E;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x7684;&#x5F00;&#x53D1;&#xFF0C;&#x4ECD;&#x7136;&#x53D7;&#x5230;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x7684;&#x8BA4;&#x53EF;&#x3002;Microsoft &#x4F5C;&#x4E3A;&#x5F00;&#x6E90;&#x7684;&#x540E;&#x8D77;&#x4E4B;&#x79C0;&#xFF0C;&#x6295;&#x5165;&#x7684;&#x8D44;&#x6E90;&#x548C;&#x8FD1;&#x671F;&#x7684;&#x58F0;&#x52BF;&#x90FD;&#x5F00;&#x59CB;&#x53D7;&#x5230;&#x8BA4;&#x53EF;&#x3002;&#x5728; 2018 &#x5E74;&#x6536;&#x8D2D; GitHub &#x4E5F;&#x4E3A;&#x5176;&#x6295;&#x5165;&#x4E0E;&#x652F;&#x6301;&#x5F00;&#x6E90;&#x7684;&#x51B3;&#x5FC3;&#x66F4;&#x4E3A;&#x51F8;&#x663E;&#x3002;BAT &#x4E0E;&#x534E;&#x4E3A;&#x65E0;&#x8BBA;&#x5728;&#x8D44;&#x6E90;&#x7684;&#x6295;&#x5165;&#x6BD4;&#x4F8B;&#x548C;&#x5F00;&#x6E90;&#x7684;&#x63A8;&#x52A8;&#x529B;&#x5EA6;&#x5728;&#x8FD1;&#x5E74;&#x6709;&#x660E;&#x663E;&#x7684;&#x589E;&#x52A0;&#xFF0C;&#x6240;&#x4EE5;&#x5728; GitHub &#x6392;&#x540D;&#x6709;&#x4E0A;&#x5347;&#x7684;&#x8D8B;&#x52BF;&#x3002;</p>
</blockquote>
<h5 id="57-&#x793E;&#x533A;&#x4E0E;&#x4EE3;&#x7801;&#x7684;&#x5173;&#x7CFB;"><strong>5.7 &#x793E;&#x533A;&#x4E0E;&#x4EE3;&#x7801;&#x7684;&#x5173;&#x7CFB;</strong></h5>
<p>&#x6709;&#x8D85;&#x8FC7;&#x516B;&#x6210;&#x7684;&#x53C2;&#x4E0E;&#x8005;&#x8BA4;&#x4E3A;&#x5728;&#x5F00;&#x6E90;&#x793E;&#x533A;&#x4E2D;&#xFF0C;&#x793E;&#x533A;&#x7684;&#x4EF7;&#x503C;&#x5927;&#x4E8E;&#x6216;&#x7B49;&#x540C;&#x4E8E;&#x4EE3;&#x7801;&#xFF0C;&#x56E0;&#x4E3A;&#x56F4;&#x7ED5;&#x4EE3;&#x7801;&#x800C;&#x751F;&#x7684;&#x793E;&#x533A;&#xFF0C; &#x4F1A;&#x8BA9;&#x4EE3;&#x7801;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x4F18;&#x79C0;&#x3002;</p>
<p><img src="https://images.gitbook.cn/3a4da620-d411-11e8-80d1-917ffa8847fa" alt="enter image description here"></p>
<blockquote>
<p>&#x3010;&#x8C22;&#x5DE5;&#x70B9;&#x8BC4;&#x3011;Issue &#x63D0;&#x51FA;&#x95EE;&#x9898;&#x548C; Idea &#x8BBE;&#x8BA1;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x540C;&#x7B49;&#x91CD;&#x8981;&#xFF0C;&#x793E;&#x533A;&#x662F; Issue &#x63D0;&#x51FA;&#x95EE;&#x9898;&#x7684;&#x805A;&#x96C6;&#x5730;&#x3002;&#x5728; CSDN &#x548C; GitChat &#x7684;&#x6280;&#x672F;&#x793E;&#x533A;&#x5185;&#x5BB9;&#x4E2D;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x6FC0;&#x52B1;&#x673A;&#x5236;&#x5EFA;&#x7ACB;&#x5E76;&#x4E0D;&#x5BB9;&#x6613;&#xFF0C;&#x4ED8;&#x51FA;&#x548C;&#x56DE;&#x62A5;&#x4E5F;&#x4E0D;&#x5BF9;&#x7B49;&#x3002;&#x9700;&#x8981;&#x66F4;&#x591A;&#x5F00;&#x53D1;&#x8005;&#x548C;&#x6280;&#x672F;&#x5927;&#x725B;&#x6295;&#x5165;&#x8FDB;&#x6765;&#xFF0C;&#x8FD9;&#x662F;&#x5F00;&#x6E90;&#x793E;&#x533A;&#x7684;&#x4EF7;&#x503C;&#x6240;&#x5728;&#x3002;</p>
</blockquote>
<h5 id="58-&#x5F00;&#x6E90;&#x793E;&#x533A;&#x5E74;&#x9F84;&#x5206;&#x5E03;"><strong>5.8 &#x5F00;&#x6E90;&#x793E;&#x533A;&#x5E74;&#x9F84;&#x5206;&#x5E03;</strong></h5>
<p>&#x5728;&#x53C2;&#x4E0E;&#x8005;&#x8EAB;&#x8FB9;&#x7684;&#x5F00;&#x6E90;&#x793E;&#x533A;&#x6210;&#x5458;&#x4E2D;&#xFF0C;20-30 &#x5C81;&#x7684;&#x8D21;&#x732E;&#x8005;&#x662F;&#x4E3B;&#x8981;&#x7684;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#xFF0C;&#x5360;&#x6BD4;&#x8FBE;&#x5230;&#x4E86; 70% &#x4EE5;&#x4E0A;&#x3002;</p>
<p><img src="https://images.gitbook.cn/5b59e270-d411-11e8-80d1-917ffa8847fa" alt="enter image description here"></p>
<h4 id="&#x516D;&#x3001;&#x5F00;&#x53D1;&#x8005;&#x6280;&#x672F;&#x73B0;&#x72B6;"><strong>&#x516D;&#x3001;&#x5F00;&#x53D1;&#x8005;&#x6280;&#x672F;&#x73B0;&#x72B6;</strong></h4>
<h5 id="61-&#x4F7F;&#x7528;&#x8BED;&#x8A00;"><strong>6.1 &#x4F7F;&#x7528;&#x8BED;&#x8A00;</strong></h5>
<p>&#x4F7F;&#x7528;&#x8BED;&#x8A00;&#x4E2D;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;JavaScript &#x7A33;&#x5C45;&#x9996;&#x4F4D;&#xFF0C;&#x4F7F;&#x7528;&#x8005;&#x6BD4;&#x4F8B;&#x9AD8;&#x8FBE;58.11%&#xFF0C;Java&#x3001;HTML5&#x3001;Python&#x3001;SQL &#x7B49;&#x7D27;&#x968F;&#x5176;&#x540E;&#x3002;</p>
<p><img src="https://images.gitbook.cn/1658ddf0-d413-11e8-80d1-917ffa8847fa" alt="enter image description here"></p>
<blockquote>
<p>&#x3010;&#x738B;&#x542F;&#x6CF0;&#x70B9;&#x8BC4;&#x3011;&#x8C03;&#x67E5;&#x7ED3;&#x679C;&#x548C;&#x56FD;&#x5916;&#x7684;&#x8C03;&#x67E5;&#x7ED3;&#x679C;&#x5728;&#x524D;&#x9762;&#x7684;&#x6392;&#x540D;&#x57FA;&#x672C;&#x4E0A;&#x4E00;&#x81F4;&#x3002;&#x548C; GitHub &#x7684;&#x7EDF;&#x8BA1;&#x4E5F;&#x76F8;&#x4F3C;&#x3002;JavaScript &#x4F5C;&#x4E3A;&#x811A;&#x672C;&#x8BED;&#x8A00;&#xFF0C;&#x7ECF;&#x5E38;&#x548C;&#x5176;&#x4ED6;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x5982; Java &#x548C; Python &#x642D;&#x914D;&#xFF0C;&#x672C;&#x8EAB;&#x4E5F;&#x53EF;&#x4EE5;&#x5728; web &#x5F00;&#x53D1;&#x91CC;&#x9762;&#x7B80;&#x5355;&#x529F;&#x80FD;&#x5B9E;&#x73B0;&#x6709;&#x5176;&#x8D21;&#x732E;&#xFF0C;&#x52A0;&#x4E0A;&#x76F8;&#x5BF9;&#x6BD4;&#x8F83;&#x5BB9;&#x6613;&#x4E0A;&#x624B;&#x7684;&#x4F18;&#x52BF;&#xFF0C;&#x4F4D;&#x5C45;&#x9AD8;&#x4F4D;&#x662F;&#x7406;&#x6240;&#x5F53;&#x7136;&#x3002;Java &#x5728;&#x540E;&#x53F0;&#x6570;&#x636E;&#x5904;&#x7406;&#x3001;&#x590D;&#x6742;&#x529F;&#x80FD;&#x5B9E;&#x73B0;&#xFF0C;&#x5404;&#x79CD;&#x652F;&#x6301;&#x6846;&#x67B6;&#x7684;&#x54C1;&#x8D28;&#x548C;&#x9009;&#x62E9;&#x4E0A;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x79EF;&#x7D2F;&#x548C;&#x4F18;&#x52BF;&#xFF0C;&#x4ECD;&#x7136;&#x662F;&#x53D7;&#x5230;&#x5F00;&#x53D1;&#x8005;&#x7684;&#x6B22;&#x8FCE;&#x3002;Python &#x6709;&#x8BED;&#x6CD5;&#x7B80;&#x6D01;&#x9AD8;&#x6548;&#x7684;&#x4F18;&#x52BF;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x6570;&#x636E;&#x5206;&#x6790;&#x7684;&#x652F;&#x6301;&#x6709;&#x4E30;&#x5BCC;&#x7684;&#x79EF;&#x7D2F;&#xFF0C;&#x5728;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x6D6A;&#x6F6E;&#x7684;&#x63A8;&#x54C4;&#x4E0B;&#xFF0C;&#x81EA;&#x7136;&#x6709;&#x6392;&#x540D;&#x4E0A;&#x5347;&#x7684;&#x8D8B;&#x52BF;&#x3002;</p>
<p>&#x3010;&#x8C22;&#x5DE5;&#x70B9;&#x8BC4;&#x3011;&#x5F97;&#x76CA;&#x4E8E; Node.js &#x7684;&#x5FEB;&#x901F;&#x53D1;&#x5C55;&#xFF0C;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7684;&#x524D;&#x7AEF;&#x5DE5;&#x7A0B;&#x5E08;&#x8FDB;&#x9636;&#x6210;&#x4E3A;&#x5168;&#x6808;&#x5DE5;&#x7A0B;&#x5E08;&#xFF0C;&#x5BF9;&#x4F01;&#x4E1A;&#x800C;&#x8A00;&#x5168;&#x6808;&#x5DE5;&#x7A0B;&#x5E08;&#x7684;&#x589E;&#x52A0;&#xFF0C;&#x964D;&#x4F4E;&#x4E86;&#x9879;&#x76EE;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#x7684;&#x4EBA;&#x5458;&#x6210;&#x672C;&#x548C;&#x6C9F;&#x901A;&#x6210;&#x672C;&#xFF0C;&#x4F01;&#x4E1A;&#x5728;&#x9879;&#x76EE;&#x89C4;&#x5212;&#x65F6;&#xFF0C;&#x4E5F;&#x8D8A;&#x6765;&#x8D8A;&#x4E50;&#x4E8E;&#x9009;&#x62E9; JS &#x4F5C;&#x4E3A;&#x9879;&#x76EE;&#x7684;&#x4E3B;&#x8981;&#x5F00;&#x53D1;&#x8BED;&#x8A00;&#xFF0C;&#x8FD9;&#x4E5F;&#x53CD;&#x8FC7;&#x6765;&#x523A;&#x6FC0;&#x4E86; JS &#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x589E;&#x957F;&#x548C;&#x6280;&#x672F;&#x7684;&#x53D1;&#x5C55;&#x3002;</p>
</blockquote>
<h5 id="62-&#x5728;&#x7EBF;&#x6587;&#x6863;&#x534F;&#x4F5C;&#x7F16;&#x8F91;&#x5DE5;&#x5177;"><strong>6.2 &#x5728;&#x7EBF;&#x6587;&#x6863;&#x534F;&#x4F5C;&#x7F16;&#x8F91;&#x5DE5;&#x5177;</strong></h5>
<p>&#x5728;&#x7EBF;&#x6587;&#x6863;&#x7F16;&#x8F91;&#x5DE5;&#x5177;&#x4E2D;&#xFF0C;&#x6709;&#x8FD1;&#x534A;&#x6570;&#x7684;&#x53C2;&#x4E0E;&#x8005;&#x4F7F;&#x7528; wiki &#x4F5C;&#x4E3A;&#x4ED6;&#x4EEC;&#x7684;&#x9009;&#x62E9;&#xFF0C;&#x800C; Google Doc &#x4E5F;&#x53D7;&#x5230;&#x5927;&#x5BB6;&#x7684;&#x9752;&#x7750;&#xFF0C;&#x53E6;&#x5916;&#xFF0C;&#x77F3;&#x58A8;&#x6587;&#x6863;&#x7B49;&#x4E5F;&#x662F;&#x5927;&#x5BB6;&#x7ECF;&#x5E38;&#x4F7F;&#x7528;&#x7684;&#x5DE5;&#x5177;&#x3002;</p>
<p><img src="https://images.gitbook.cn/467b1a20-d413-11e8-80d1-917ffa8847fa" alt="enter image description here"></p>
<h5 id="63-&#x7F16;&#x8F91;&#x5668;"><strong>6.3 &#x7F16;&#x8F91;&#x5668;</strong></h5>
<p>&#x5728;&#x7F16;&#x8F91;&#x5668;&#x4F7F;&#x7528;&#x60C5;&#x51B5;&#x4E2D;&#xFF0C;2015 &#x5E74;&#x6CA1;&#x6709;&#x4E0A;&#x699C;&#x7684; VS Code &#x662F;&#x8FD1;&#x4E09;&#x5E74;&#x6765;&#x7684;&#x9ED1;&#x9A6C;&#xFF0C;2018 &#x5E74;&#x6392;&#x540D;&#x7B2C;&#x4E00;&#xFF0C; vim &#x548C; notepad++ &#x4E00;&#x5982;&#x5373;&#x5F80;&#xFF0C;&#x6DF1;&#x53D7;&#x5927;&#x5BB6;&#x559C;&#x7231;&#xFF0C;&#x53E6;&#x5916;&#xFF0C;&#x5982; Sublime&#x3001;Atom.io &#x7CFB;&#x5217;&#x7B49; IDE &#x4E5F;&#x90FD;&#x662F;&#x5927;&#x5BB6;&#x5E38;&#x7528;&#x7684;&#x4EE3;&#x7801;&#x7F16;&#x8F91;&#x5668;&#x3002;</p>
<p><img src="https://images.gitbook.cn/6a6e97e0-d413-11e8-80d1-917ffa8847fa" alt="enter image description here"></p>
<blockquote>
<p>&#x3010;&#x6881;&#x8389;&#x70B9;&#x8BC4;&#x3011;VS Code &#x662F;&#x4E00;&#x4E2A;&#x5F00;&#x6E90;&#x7684;&#x8F7B;&#x91CF;&#x7EA7;&#x4EE3;&#x7801;&#x7F16;&#x8F91;&#x5668;&#xFF0C;&#x53EF;&#x4EE5;&#x8DE8;&#x5E73;&#x53F0;&#x5B89;&#x88C5;&#xFF0C;&#x5728;&#x5168;&#x7403;&#x7684;&#x8C03;&#x7814;&#x4E2D;&#x6211;&#x4EEC;&#x4E5F;&#x770B;&#x5230; VS Code &#x7684;&#x53D7;&#x6B22;&#x8FCE;&#x7A0B;&#x5EA6;&#x9010;&#x5E74;&#x4E0A;&#x5347;&#x3002;&#x800C; vim &#x4E00;&#x5982;&#x65E2;&#x5F80;&#x7684;&#x53D7;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x7684;&#x949F;&#x7231;&#x3002;</p>
<p>&#x3010;&#x9634;&#x660E;&#x70B9;&#x8BC4;&#x3011;VS Code &#x7684;&#x589E;&#x957F;&#x901F;&#x5EA6;&#x5728;&#x4F17;&#x591A;&#x7F16;&#x8F91;&#x5668;&#x4E2D;&#x90FD;&#x662F;&#x6700;&#x5FEB;&#x7684;&#xFF0C;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x8F83;&#x65B0;&#x7684;&#x81EA;&#x5E26;&#x63D2;&#x4EF6;&#x5E73;&#x53F0;&#x7684;&#x65B0;&#x5F0F;&#x7F16;&#x8F91;&#x5668;&#xFF0C;&#x5B83;&#x4E5F;&#x8D85;&#x8D8A;&#x4E86; GitHub Atom &#x6210;&#x4E3A;&#x5F00;&#x53D1;&#x8005;&#x7684;&#x9996;&#x9009;&#x3002;&#x4E00;&#x65B9;&#x9762;&#x5F97;&#x76CA;&#x4E8E;&#x5176;&#x9AD8;&#x6027;&#x80FD;&#x7684;&#x6548;&#x7387;&#xFF0C;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#x5C31;&#x662F;&#x76F8;&#x5173;&#x63D2;&#x4EF6;&#x7684;&#x8865;&#x5145;&#x901F;&#x5EA6;&#x975E;&#x5E38;&#x5FEB;&#xFF0C;&#x4E14;&#x4E0B;&#x8F7D;&#x3001;&#x66F4;&#x65B0;&#x6A21;&#x5757;&#x7684;&#x6548;&#x7387;&#x90FD;&#x4F18;&#x4E8E; Atom&#x3002;</p>
</blockquote>
<h5 id="64-&#x7248;&#x672C;&#x63A7;&#x5236;&#x5DE5;&#x5177;"><strong>6.4 &#x7248;&#x672C;&#x63A7;&#x5236;&#x5DE5;&#x5177;</strong></h5>
<p>Git &#x4F9D;&#x7136;&#x662F;&#x53C2;&#x4E0E;&#x8005;&#x6700;&#x559C;&#x7231;&#x7684;&#x7248;&#x672C;&#x63A7;&#x5236;&#x5DE5;&#x5177;&#xFF0C;&#x8D85;&#x8FC7;&#x4E5D;&#x6210;&#x7684;&#x53C2;&#x4E0E;&#x8005;&#x4F7F;&#x7528;&#x5B83;&#xFF0C;&#x4F7F;&#x7528; SVN &#x7684;&#x6BD4;&#x4F8B;&#x4ECE; 2015 &#x5E74;&#x7684; 54% &#x4E0B;&#x964D;&#x5230;&#x4E86; 36%&#x3002;</p>
<p><img src="https://images.gitbook.cn/8bf4bf20-d413-11e8-80d1-917ffa8847fa" alt="enter image description here"></p>
<blockquote>
<p>&#x3010;&#x8C22;&#x5DE5;&#x70B9;&#x8BC4;&#x3011;&#x4E4B;&#x6240;&#x4EE5; Git &#x6210;&#x4E3A;&#x6700;&#x53D7;&#x559C;&#x7231;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x4ED6;&#x5728;&#x7248;&#x672C;&#x63A7;&#x5236;&#x4E0A;&#x529F;&#x80FD;&#x66F4;&#x52A0;&#x5F3A;&#x5927;&#xFF0C;&#x4F46; Git &#x672C;&#x8EAB;&#x5728;&#x4F7F;&#x7528;&#x4E0A;&#x4E5F;&#x6709;&#x6BD4;&#x5176;&#x4ED6;&#x66F4;&#x9AD8;&#x4E00;&#x4E9B;&#x7684;&#x590D;&#x6742;&#x5EA6;&#xFF0C;&#x6211;&#x4EEC;&#x505A;&#x8FC7;&#x4E00;&#x4E2A;&#x5185;&#x90E8;&#x8C03;&#x67E5;&#xFF0C;&#x516C;&#x53F8;&#x5185;&#x90E8;&#x5927;&#x591A;&#x6570;&#x7684;&#x5DE5;&#x7A0B;&#x5E08;&#x5BF9; Git &#x7684;&#x719F;&#x6089;&#x7A0B;&#x5EA6;&#x505C;&#x7559;&#x5728;&#x521D;&#x7EA7;&#x9636;&#x6BB5;&#xFF0C;&#x5E38;&#x7528;&#x7684;&#x547D;&#x4EE4;&#x4E0D;&#x8DB3;&#x5341;&#x4E2A;&#xFF0C;&#x8FD9;&#x91CC;&#x9762;&#x751A;&#x81F3;&#x6709;&#x4E0D;&#x5C11;&#x4E94;&#x5E74;&#x4EE5;&#x4E0A;&#x7ECF;&#x9A8C;&#x7684;&#x5F00;&#x53D1;&#x8005;&#x3002;</p>
</blockquote>
<h5 id="65-&#x6570;&#x636E;&#x5E93;"><strong>6.5 &#x6570;&#x636E;&#x5E93;</strong></h5>
<p>&#x6570;&#x636E;&#x5E93;&#x4F7F;&#x7528;&#x60C5;&#x51B5;&#x4E2D;&#xFF0C;&#x4E0D;&#x51FA;&#x610F;&#x5916;&#x5730;&#xFF0C;MySQL &#x4EE5;&#x8FD1;&#x516B;&#x6210;&#x7684;&#x5360;&#x6BD4;&#x9065;&#x9065;&#x9886;&#x5148;&#xFF0C;&#x4F5C;&#x4E3A; NoSQL &#x4EE3;&#x8868;&#x7684; MongoDB &#x4E0E; SQL Server &#x8DDF;&#x968F;&#x5176;&#x540E;&#x3002;</p>
<p><img src="https://images.gitbook.cn/aaa5f470-d413-11e8-80d1-917ffa8847fa" alt="enter image description here"></p>
<blockquote>
<p>&#x3010;&#x738B;&#x542F;&#x6CF0;&#x70B9;&#x8BC4;&#x3011;MySQL &#x4F5C;&#x4E3A;&#x5F00;&#x6E90;&#x6570;&#x636E;&#x5E93;&#x7684;&#x9886;&#x5934;&#x7F8A;&#xFF0C;&#x5C45;&#x4E8E;&#x9996;&#x4F4D;&#x662F;&#x5728;&#x610F;&#x6599;&#x4E2D;&#xFF0C;&#x6709;&#x5982;&#x6B64;&#x9AD8;&#x7684;&#x6BD4;&#x4F8B;&#x662F;&#x4EE4;&#x4EBA;&#x60CA;&#x559C;&#x3002;NoSQL &#x4E2D;&#x9886;&#x5148;&#x8005; MongoDB &#x6709;&#x8D85;&#x8FC7; 30% &#x7684;&#x4F7F;&#x7528;&#x7387;&#xFF0C;&#x652F;&#x6301;&#x4E86;&#x5E94;&#x7528;&#x7A0B;&#x5F0F;&#x671D;&#x5411;&#x975E;&#x7ED3;&#x6784;&#x5316;&#x7684;&#x5F00;&#x53D1;&#x65B9;&#x5411;&#x524D;&#x8FDB;&#x7684;&#x60F3;&#x6CD5;&#x3002;&#x800C; Oracle &#x548C; SQL Server &#x4F5C;&#x4E3A;&#x4ED8;&#x8D39;&#x5546;&#x4E1A;&#x6570;&#x636E;&#x5E93;&#x7684;&#x4E3B;&#x529B;&#x4EA7;&#x54C1;&#xFF0C;&#x57FA;&#x672C;&#x4E0A;&#x90FD;&#x662F;&#x4F01;&#x4E1A;&#x5185;&#x95ED;&#x6E90;&#x5F00;&#x53D1;&#x7684;&#x9009;&#x62E9;&#x3002;&#x5728;&#x5177;&#x6709;&#x5F00;&#x6E90;&#x53C2;&#x4E0E;&#x7684;&#x9879;&#x76EE;&#x4E2D;&#x51FA;&#x73B0;&#x5546;&#x4E1A;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x53EF;&#x80FD;&#x610F;&#x5473;&#x7740;&#x90E8;&#x5206;&#x95ED;&#x6E90;&#x5F00;&#x53D1;&#x4F7F;&#x7528;&#x4E86;&#x5F00;&#x6E90;&#x7684;&#x4EE3;&#x7801;&#x3002;</p>
</blockquote>
<h5 id="66-&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;"><strong>6.6 &#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;</strong></h5>
<p>&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x4F7F;&#x7528;&#x4E2D;&#xFF0C;Windows &#x5360;&#x636E;&#x4E86;&#x8D85;&#x8FC7; 38% &#x7684;&#x4EFD;&#x989D;&#xFF0C;Linux &#x7D27;&#x968F;&#x5176;&#x540E;&#xFF0C;&#x800C; MacOS &#x7684;&#x5360;&#x6BD4;&#x8FD1;&#x4E09;&#x6210;&#x5DE6;&#x53F3;&#x3002;</p>
<p><img src="https://images.gitbook.cn/c98e3f50-d413-11e8-80d1-917ffa8847fa" alt="enter image description here"></p>
<blockquote>
<p>&#x3010;&#x6881;&#x8389;&#x70B9;&#x8BC4;&#x3011;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x4F7F;&#x7528;&#x6BD4;&#x4F8B;&#x57FA;&#x672C;&#x548C; Stack Overflow &#x5F00;&#x53D1;&#x8005;&#x8C03;&#x67E5;&#x662F;&#x4E00;&#x81F4;&#x7684;&#x3002;&#x8FD1;&#x65E5;&#xFF0C;&#x5FAE;&#x8F6F;&#x5BA3;&#x5E03;&#x52A0;&#x5165; Open Invention Network (OIN)&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x81F4;&#x529B;&#x4E8E;&#x4FDD;&#x62A4;&#x4E1A;&#x514D;&#x53D7;&#x4E13;&#x5229;&#x8BC9;&#x8BBC;&#x7684;&#x884C;&#x4E1A;&#x8054;&#x76DF;&#x3002;&#x5FAE;&#x8F6F;&#x5C06;&#x628A;&#x81EA;&#x5DF1;&#x7684; 6 &#x4E07;&#x591A;&#x9879;&#x4E13;&#x5229;&#x7EC4;&#x5408;&#x514D;&#x8D39;&#x63D0;&#x4F9B;&#x7ED9;&#x8054;&#x76DF;&#x7684; 2650 &#x5BB6;&#x5DE6;&#x53F3;&#x7684;&#x516C;&#x53F8;&#x3002;&#x8FD9;&#x4E00;&#x4E3E;&#x63AA;&#x4E5F;&#x8BA9;&#x6211;&#x4EEC;&#x770B;&#x5230;&#x5FAE;&#x8F6F;&#x6210;&#x4E3A;&#x6574;&#x4E2A; Linux &#x751F;&#x6001;&#x7CFB;&#x7EDF;&#x548C;&#x5F00;&#x6E90;&#x793E;&#x533A;&#x7684;&#x5168;&#x9762;&#x652F;&#x6301;&#x8005;&#x3002;</p>
</blockquote>
<h5 id="67-linux-&#x7248;&#x672C;"><strong>6.7 Linux &#x7248;&#x672C;</strong></h5>
<p>&#x5728; Linux &#x7684;&#x53D1;&#x884C;&#x7248;&#x672C;&#x4E2D;&#xFF0C;&#x6700;&#x53D7;&#x6B22;&#x8FCE;&#x7684;&#x4F9D;&#x7136;&#x662F; Ubuntu&#xFF0C;&#x7D27;&#x968F;&#x5176;&#x540E;&#x4E3A; Red Hat&#x3002;</p>
<p><img src="https://images.gitbook.cn/f3cdad50-d413-11e8-80d1-917ffa8847fa" alt="enter image description here"></p>
<h5 id="68-java-&#x6846;&#x67B6;"><strong>6.8 Java &#x6846;&#x67B6;</strong></h5>
<p>&#x5728; Java &#x6846;&#x67B6;&#x4F7F;&#x7528;&#x65B9;&#x9762;&#xFF0C;Spring &#x5360;&#x6709;&#x7EDD;&#x5BF9;&#x4F18;&#x52BF;&#xFF0C;&#x4F7F;&#x7528;&#x8005;&#x9AD8;&#x8FBE; 81%&#x3002;</p>
<p><img src="https://images.gitbook.cn/0b37a270-d414-11e8-80d1-917ffa8847fa" alt="enter image description here"></p>
<blockquote>
<p>&#x3010;&#x738B;&#x542F;&#x6CF0;&#x70B9;&#x8BC4;&#x3011;Spring &#x4F5C;&#x4E3A;&#x8F7B;&#x91CF;&#x7EA7;&#x5E94;&#x7528;&#x5BB9;&#x5668;&#x5E76;&#x4E14;&#x62E5;&#x6709; Sping MVC&#x3001;Spring Data&#x3001;Spring Boot&#x3001;Spring Cloud &#x7B49;&#x8303;&#x56F4;&#x7684;&#x5B9E;&#x7528;&#x7684;&#x4EA7;&#x54C1;&#xFF0C; &#x5728;&#x957F;&#x4E45;&#x7684; Java &#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x7684;&#x62E5;&#x62A4;&#x4E0B;&#x7EE7;&#x7EED;&#x8FD9;&#x6837;&#x9AD8;&#x6BD4;&#x4F8B;&#x7684;&#x4F18;&#x52BF;&#xFF0C;&#x771F;&#x662F;&#x5B9E;&#x81F3;&#x540D;&#x5F52;&#x3002;</p>
<p>&#x3010;&#x6881;&#x8389;&#x70B9;&#x8BC4;&#x3011;&#x6BCB;&#x5EB8;&#x7F6E;&#x7591; Spring &#x76EE;&#x524D;&#x662F;&#x6700;&#x6D41;&#x884C;&#x7684; Java Web &#x6846;&#x67B6;&#x3002;&#x76F8;&#x5BF9;&#x4E8E; <a href="https://zeroturnaround.com/webframeworksindex/" target="_blank">Zeroturnaround &#x7684;&#x8C03;&#x7814;&#x62A5;&#x544A;</a> - Spring MVC 28.82%&#xFF0C;JSF 15.2% &#x4EE5;&#x53CA; Spring Boot 13.35%&#xFF0C;Spring &#x5728;&#x4E2D;&#x56FD;&#x51E0;&#x4E4E;&#x662F;&#x4E3B;&#x5BFC;&#x7684;&#x89D2;&#x8272;&#x3002;</p>
</blockquote>
<h5 id="69-ruby-&#x6846;&#x67B6;"><strong>6.9 Ruby &#x6846;&#x67B6;</strong></h5>
<p>&#x5728; Ruby &#x6846;&#x67B6;&#x4F7F;&#x7528;&#x65B9;&#x9762;&#xFF0C;&#x6392;&#x5728;&#x524D;&#x5217;&#x7684; Rails &#x6709;&#x8D85;&#x8FC7;&#x56DB;&#x6210;&#x7684;&#x4F7F;&#x7528;&#x7387;&#xFF0C;&#x4ECD;&#x5360;&#x636E;&#x7740;&#x4E3B;&#x6D41;&#x5730;&#x4F4D;&#x3002;</p>
<p><img src="https://images.gitbook.cn/4fb6bad0-d414-11e8-80d1-917ffa8847fa" alt="enter image description here"></p>
<h5 id="610-php-&#x6846;&#x67B6;"><strong>6.10 PHP &#x6846;&#x67B6;</strong></h5>
<p>PHP &#x8BED;&#x8A00;&#x7684;&#x6846;&#x67B6;&#x4F7F;&#x7528;&#x65B9;&#x9762;&#xFF0C;ThinkPHP &#x4F5C;&#x4E3A;&#x5168;&#x9762;&#x6210;&#x719F;&#x7684;&#x6846;&#x67B6;&#xFF0C;&#x6709;&#x534A;&#x6570;&#x4EE5;&#x4E0A;&#x7684;&#x53C2;&#x4E0E;&#x8005;&#x5747;&#x4F7F;&#x7528;&#x8FC7;&#x8BE5;&#x6846;&#x67B6;&#x3002;</p>
<p><img src="https://images.gitbook.cn/651e5040-d414-11e8-80d1-917ffa8847fa" alt="enter image description here"></p>
<h5 id="611-go-&#x6846;&#x67B6;"><strong>6.11 Go &#x6846;&#x67B6;</strong></h5>
<p>Go &#x8BED;&#x8A00;&#x7684;&#x6846;&#x67B6;&#x5219;&#x5448;&#x73B0;&#x767E;&#x82B1;&#x9F50;&#x653E;&#x7684;&#x52BF;&#x6001;&#xFF0C;&#x4F7F;&#x7528;&#x8F83;&#x591A;&#x7684; Beego &#x6709;&#x8D85;&#x8FC7;&#x56DB;&#x6210;&#x7684;&#x7528;&#x6237;&#x6BD4;&#x4F8B;&#x3002;</p>
<p><img src="https://images.gitbook.cn/8191f1a0-d414-11e8-80d1-917ffa8847fa" alt="enter image description here"></p>
<p>Beego &#x5728;&#x793E;&#x533A;&#x63A8;&#x5E7F;&#x7684;&#x6BD4;&#x8F83;&#x597D;&#xFF0C;&#x529F;&#x80FD;&#x6BD4;&#x8F83;&#x591A;&#x3002;Revel &#x76F8;&#x6BD4; Beego &#x66F4;&#x7B80;&#x6D01;&#xFF0C;&#x6BD4;&#x8F83;&#x5BB9;&#x6613;&#x6269;&#x5C55;&#x3002;</p>
<h5 id="612-nodejs-&#x6846;&#x67B6;"><strong>6.12 Node.js &#x6846;&#x67B6;</strong></h5>
<p>Node.js &#x6846;&#x67B6;&#xFF0C;&#x5176;&#x4E2D; Express &#x7684;&#x4EFD;&#x989D;&#x8D85;&#x8FC7; 70%&#x3002;</p>
<p><img src="https://images.gitbook.cn/9f297990-d414-11e8-80d1-917ffa8847fa" alt="&#x56FE;&#x7247;"></p>
<h5 id="613-python-&#x6846;&#x67B6;"><strong>6.13 Python &#x6846;&#x67B6;</strong></h5>
<p>&#x4E0D;&#x51FA;&#x610F;&#x5916;&#x7684;&#xFF0C;Django &#x5728; Python &#x6846;&#x67B6;&#x4E2D;&#x72EC;&#x9886;&#x98CE;&#x9A9A;&#xFF0C;&#x6709;&#x516D;&#x6210;&#x7684;&#x53C2;&#x4E0E;&#x8005;&#x5747;&#x4F7F;&#x7528; Django &#x4F5C;&#x4E3A;&#x4ED6;&#x4EEC;&#x7684;&#x5F00;&#x53D1;&#x6846;&#x67B6;&#x3002;</p>
<p><img src="https://images.gitbook.cn/c1ee3b50-d414-11e8-80d1-917ffa8847fa" alt="&#x56FE;&#x7247;"></p>
<h5 id="614-&#x524D;&#x7AEF;&#x6846;&#x67B6;"><strong>6.14 &#x524D;&#x7AEF;&#x6846;&#x67B6;</strong></h5>
<p>&#x5728;&#x524D;&#x7AEF;&#x6846;&#x67B6;&#x4E2D;&#xFF0C;Vue.js &#x4E0E; JQuery&#x3001;Bootstrap &#x4E09;&#x8DB3;&#x9F0E;&#x7ACB;&#x3002;</p>
<p><img src="https://images.gitbook.cn/d2a010e0-d414-11e8-80d1-917ffa8847fa" alt="enter image description here"></p>
<blockquote>
<p>&#x3010;&#x8C22;&#x5DE5;&#x70B9;&#x8BC4;&#x3011;AngularJS &#x548C; React &#x53D1;&#x5C55;&#x4E5F;&#x5F88;&#x597D;&#x3002;Bootstrap&#x3001;jQuery&#x3001;Vue.js &#x90FD;&#x662F;&#x524D;&#x7AEF;&#x6846;&#x67B6;&#xFF0C;&#x4F46;&#x662F;&#x6709;&#x5F88;&#x5927;&#x7684;&#x4E0D;&#x540C;&#x3002;Bootstrap &#x662F; CSS/HTML &#x6846;&#x67B6;&#xFF0C;Vue.js&#x3001;React&#x3001;AngularJS &#x662F; SPA &#x6846;&#x67B6;&#x3002;</p>
</blockquote>
<h5 id="615-cms-&#x7CFB;&#x7EDF;"><strong>6.15 CMS &#x7CFB;&#x7EDF;</strong></h5>
<p>CMS &#x5EFA;&#x7AD9;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;WordPress &#x5360;&#x5230;&#x4E86;&#x8FD1;&#x4E03;&#x6210;&#x7684;&#x4EFD;&#x989D;&#xFF0C;&#x5177;&#x6709;&#x7EDD;&#x5BF9;&#x7684;&#x4F18;&#x52BF;&#x3002;</p>
<p><img src="https://images.gitbook.cn/8670c7e0-d415-11e8-80d1-917ffa8847fa" alt="enter image description here"></p>
<p>Wordpress &#x7684;&#x6613;&#x7528;&#x6027;&#x6700;&#x597D;&#xFF0C;&#x81EA;&#x7136;&#x4EFD;&#x989D;&#x6700;&#x5927;&#x3002;Drupal &#x7684;&#x5B9A;&#x5236;&#x6027;&#x5F3A;&#xFF0C;&#x4F46;&#x5B66;&#x4E60;&#x6210;&#x672C;&#x9AD8;</p>
<h5 id="616-&#x7535;&#x5B50;&#x5546;&#x52A1;&#x7CFB;&#x7EDF;"><strong>6.16 &#x7535;&#x5B50;&#x5546;&#x52A1;&#x7CFB;&#x7EDF;</strong></h5>
<p>&#x7535;&#x5B50;&#x5546;&#x52A1;&#x5EFA;&#x7AD9;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;Magento &#x6709;&#x56DB;&#x6210;&#x4EE5;&#x4E0A;&#x7684;&#x7528;&#x6237;&#x4F7F;&#x7528;&#x3002;</p>
<p><img src="https://images.gitbook.cn/997f5220-d415-11e8-80d1-917ffa8847fa" alt="enter image description here"></p>
<h4 id="&#x4E03;&#x3001;&#x603B;&#x7ED3;">&#x4E03;&#x3001;&#x603B;&#x7ED3;</h4>
<p>&#x672C;&#x6B21; 2018 &#x5E74;&#x5EA6;&#x4E2D;&#x56FD;&#x5F00;&#x6E90;&#x53C2;&#x4E0E;&#x8C03;&#x67E5;&#x62A5;&#x544A;&#x4EE5;&#x5F00;&#x6E90;&#x793E;&#x533A;&#x534F;&#x4F5C;&#x7684;&#x65B9;&#x5F0F;&#x5171;&#x540C;&#x5B8C;&#x6210;&#xFF0C;&#x4EE5;&#x8349;&#x6839;&#x7684;&#x65B9;&#x5F0F;&#x81EA;&#x5E95;&#x5411;&#x4E0A;&#x5B8C;&#x6210;&#x3002;&#x4E0E;&#x6574;&#x4E2A;&#x5E9E;&#x5927;&#x7684;&#x5F00;&#x6E90;&#x793E;&#x533A;&#x6BD4;&#xFF0C;&#x6211;&#x4EEC;&#x4E2A;&#x4EBA;&#x7684;&#x89C6;&#x91CE;&#x548C;&#x8D44;&#x6E90;&#x90FD;&#x6709;&#x5C40;&#x9650;&#xFF0C;&#x8BE5;&#x62A5;&#x544A;&#x901A;&#x8FC7;&#x95EE;&#x5377;&#x65B9;&#x5F0F;&#x641C;&#x96C6;&#x6570;&#x636E;&#xFF0C;&#x5982;&#x7BA1;&#x4E2D;&#x7AA5;&#x8C79;&#xFF0C;&#x7565;&#x89C1;&#x4E00;&#x6591;&#x3002;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x7531;&#x6B64;&#x629B;&#x7816;&#x5F15;&#x7389;&#xFF0C;&#x9080;&#x8BF7;&#x66F4;&#x591A;&#x7684;&#x793E;&#x533A;&#x548C;&#x4E2A;&#x4EBA;&#x52A0;&#x5165;&#xFF0C;&#x4E00;&#x8D77;&#x6765;&#x5B8C;&#x5584;&#x4E2D;&#x56FD;&#x5F00;&#x6E90;&#x5E74;&#x5EA6;&#x62A5;&#x544A;&#x3002;&#x60A8;&#x7684;&#x4E00;&#x5C0F;&#x6B65;&#xFF0C; &#x6574;&#x4E2A;&#x4E2D;&#x56FD;&#x5F00;&#x6E90;&#x793E;&#x533A;&#x7684;&#x4E00;&#x5927;&#x6B65;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev navigation-unique" aria-label="Previous page: 引言">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"问卷篇","level":"1.2","depth":1,"next":{"title":"数据篇","level":"1.3","depth":1,"ref":"","articles":[{"title":"指南针篇","level":"1.3.1","depth":2,"path":"chapter-dataanalysis/compass.md","ref":"chapter-dataanalysis/compass.md","articles":[]},{"title":"Grank篇","level":"1.3.2","depth":2,"path":"chapter-dataanalysis/grank.md","ref":"chapter-dataanalysis/grank.md","articles":[]}]},"previous":{"title":"引言","level":"1.1","depth":1,"path":"README.md","ref":"README.md","articles":[]},"dir":"ltr"},"config":{"plugins":[],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"开源社","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"2018中国开源年度报告","gitbook":"*","description":"2018中国开源年度报告"},"file":{"path":"chapter-questionnaire.md","mtime":"2019-11-20T04:45:48.192Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-11-20T04:48:12.409Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

