
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>引言 · 2018中国开源年度报告</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="开源社">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="chapter-questionnaire.html" />
    
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter active" data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    引言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="chapter-questionnaire.html">
            
                <a href="chapter-questionnaire.html">
            
                    
                    问卷篇
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" >
            
                <span>
            
                    
                    数据篇
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="chapter-dataanalysis/compass.html">
            
                <a href="chapter-dataanalysis/compass.html">
            
                    
                    指南针篇
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="chapter-dataanalysis/grank.html">
            
                <a href="chapter-dataanalysis/grank.html">
            
                    
                    Grank篇
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="chapter-insight.html">
            
                <a href="chapter-insight.html">
            
                    
                    洞察篇
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="chapter-epilogue.html">
            
                <a href="chapter-epilogue.html">
            
                    
                    结语
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >引言</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <p><img src="https://images.gitbook.cn/ba41ca50-d40c-11e8-80d1-917ffa8847fa" alt="enter image description here"></p>
<h3 id="&#x5F15;&#x8A00;">&#x5F15;&#x8A00;</h3>
<p><strong>&#x8F6F;&#x4EF6;&#x7684;&#x4E16;&#x754C;&#x5728;&#x6084;&#x7136;&#x53D1;&#x751F;&#x53D8;&#x5316;</strong></p>
<p>&#x5F53;&#x8457;&#x540D;&#x7684;&#x9A6C;&#x514B;&#x5B89;&#x5FB7;&#x68EE;&#x64B0;&#x5199;&#x300A;&#x8F6F;&#x4EF6;&#x6B63;&#x5728;&#x541E;&#x566C;&#x4E16;&#x754C;&#x300B;&#x7684;&#x6587;&#x7AE0;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53EF;&#x80FD;&#x6CA1;&#x6709;&#x60F3;&#x5230;&#xFF0C;&#x5728; 6 &#x5E74;&#x4E4B;&#x540E;&#xFF0C;&#x4ED6;&#x5C31;&#x9700;&#x8981;&#x52A0;&#x4E0A;&#x4E00;&#x4E2A;&#x5B9A;&#x8BED;&#xFF1A;</p>
<blockquote>
<p>&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#x6B63;&#x5728;&#x541E;&#x566C;&#x4E16;&#x754C;&#xFF01;</p>
</blockquote>
<p>&#x9762;&#x5BF9;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x7684;&#x4F26;&#x7406;&#x95EE;&#x9898;&#x3001;&#x8F6F;&#x4EF6;&#x4EA7;&#x80FD;&#x8FC7;&#x5269;&#x7684;&#x95EE;&#x9898;&#x3001;&#x8F6F;&#x4EF6;&#x8F6C;&#x578B;&#x4E3A;&#x670D;&#x52A1;&#x6A21;&#x5F0F;&#x7684;&#x95EE;&#x9898;&#x3001;&#x4E91;&#x8BA1;&#x7B97;&#x5DF2;&#x7ECF;&#x50CF;&#x7535;&#x529B;&#x4E00;&#x6837;&#x6210;&#x4E3A;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x9ED8;&#x8BA4;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x3001;&#x4EE5;&#x53CA;&#x9762;&#x5411;&#x6D77;&#x91CF;&#x6570;&#x636E;&#x7684;&#x5904;&#x7406;&#x95EE;&#x9898;&#x3002;&#x3002;&#x3002;&#x56F4;&#x7ED5;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x89E3;&#x51B3;&#x7684;&#x6838;&#x5FC3;&#x539F;&#x5219;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#xFF1A;Open Source&#xFF01;</p>
<p><strong>&#x7531;&#x9690;&#x800C;&#x663E;</strong></p>
<p>&#x5F00;&#x6E90; 20 &#x5C81;&#x4E86;&#xFF0C;&#x5B83;&#x7684;&#x5185;&#x6DB5;&#x548C;&#x5916;&#x5EF6;&#x6B63;&#x5728;&#x6269;&#x5927;&#xFF0C;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x4E00;&#x4E2A;&#x5F00;&#x6E90;&#x7684;&#x4EE3;&#x7801;&#x9879;&#x76EE;&#xFF0C;&#x4E5F;&#x4E0D;&#x518D;&#x4EC5;&#x4EC5;&#x662F;&#x4E00;&#x4E2A;&#x793E;&#x533A;&#xFF0C;&#x800C;&#x662F;&#x6B63;&#x53D8;&#x5F97;&#x65E5;&#x76CA;&#x590D;&#x6742;&#xFF0C;&#x7814;&#x7A76;&#x7684;&#x4EBA;&#x4E5F;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#xFF0C;&#x5F53;&#x7136;&#x8FD9;&#x662F;&#x7531;&#x4E8E;&#x53C2;&#x4E0E;&#x5230;&#x5F00;&#x6E90;&#x4E2D;&#x7684;&#x4EBA;&#x548C;&#x4F01;&#x4E1A;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x4E86;&#x3002;&#x4EE5;&#x4E0B;&#x4E0D;&#x59A8;&#x5217;&#x4E3E;&#x4E00;&#x756A;&#xFF1A;</p>
<p><strong>&#x5F00;&#x6E90;&#x662F;&#x4E00;&#x79CD;&#x793E;&#x4EA4;&#x73B0;&#x8C61;</strong></p>
<p>2018 &#x5E74;&#xFF0C;&#x6709;&#x4E00;&#x4E2A;&#x6D88;&#x606F;&#x582A;&#x79F0;&#x5F00;&#x6E90;&#x754C;&#x7684;&#x91CD;&#x78C5;&#x70B8;&#x5F39;&#xFF01;&#x8FD9;&#x5C31;&#x662F;&#x5FAE;&#x8F6F;&#x4EE5; 75 &#x4EBF;&#x7F8E;&#x5143;&#x7684;&#x4EF7;&#x683C;&#x6536;&#x8D2D;&#x4E86; GitHub&#xFF0C;&#x8981;&#x77E5;&#x9053;&#x5728; 1999 &#x5E74;&#xFF0C;&#x4EBA;&#x4EEC;&#x4ECD;&#x7136;&#x4E0D;&#x628A;&#x5F00;&#x6E90;&#x5F53;&#x505A;&#x4E00;&#x56DE;&#x4E8B;&#xFF0C;<a href="http://timreview.ca/sites/default/files/article_PDF/Suehle_TIMReview_January2012_0.pdf \t _blank" target="_blank">Bill Gates &#x5728;&#x5BA3;&#x4F20;&#x4ED6;&#x7684;&#x4E66;&#x65F6;</a>&#xFF0C;&#x66FE;&#x5982;&#x6B64;&#x8BC4;&#x4EF7; Linux &#x7684;&#xFF1A;&#x201C;&#x786E;&#x5B9E;&#x6211;&#x4EEC;&#x627F;&#x8BA4;&#x5728;&#x5B66;&#x751F;&#x548C;&#x7231;&#x597D;&#x8005;&#x5F53;&#x4E2D;&#x6211;&#x4EEC;&#x4E0D;&#x5982; Linux&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x4ECE;&#x591A;&#x4E2A;&#x89D2;&#x5EA6;&#x8003;&#x5BDF;&#x8FC7;&#xFF0C;&#x5E76;&#x4E0D;&#x8BA4;&#x4E3A;&#x5B83;&#x80FD;&#x5728;&#x5546;&#x4E1A;&#x5E02;&#x573A;&#x4E0A;&#x6709;&#x4F55;&#x4F5C;&#x4E3A;&#x3002;&#x201D;</p>
<p>&#x5F00;&#x6E90;&#x4E0D;&#x6B62;&#x4E8E;&#x6280;&#x672F;&#xFF0C;&#x9690;&#x85CF;&#x5728;&#x80CC;&#x540E;&#x7684;&#x662F;&#x5F00;&#x53D1;&#x8005;&#x3001;&#x5DE5;&#x7A0B;&#x5E08;&#x4EEC;&#x4E4B;&#x95F4;&#x7684;&#x534F;&#x4F5C;&#x4E0E;&#x4EA4;&#x6D41;&#xFF0C;&#x4EE5;&#x53CA;&#x5F7C;&#x6B64;&#x7684;&#x9ED8;&#x5951;&#x4E0E;&#x8912;&#x5956;&#x3002;&#x800C; GitHub &#x7684;&#x4E2A;&#x4EBA; Profile &#x66F4;&#x662F;&#x6210;&#x4E3A;&#x4E86;&#x6BD4;&#x7B80;&#x5386;&#x66F4;&#x80FD;&#x62FF;&#x5F97;&#x51FA;&#x624B;&#x7684;&#x201D;&#x91D1;&#x94A5;&#x5319;&#x201C;&#x3002;</p>
<blockquote>
<p><strong>&#x90A3;&#x4E48;&#x8FD9;&#x4E9B;&#x5F00;&#x6E90;&#x7684;&#x53C2;&#x4E0E;&#x8005;&#x4EEC;&#x65E5;&#x5E38;&#x662F;&#x5982;&#x4F55;&#x4EA4;&#x6D41;&#x7684;&#x5462;&#xFF1F;&#x4E3A;&#x4F55;&#x8FD9;&#x79CD;&#x4EA4;&#x6D41;&#x5982;&#x6B64;&#x7684;&#x5438;&#x5F15;&#x4ED6;&#x4EEC;&#x5462;&#xFF1F;</strong></p>
</blockquote>
<p><strong>&#x5F00;&#x6E90;&#x662F;&#x4E00;&#x79CD;&#x7ECF;&#x6D4E;&#x6A21;&#x5F0F;</strong></p>
<p>&#x5F00;&#x6E90;&#x754C;&#x4E00;&#x76F4;&#x4EE5;&#x6765;&#x90FD;&#x5728;&#x62C5;&#x5FC3;&#x642D;&#x4FBF;&#x8F66;&#xFF0C;&#x5F53;&#x7136;&#x73B0;&#x5B9E;&#x4E2D;&#x4E5F;&#x4E0D;&#x4E4F;&#x642D;&#x4FBF;&#x8F66;&#xFF0C;&#x987A;&#x4FBF;&#x8D5A;&#x70B9;&#x94B1;&#x7684;&#x4E2A;&#x4EBA;&#x548C;&#x4F01;&#x4E1A;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5B66;&#x672F;&#x754C;/&#x7ECF;&#x6D4E;&#x5708;&#x53D1;&#x6765;&#x4E86;&#x58F0;&#x97F3;&#xFF0C;&#x6765;&#x81EA;&#x54C8;&#x4F5B;&#x5546;&#x5B66;&#x9662;&#x6218;&#x7565;&#x90E8;&#x95E8;&#x7684; Frank Nagle &#x6559;&#x6388;&#xFF0C;&#x521A;&#x521A;&#x53D1;&#x8868;&#x4E86;&#x4E00;&#x7BC7;&#x957F;&#x8FBE; 40 &#x9875;&#x7684;&#x8BBA;&#x6587;&#xFF1A;<a href="http://www.hbs.edu/faculty/product/54809 \t _blank" target="_blank">&quot;Learning by Contributing: Gaining Competitive Advantage Through Contribution to Crowdsourced Public Goods.&quot;</a>  &#x4ECE;&#x5546;&#x4E1A;&#x7684;&#x89D2;&#x5EA6;&#x8BBA;&#x8BC1;&#x4E86;&#xFF0C;&#x4E3A;&#x4E0A;&#x6E38;&#x793E;&#x533A;&#x505A;&#x8D21;&#x732E;&#x5BF9;&#x4E8E;&#x4F01;&#x4E1A;&#x662F;&#x5927;&#x5927;&#x6709;&#x5229;&#x7684;&#xFF0C;&#x8FD9;&#x8981;&#x6BD4;&#x5DE5;&#x7A0B;&#x5E08;&#x5E03;&#x9053;&#x7528;&#x5E72;&#x5DF4;&#x5DF4;&#x7684;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x7406;&#x8BBA;&#x8981;&#x6709;&#x8BF4;&#x670D;&#x529B;&#x7684;&#x591A;&#xFF0C;&#x56E0;&#x4E3A;&#x61C2;&#x7684;&#x7B97;&#x7ECF;&#x6D4E;&#x8D26;&#x7684;&#x672A;&#x5FC5;&#x90FD;&#x61C2;&#x5F97;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x3002;</p>
<blockquote>
<p><strong>&#x90A3;&#x4E9B;&#x5927;&#x7684;&#x4F01;&#x4E1A;&#x4E3A;&#x4F55;&#x8FD1;&#x6765;&#x5F00;&#x59CB;&#x6CE8;&#x91CD;&#x4E0A;&#x6E38;&#x7684;&#x8D21;&#x732E;&#x548C;&#x66DD;&#x5149;&#x7387;&#xFF1F;</strong></p>
</blockquote>
<p><strong>&#x5F00;&#x6E90;&#x662F;&#x672C;&#x571F;&#x540C;&#x6B65;&#x4E16;&#x754C;&#x7684;&#x7EDD;&#x4F73;&#x65B9;&#x5F0F;</strong></p>
<p>&#x65E0;&#x8BBA;&#x4F60;&#x627F;&#x8BA4;&#x4E0E;&#x5426;&#xFF0C;&#x672C;&#x571F;&#x662F;&#x6CA1;&#x6709;&#x62FF;&#x5F97;&#x51FA;&#x624B;&#x7684;&#x8F6F;&#x4EF6;&#x57FA;&#x91D1;&#x4F1A;&#x6216;&#x5927;&#x578B;&#x7684;&#x7C7B;&#x4F3C; Linux&#x3001;Hadoop&#x3001;Kubernetes&#x3001;Docker&#x3001;TensorFlow &#x8FD9;&#x6837;&#x7684;&#x5212;&#x65F6;&#x4EE3;&#x7684;&#x3001;&#x521B;&#x65B0;&#x610F;&#x4E49;&#x7684;&#x3001;&#x80FD;&#x89E3;&#x51B3;&#x5B9E;&#x9645;&#x95EE;&#x9898;&#x7684;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x7684;&#x3002;&#x5F53;&#x6211;&#x4EEC;&#x8FD8;&#x5728;&#x5229;&#x7528;&#x5F00;&#x6E90;&#x81EA;&#x4E3B;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x4E16;&#x754C;&#x5DF2;&#x7ECF;&#x8D70;&#x51FA;&#x53BB;&#x5F88;&#x8FDC;&#x4E86;&#xFF01;&#x800C;&#x4F3C;&#x4E4E;&#x672C;&#x571F;&#x53EA;&#x6709;&#x201D; &#x62FE;&#x4EBA;&#x7259;&#x6167; &#x201C;&#x7684;&#x4EFD;&#xFF0C;&#x5728;&#x7ECF;&#x5386;&#x4E86;&#x672C;&#x571F; 20 &#x5E74;&#x7684;&#x5F00;&#x6E90;&#x7A7A;&#x767D;&#x4E4B;&#x540E;&#xFF0C;&#x7EC8;&#x4E8E;&#x8FD8;&#x662F;&#x6709;&#x4E00;&#x4E9B;&#x811A;&#x8E0F;&#x5B9E;&#x5730;&#x7684;&#x52A1;&#x5B9E;&#x8005;&#xFF0C;&#x6309;&#x7167;&#x56FD;&#x9645;&#x5316;&#x7684;&#x65B9;&#x5F0F;&#x8FD0;&#x4F5C;&#x7740;&#x9879;&#x76EE;&#xFF0C;&#x867D;&#x7136;&#x529B;&#x91CF;&#x4ECD;&#x663E;&#x5355;&#x8584;&#xFF0C;&#x4F46;&#x7EC8;&#x7A76;&#x662F;&#x4E00;&#x4E2A;&#x826F;&#x597D;&#x7684;&#x5F00;&#x7AEF;&#xFF01;</p>
<blockquote>
<p><strong>&#x95EE;&#x9898;&#xFF1A;&#x4F60;&#x77E5;&#x9053;&#x672C;&#x571F;&#x7684;&#x8FD9;&#x4E9B;&#x5728;&#x56FD;&#x9645;&#x4E0A;&#x9887;&#x6709;&#x540D;&#x8A89;&#x7684;&#x9879;&#x76EE;&#x90FD;&#x6709;&#x54EA;&#x4E9B;&#x5417;&#xFF1F;&#x53D1;&#x751F;&#x7684;&#x65F6;&#x95F4;&#x53C8;&#x5206;&#x522B;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;</strong></p>
</blockquote>
<p><strong>&#x5F00;&#x6E90;&#x662F;&#x4E2D;&#x7ACB;&#x7684;&#x6CBB;&#x7406;&#x6A21;&#x5F0F;</strong></p>
<p>&#x4F60;&#x80FD;&#x60F3;&#x8C61;&#x6CA1;&#x6709;&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#x57FA;&#x91D1;&#x4F1A;&#x7684;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x4F1A;&#x662F;&#x4EC0;&#x4E48;&#x6837;&#x5B50;&#x5417;&#xFF1F;</p>
<p>Nathen Harvey &#x5728; Information Week &#x4E2D;&#x7684;&#x6587;&#x7AE0;&#x4E2D;&#x6307;&#x51FA;&#x4E86;&#x4E09;&#x4E2A;&#x95EE;&#x9898;&#xFF1A; &#x201C;<strong>&#x9879;&#x76EE;&#x5E94;&#x8BE5;&#x7531;&#x5546;&#x4E1A;&#x7684;&#x8D5E;&#x52A9;&#x5546;&#x9A71;&#x52A8;&#x8FD8;&#x662F;&#x5916;&#x56F4;&#x7684;&#x8D21;&#x732E;&#x8005;&#x9A71;&#x52A8;&#xFF1F;&#x5546;&#x4E1A;&#x5229;&#x76CA;&#x662F;&#x5426;&#x5E94;&#x8BE5;&#x51CC;&#x9A7E;&#x4E8E;&#x793E;&#x533A;&#x7684;&#x610F;&#x613F;&#x4E4B;&#x4E0A;&#xFF1F;&#x8BE5;&#x5982;&#x4F55;&#x4EE5;&#x53CA;&#x5728;&#x54EA;&#x91CC;&#x4E3A;&#x5546;&#x4E1A;&#x5B9E;&#x4F53;&#x548C;&#x5F00;&#x6E90;&#x793E;&#x533A;&#x4E4B;&#x95F4;&#x5212;&#x4E0A;&#x4E00;&#x4E2A;&#x660E;&#x786E;&#x7684;&#x754C;&#x7EBF;&#xFF1F;</strong>&#x201D;&#x4F5C;&#x4E3A;&#x4E2D;&#x7ACB;&#x7684;&#x57FA;&#x91D1;&#x4F1A;&#x53EF;&#x80FD;&#x662F;&#x552F;&#x4E00;&#x5E73;&#x8861;&#x6B64;&#x95EE;&#x9898;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5728;&#x534F;&#x5546;&#x3001;&#x59A5;&#x534F;&#x3001;&#x4E89;&#x8BBA;&#x7B49;&#x7B49;&#x4E4B;&#x4E0A;&#x8BA9;&#x8F6F;&#x4EF6;&#x53D7;&#x76CA;&#x4E8E;&#x6240;&#x6709;&#x4EBA;&#x3002;</p>
<blockquote>
<p><strong>&#x7136;&#x800C;&#x95EE;&#x9898;&#x6765;&#x4E86;&#xFF1A;&#x90A3;&#x4E9B;&#x4E2A;&#x5F00;&#x6E90;&#x7684;&#x8F6F;&#x4EF6;&#x4F1A;&#x662F;&#x5982;&#x4F55;&#x8FD0;&#x8F6C;&#x7684;&#xFF1F;&#x575A;&#x5B88;&#x7684;&#x7406;&#x5FF5;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x53C8;&#x662F;&#x5982;&#x4F55;&#x5E73;&#x8861;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x548C;&#x5546;&#x4E1A;&#x5229;&#x76CA;&#x7684;&#xFF1F;</strong></p>
</blockquote>
<p><strong>&#x5F00;&#x6E90;&#x662F;&#x4F01;&#x4E1A;&#x751F;&#x6001;&#x6218;&#x7565;</strong></p>
<p>2007 &#x5E74;&#xFF0C;Google &#x51B3;&#x5B9A;&#x5F00;&#x6E90;&#x5DF2;&#x7ECF;&#x82B1;&#x4E86;&#x51E0;&#x4EBF;&#x7F8E;&#x91D1;&#x7684; Android &#x667A;&#x80FD;&#x624B;&#x673A;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF0C;&#x5E0C;&#x671B;&#x76F4;&#x63A5;&#x548C; Apple&#x3001;Nokia&#x3001;Blackberry &#x5C55;&#x5F00;&#x7ADE;&#x4E89;&#xFF0C;&#x73B0;&#x5728;&#x6839;&#x636E; Linux &#x5B98;&#x65B9;&#x7ED9;&#x51FA;&#x7684;&#x6570;&#x636E;&#xFF0C;80&#xFF05; &#x4EE5;&#x4E0A;&#x7684;&#x667A;&#x80FD;&#x624B;&#x673A;&#x8FD0;&#x884C; Android&#xFF08;&#x57FA;&#x4E8E; Linux &#x5185;&#x6838;&#xFF09;&#xFF0C;&#x4F3C;&#x4E4E; 2015 &#x5E74;&#x5F00;&#x6E90;&#x7684; Kubernetes &#x8981;&#x5360;&#x9886;&#x540C;&#x6837;&#x6570;&#x5B57;&#x7684;&#x5E02;&#x573A;&#xFF0C;&#x5728;&#x4E91;&#x539F;&#x751F;&#x7684;&#x5E02;&#x573A;&#xFF0C;&#x8FD0;&#x884C; Kubernetes &#x7684;&#x670D;&#x52A1;&#x51E0;&#x4E4E;&#x5360;&#x9886;&#x4E86;&#x5BB9;&#x5668;&#x8C03;&#x5EA6;&#x7F16;&#x6392;&#x7CFB;&#x7EDF;&#x7684;&#x5168;&#x90E8;&#x4EFD;&#x989D;&#x3002;</p>
<blockquote>
<p><strong>&#x8FD9;&#x5176;&#x4E2D;&#x7A76;&#x7ADF;&#x8574;&#x85CF;&#x7740;&#x600E;&#x6837;&#x7684;&#x7384;&#x673A;&#xFF1F;&#x62E5;&#x62B1;&#x5F00;&#x653E;&#x662F;&#x5426;&#x4E00;&#x5B9A;&#x5C31;&#x80FD;&#x6210;&#x529F;&#xFF1F;&#x505A;&#x751F;&#x6001;&#x4E4B;&#x524D;&#x8981;&#x505A;&#x4E9B;&#x4EC0;&#x4E48;&#xFF1F;</strong></p>
</blockquote>
<p><strong>&#x5176;&#x5B83;</strong></p>
<p>&#x5F00;&#x6E90;&#x662F;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#xFF0C;&#x5F00;&#x6E90;&#x662F;&#x6587;&#x5316;&#x73B0;&#x8C61;&#xFF0C;&#x5F00;&#x6E90;&#x662F;&#x5C0A;&#x91CD;&#x77E5;&#x8BC6;&#x4EA7;&#x6743;&#xFF0C;&#x5F00;&#x6E90;&#x662F;&#x5E02;&#x573A;&#x8425;&#x9500;&#xFF0C;&#x5F00;&#x6E90;&#x662F;&#x5546;&#x4E1A;&#x6A21;&#x5F0F;......&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x5C1A;&#x5F85;&#x6211;&#x4EEC;&#x6316;&#x6398;&#x7684;&#x4E3B;&#x9898;&#xFF0C;&#x5F00;&#x6E90;&#x7531;&#x4E9A;&#x6587;&#x5316;&#xFF0C;&#x53D1;&#x5C55;&#x6210;&#x4E3A;&#x4E3B;&#x6D41;&#x6587;&#x5316;&#xFF0C;&#x6210;&#x5F62;&#x7684;&#x7406;&#x8BBA;&#x8FD8;&#x51E0;&#x4E4E;&#x662F;&#x7A7A;&#x767D;&#xFF0C;&#x5C1A;&#x9700;&#x66F4;&#x591A;&#x7684;&#x4EBA;&#x6765;&#x53C2;&#x4E0E;&#xFF0C;&#x4EE5;&#x79D1;&#x5B66;&#x7684;&#x89C6;&#x91CE;&#x6765;&#x5F7B;&#x5E95;&#x8BE0;&#x91CA;&#x8FD9;&#x4E00;&#x4E3B;&#x9898;&#x3002;</p>
<p><strong>&#x8C03;&#x67E5;&#x4E0E;&#x6D1E;&#x89C1;</strong></p>
<p>&#x9274;&#x4E8E;&#x4EE5;&#x4E0A;&#x201D;&#x7531;&#x9690;&#x800C;&#x663E;&#x201C;&#x7684;&#x5404;&#x79CD;&#x95EE;&#x9898;&#xFF0C;&#x5F00;&#x6E90;&#x793E;&#x7EC4;&#x7EC7;&#x4E86;&#x300A;2018 &#x5F00;&#x6E90;&#x5E74;&#x5EA6;&#x62A5;&#x544A;&#x300B;&#x8C03;&#x67E5;&#xFF0C;&#x4ECE;&#x591A;&#x79CD;&#x7EAC;&#x5EA6;&#x3001;&#x591A;&#x79CD;&#x65B9;&#x5F0F;&#x3001;&#x591A;&#x79CD;&#x534F;&#x4F5C;&#x6765;&#x5C1D;&#x8BD5;&#x9760;&#x8FD1;&#x4E0A;&#x8FF0;&#x95EE;&#x9898;&#x7684;&#x7B54;&#x6848;&#x3002;</p>
<blockquote>
<p>&#x8C03;&#x67E5;&#x7814;&#x7A76;&#x662F;&#x8C0B;&#x4E8B;&#x4E4B;&#x57FA;&#x3001;&#x6210;&#x4E8B;&#x4E4B;&#x9053;&#x3002;&#x6CA1;&#x6709;&#x8C03;&#x67E5;&#xFF0C;&#x5C31;&#x6CA1;&#x6709;&#x53D1;&#x8A00;&#x6743;&#xFF0C;&#x66F4;&#x6CA1;&#x6709;&#x51B3;&#x7B56;&#x6743;&#x3002;</p>
<p>&#x2014;&#x2014;&#x4E60;&#x8FD1;&#x5E73;&#x603B;&#x4E66;&#x8BB0;</p>
</blockquote>
<p><strong>&#x4E00;&#x3001;&#x8C03;&#x67E5;&#x4E4B;&#x95EE;&#x5377;&#x7BC7;</strong></p>
<p><strong>&#x4E2D;&#x56FD;&#x5F00;&#x6E90;&#x53C2;&#x4E0E;&#x8C03;&#x67E5;&#x62A5;&#x544A;</strong></p>
<p>&#x672C;&#x6B21;&#x8C03;&#x67E5;&#x95EE;&#x5377;&#x4EE5;&#x5F00;&#x6E90;&#x793E;&#x533A;&#x534F;&#x4F5C;&#x7684;&#x65B9;&#x5F0F;&#x5171;&#x540C;&#x5B8C;&#x6210;&#xFF0C;&#x4EE5;&#x8349;&#x6839;&#x7684;&#x65B9;&#x5F0F;&#x81EA;&#x5E95;&#x5411;&#x4E0A;&#x5B8C;&#x6210;&#x3002;&#x6839;&#x636E;&#x95EE;&#x5377;&#x8C03;&#x67E5;&#x641C;&#x96C6;&#x7ED3;&#x679C;&#xFF0C;&#x5BF9;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x6E05;&#x7406;&#xFF0C; &#x4EA4;&#x53C9;&#x6BD4;&#x5BF9;&#x4E4B;&#x540E;&#xFF0C;&#x4EE5;&#x6570;&#x636E;&#xFF0C;&#x56FE;&#x8868;&#x7684;&#x5F62;&#x5F0F;&#x5BA2;&#x89C2;&#x7684;&#x5448;&#x73B0;&#x7ED9;&#x5927;&#x5BB6;&#xFF0C;&#x540C;&#x65F6;&#x9080;&#x8BF7;&#x4E86;&#x5F00;&#x6E90;&#x793E;&#x533A;&#x91CC;&#x7684;&#x4E13;&#x5BB6;&#x5BF9;&#x7ED3;&#x679C;&#x8FDB;&#x884C;&#x70B9;&#x8BC4;&#xFF0C;&#x5206;&#x6790;&#x548C;&#x9884;&#x6D4B;&#x3002;</p>
<p><strong>&#x4E8C;&#x3001;&#x4EE5;&#x6570;&#x636E;&#x4E8B;&#x5B9E;&#x6765;&#x5448;&#x73B0;</strong></p>
<p><strong>&#x6307;&#x5357;&#x9488;&#x7BC7;</strong></p>
<p>&#x6307;&#x5357;&#x9488;&#x9879;&#x76EE;&#x5C31;&#x662F;&#x4E3A;&#x4E86;&#x8BA9;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5728;&#x5BFB;&#x627E;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x65B9;&#x4FBF;&#x3001;&#x5FEB;&#x901F;&#x3001;&#x51C6;&#x786E;&#x627E;&#x5230;&#x5408;&#x9002;&#x7684;&#x9879;&#x76EE;&#xFF0C;&#x5982;&#x540C;&#x5728;&#x4E00;&#x5927;&#x7247;&#x5F00;&#x6E90;&#x7684;&#x5927;&#x6D77;&#x4E2D;&#x6709;&#x4E00;&#x4E2A;&#x6307;&#x5357;&#x9488;&#x6307;&#x5F15;&#x524D;&#x884C;&#x3002;</p>
<p>&#x6307;&#x5357;&#x9488;&#x7684;&#x4E09;&#x4E2A;&#x9636;&#x6BB5;&#xFF1A;</p>
<ul>
<li>&#x7B2C;&#x4E00;&#x9636;&#x6BB5;&#xFF0C;&#x9488;&#x5BF9;&#x9879;&#x76EE;&#x5BF9;&#x5E94;&#x5176;&#x4E2D;&#x7684;&#x5185;&#x5BB9;&#x505A;&#x6570;&#x636E;&#x5206;&#x6790;&#xFF0C;&#x9879;&#x76EE;&#x7684;&#x9759;&#x6001;&#x6570;&#x636E;&#x90FD;&#x6210;&#x4E3A;&#x53EF;&#x4EE5;&#x641C;&#x5BFB;&#x548C;&#x63A8;&#x8350;&#x7684;&#x4F9D;&#x636E;&#x548C;&#x663E;&#x793A;&#x7684;&#x5185;&#x5BB9;&#xFF1B;</li>
<li>&#x7B2C;&#x4E8C;&#x9636;&#x6BB5;&#xFF0C; &#x4EE5;&#x9879;&#x76EE;&#x548C;&#x8D21;&#x732E;&#x8005;&#x7684;&#x8FDE;&#x63A5;&#x7684;&#x56FE;&#x50CF;&#x5448;&#x73B0;&#x65B9;&#x5F0F;&#xFF0C;&#x8BA9;&#x4F7F;&#x7528;&#x8005;&#x66F4;&#x76F4;&#x89C2;&#x7684;&#x53D1;&#x73B0;&#x9879;&#x76EE;&#x548C;&#x9879;&#x76EE;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x900F;&#x8FC7;&#x9879;&#x76EE;&#x548C;&#x4EBA;&#x7684;&#x5173;&#x7CFB;&#x5BF9;&#x6574;&#x4E2A;&#x5F00;&#x6E90;&#x793E;&#x533A;&#x8FDB;&#x884C;&#x4E86;&#x89E3;&#x3002;</li>
<li>&#x7B2C;&#x4E09;&#x9636;&#x6BB5;&#xFF0C;&#x5BF9;&#x9879;&#x76EE;&#x7684;&#x4EE3;&#x7801;&#x672C;&#x8EAB;&#x505A;&#x66F4;&#x6DF1;&#x5EA6;&#x7684;&#x5206;&#x6790;&#x3002;</li>
</ul>
<p>&#x8C03;&#x67E5;&#x65B9;&#x6CD5;&#x8BBA;&#xFF1A;</p>
<ul>
<li>&#x4F7F;&#x7528;&#x7F51;&#x7EDC;&#x722C;&#x866B;&#x4E0E; API &#x83B7;&#x53D6;&#x5F00;&#x6E90;&#x4EE3;&#x7801;&#x5E93;&#x7684;&#x6570;&#x636E;&#x5982;&#x539F;&#x4EE3;&#x7801;&#x3001;&#x9879;&#x76EE;&#x4FE1;&#x606F;</li>
<li>&#x5C06;&#x9879;&#x76EE;&#x7684;&#x9759;&#x6001;&#x4FE1;&#x606F;&#x5982;&#x9879;&#x76EE;&#x540D;&#x79F0;&#x3001;&#x8D77;&#x59CB;&#x65E5;&#x671F;&#x7B49;&#x4E0E;&#x52A8;&#x6001;&#x4FE1;&#x606F;&#x5982;&#x9879;&#x76EE;&#x4E0B;&#x8F7D;&#x6B21;&#x6570;&#x3001;&#x5BA2;&#x6237;&#x559C;&#x7231;&#x7A0B;&#x5EA6;&#x7B49;&#x50A8;&#x5B58;&#x5728;&#x6570;&#x636E;&#x7ED3;&#x6784;</li>
<li>&#x5904;&#x7406;&#x539F;&#x59CB;&#x6570;&#x636E;&#x4E0E;&#x7ED3;&#x6784;&#x5316;&#x7684;&#x5355;&#x5143;&#xFF0C;&#x751F;&#x6210;&#x5982;&#x5206;&#x7C7B;&#x3001;&#x7EDF;&#x8BA1;&#x3001;&#x6392;&#x5E8F;&#x3001;&#x6807;&#x7B7E;&#x7B49;&#x603B;&#x548C;&#x6570;&#x636E;&#x3002;</li>
<li>&#x4F7F;&#x7528;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x3001;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x5904;&#x7406;&#x3001;&#x6570;&#x636E;&#x5206;&#x6790;&#x7B49;&#x6280;&#x672F;&#xFF0C;&#x7EFC;&#x5408;&#x6240;&#x6709;&#x6570;&#x636E;&#x63D0;&#x4F9B;&#x5982;&#x5206;&#x7C7B;&#x3001;&#x641C;&#x7D22;&#x3001;&#x63A8;&#x8350;&#x3001;&#x8BC4;&#x6BD4;&#x7B49;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x3002;</li>
</ul>
<p><strong>Grank&#x7BC7;</strong></p>
<p>Grank &#x662F;&#x53E6;&#x5916;&#x4E00;&#x79CD;&#x4EE5; GitHub &#x6570;&#x636E;&#x4E3A;&#x57FA;&#x7840;&#xFF0C;&#x6309;&#x7167;&#x8BBE;&#x5B9A;&#x65B9;&#x6CD5;&#x8FDB;&#x884C;&#x91C7;&#x96C6;&#x3001;&#x805A;&#x7C7B;&#x3001;&#x5206;&#x6790;&#x7684;&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#x8BC4;&#x4F30;&#x7684;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#xFF08;<a href="https://github.com/LCTT/Grank/" target="_blank">https://github.com/LCTT/Grank/</a>&#xFF09;&#x3002;&#x5B83;&#x63D0;&#x4F9B;&#x4E86;&#x89C2;&#x5BDF;&#x6E90;&#x4E8E;&#x4E2D;&#x56FD;&#x7684;&#x6216;&#x4EE5;&#x4E2D;&#x56FD;&#x8D21;&#x732E;&#x8005;&#x4E3A;&#x4E3B;&#x7684;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x53D1;&#x5C55;&#x7684;&#x7684;&#x53E6;&#x5916;&#x4E00;&#x79CD;&#x6570;&#x636E;&#x89C6;&#x89D2;&#x3002;Grank &#x4E0D;&#x4EC5;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x7EFC;&#x5408;&#x8BC4;&#x4F30;&#x4E00;&#x4E2A;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x7684;&#x6D3B;&#x8DC3;&#x5EA6;&#x3001;&#x793E;&#x533A;&#x5316;&#x7A0B;&#x5EA6;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x7531;&#x6B64;&#x53CD;&#x5C04;&#x51FA;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x80CC;&#x540E;&#x7684;&#x4F01;&#x4E1A;&#x3001;&#x7EC4;&#x7EC7;&#x5728;&#x5F00;&#x6E90;&#x65B9;&#x9762;&#x7684;&#x5B9E;&#x8D28;&#x6027;&#x6295;&#x5165;&#x7A0B;&#x5EA6;&#x3002;</p>
<p><strong>&#x4E09;&#x3001;&#x6D1E;&#x5BDF;&#x7BC7;</strong></p>
<p>&#x901A;&#x8FC7;&#x5F00;&#x6E90;&#x793E;&#x7684;&#x5F00;&#x6E90;&#x4E13;&#x5BB6;&#x59D4;&#x5458;&#x4F1A;&#x3001;&#x5F00;&#x6E90;&#x4E13;&#x5BB6;&#x3001;&#x4E1A;&#x5185;&#x89C2;&#x5BDF;&#x8005;&#x7684;&#x591A;&#x5E74;&#x7D2F;&#x79EF;&#xFF0C;&#x518D;&#x6839;&#x636E;&#x4ECA;&#x5E74;&#x7684;&#x52A8;&#x5411;&#xFF0C;&#x4E3A;&#x5927;&#x5BB6;&#x5448;&#x73B0;&#x5177;&#x6709;&#x4E1A;&#x5185;&#x5148;&#x8FDB;&#x6D1E;&#x89C1;&#x7684;&#x5206;&#x6790;&#x62A5;&#x544A;&#x3002;</p>
<p><strong>&#x5C0F;&#x7ED3;</strong></p>
<p>&#x6B63;&#x5982;&#x672C;&#x6587;&#x5F00;&#x7BC7;&#x6240;&#x8A00;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x8C03;&#x67E5;&#x9650;&#x4E8E;&#x8D44;&#x6E90;&#xFF0C;&#x53EA;&#x80FD;&#x8BF4;&#x662F;&#x7AA5;&#x89C6;&#x51B0;&#x5C71;&#x4E00;&#x89D2;&#xFF0C;&#x6709;&#x5F88;&#x591A;&#x5C1A;&#x5F85;&#x4EE5;&#x4E8B;&#x5B9E;&#x8C03;&#x67E5;&#x7ED3;&#x679C;&#x4E3A;&#x4F9D;&#x636E;&#xFF0C;&#x8FDB;&#x800C;&#x7834;&#x89E3;&#x5404;&#x79CD;&#x73B0;&#x8C61;&#xFF0C;&#x4EE5;&#x53CA;&#x4EE4;&#x4F17;&#x4EBA;&#x7591;&#x60D1;&#x7684;&#x8C1C;&#x9898;&#x3002;&#x8FD9;&#x53EA;&#x662F;&#x6211;&#x4EEC;&#x7684;&#x7B2C;&#x4E00;&#x6B65;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x957F;&#x4E45;&#x7684;&#x8DDF;&#x8E2A;&#x4E0B;&#x53BB;&#xFF0C;&#x4E5F;&#x5E0C;&#x671B;&#x80FD;&#x591F;&#x5438;&#x5F15;&#x66F4;&#x591A;&#x4EBA;&#x7684;&#x53C2;&#x4E0E;&#xFF01;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                
                <a href="chapter-questionnaire.html" class="navigation navigation-next navigation-unique" aria-label="Next page: 问卷篇">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"引言","level":"1.1","depth":1,"next":{"title":"问卷篇","level":"1.2","depth":1,"path":"chapter-questionnaire.md","ref":"chapter-questionnaire.md","articles":[]},"dir":"ltr"},"config":{"plugins":[],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"开源社","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"2018中国开源年度报告","gitbook":"*","description":"2018中国开源年度报告"},"file":{"path":"README.md","mtime":"2019-11-20T04:45:48.192Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-11-20T04:48:12.409Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

