
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>指南针篇 · 2018中国开源年度报告</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="开源社">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="grank.html" />
    
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    引言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../chapter-questionnaire.html">
            
                <a href="../chapter-questionnaire.html">
            
                    
                    问卷篇
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" >
            
                <span>
            
                    
                    数据篇
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.3.1" data-path="compass.html">
            
                <a href="compass.html">
            
                    
                    指南针篇
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="grank.html">
            
                <a href="grank.html">
            
                    
                    Grank篇
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../chapter-insight.html">
            
                <a href="../chapter-insight.html">
            
                    
                    洞察篇
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="../chapter-epilogue.html">
            
                <a href="../chapter-epilogue.html">
            
                    
                    结语
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >指南针篇</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h4 id="21-&#x6307;&#x5357;&#x9488;&#x7BC7;"><strong>2.1 &#x6307;&#x5357;&#x9488;&#x7BC7;</strong></h4>
<p>&#x6307;&#x5357;&#x9488;&#x56E2;&#x961F;&#x4F7F;&#x7528;&#x7F51;&#x7EDC;&#x722C;&#x866B;&#x4E0E; GitHub &#x6570;&#x636E; API &#x83B7;&#x53D6;&#x5F00;&#x6E90;&#x4EE3;&#x7801;&#x5E93;&#x7684;&#x6570;&#x636E;&#x5982;&#x539F;&#x4EE3;&#x7801;&#x3001;&#x9879;&#x76EE;&#x4FE1;&#x606F;&#x3001;&#x9879;&#x76EE;&#x7684;&#x9759;&#x6001;&#x4FE1;&#x606F;&#x5982;&#x9879;&#x76EE;&#x540D;&#x79F0;&#x3001;&#x8D77;&#x59CB;&#x65E5;&#x671F;&#x7B49;&#x3001;&#x4E0E;&#x52A8;&#x6001;&#x4FE1;&#x606F;&#x5982;fork&#x6570;&#x3001;&#x5BA2;&#x6237;&#x7ED9;&#x4E0E;&#x7684;&#x661F;&#x6570;&#x7B49;&#x4F17;&#x591A;&#x9879;&#x76EE;&#x76F8;&#x5173;&#x7684;&#x4FE1;&#x606F;&#x50A8;&#x5B58;&#x5728;&#x672C;&#x5730;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4E2D;&#x3002;&#x7B2C;&#x4E00;&#x9636;&#x6BB5;&#x662F;&#x5904;&#x7406;&#x539F;&#x59CB;&#x6570;&#x636E;&#x4E0E;&#x7ED3;&#x6784;&#x5316;&#x7684;&#x5355;&#x5143;&#xFF0C;&#x751F;&#x6210;&#x5982;&#x6392;&#x5E8F;&#x3001;&#x6807;&#x7B7E;&#x7B49;&#x603B;&#x548C;&#x6570;&#x636E;&#xFF0C;&#x5982;&#x6B64;&#x53EF;&#x4EE5;&#x900F;&#x8FC7;&#x5982;&#x6392;&#x540D;&#x3001;&#x7EDF;&#x8BA1;&#x7B49;&#x4FE1;&#x606F;&#x7684;&#x63D0;&#x4F9B;&#x3002;</p>
<p>&#x4F7F;&#x7528;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x3001;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x5904;&#x7406;&#x3001;&#x6570;&#x636E;&#x5206;&#x6790;&#x7B49;&#x6280;&#x672F;&#xFF0C;&#x7EFC;&#x5408;&#x6240;&#x6709;&#x6570;&#x636E;&#x63D0;&#x4F9B;&#x5982;&#x5206;&#x7C7B;&#x3001;&#x641C;&#x7D22;&#x3001;&#x63A8;&#x8350;&#x3001;&#x8BC4;&#x6BD4;&#x7B49;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x3002;</p>
<p>&#x53E6;&#x5916;&#x8FD0;&#x7528;&#x56FE;&#x50CF;&#x6570;&#x636E;&#x5E93;&#x7684;&#x5173;&#x8054;&#x6280;&#x672F;&#xFF0C;&#x5BF9;&#x4E8E;&#x9AD8;&#x7EF4;&#x5EA6;&#x667A;&#x80FD;&#x7684;&#x8FDE;&#x63A5;&#x548C;&#x67E5;&#x8BE2;&#x3001;&#x4EE5;&#x4EA4;&#x4E92;&#x65B9;&#x5F0F;&#x7684;&#x53EF;&#x89C6;&#x5316;&#x7684;&#x63D0;&#x4F9B;&#x66F4;&#x590D;&#x6742;&#x7684;&#x5173;&#x8054;&#x5448;&#x73B0;&#x3002;</p>
<p><strong>&#x5F00;&#x6E90;@&#x4E2D;&#x56FD;</strong></p>
<p><img src="https://images.gitbook.cn/ba6c1f90-d415-11e8-80d1-917ffa8847fa" alt="enter image description here"></p>
<p>&#x5982;&#x540C;&#x4E16;&#x754C;&#x5404;&#x5730;&#x7684;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x548C;&#x5404;&#x79CD;&#x4F01;&#x4E1A;&#xFF0C;&#x4E2D;&#x56FD;&#x4E5F;&#x7ECF;&#x5386;&#x4E86;&#x5BF9;&#x4E8E;&#x5F00;&#x6E90;&#x7684;&#x65E0;&#x611F;&#x3001;&#x62B5;&#x5236;&#x3001;&#x6000;&#x7591;&#x3001;&#x89C2;&#x671B;&#x3001;&#x5C1D;&#x8BD5;&#x3001;&#x63A5;&#x53D7;&#x3001;&#x4EE5;&#x81F3;&#x4E8E;&#x8BA4;&#x53EF;&#x5230;&#x652F;&#x6301;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x4E2D;&#x56FD;&#x5728;&#x5F00;&#x6E90;&#x793E;&#x533A;&#x7684;&#x8D21;&#x732E;&#x4E0E;&#x5F71;&#x54CD;&#x529B;&#xFF0C;&#x65E0;&#x8BBA;&#x5728;&#x6570;&#x91CF;&#x4E0E;&#x54C1;&#x8D28;&#x3001;&#x6DF1;&#x5EA6;&#x4E0E;&#x5E7F;&#x5EA6;&#x90FD;&#x9010;&#x5E74;&#x7684;&#x6269;&#x5927;&#x4E0E;&#x6500;&#x5347;&#x3002;</p>
<p>Google &#x4EE5;&#x521B;&#x65B0;&#x7684;&#x5F62;&#x8C61;&#x6DF1;&#x690D;&#x5728;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x7684;&#x5FC3;&#x4E2D;&#xFF0C;&#x5BF9;&#x5F00;&#x6E90;&#x7684;&#x8D21;&#x732E;&#x4F8B;&#x5982;&#x5728;&#x5927;&#x6570;&#x636E;&#xFF08;Hadoop&#x3001;HDFS &#x7B49;&#xFF09;&#x3001;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#xFF08;&#x5982; TensorFlow&#xFF09;&#x90FD;&#x662F;&#x6709;&#x76EE;&#x5171;&#x7779;&#x3002;Microsoft &#x4F5C;&#x4E3A;&#x5F00;&#x6E90;&#x7684;&#x540E;&#x8D77;&#x4E4B;&#x79C0;&#xFF0C;&#x6295;&#x5165;&#x7684;&#x8D44;&#x6E90;&#x548C;&#x8FD1;&#x671F;&#x7684;&#x58F0;&#x52BF;&#x90FD;&#x5F00;&#x59CB;&#x53D7;&#x5230;&#x8BA4;&#x53EF;&#x3002;&#x5728; 2018 &#x5E74;&#x6536;&#x8D2D; GitHub &#x4E5F;&#x4E3A;&#x5176;&#x6295;&#x5165;&#x4E0E;&#x652F;&#x6301;&#x5F00;&#x6E90;&#x7684;&#x51B3;&#x5FC3;&#x66F4;&#x4E3A;&#x51F8;&#x663E;&#x3002;RedHat &#x5728;&#x5F00;&#x6E90;&#x793E;&#x533A;&#x7684;&#x5386;&#x53F2;&#x60A0;&#x4E45;&#xFF0C;&#x8D21;&#x732E;&#x548C;&#x79EF;&#x7D2F;&#x4E30;&#x5BCC;&#xFF0C;&#x957F;&#x671F;&#x5728;&#x6392;&#x884C;&#x699C;&#x4E2D;&#x5C45;&#x91CD;&#x8981;&#x5730;&#x4F4D;&#x3002;BAT &#x4E0E;&#x534E;&#x4E3A;&#x65E0;&#x8BBA;&#x5728;&#x8D44;&#x6E90;&#x7684;&#x6295;&#x5165;&#x6BD4;&#x4F8B;&#x548C;&#x5F00;&#x6E90;&#x7684;&#x63A8;&#x52A8;&#x529B;&#x5EA6;&#x5728;&#x8FD1;&#x5E74;&#x6709;&#x660E;&#x663E;&#x589E;&#x52A0;&#xFF0C;&#x6240;&#x4EE5;&#x5728; GitHub &#x6392;&#x540D;&#x6709;&#x4E0A;&#x5347;&#x7684;&#x8D8B;&#x52BF;&#x3002;</p>
<p><img src="https://images.gitbook.cn/cd284410-d415-11e8-80d1-917ffa8847fa" alt="enter image description here"></p>
<p>&#x4EE5; Python &#x7684;&#x5F00;&#x53D1;&#x8005;&#x6570;&#x91CF;&#x4E3A;&#x4F8B;&#xFF0C;2017 &#x5E74;&#x4E2D;&#x56FD;&#x5DF2;&#x4F4D;&#x5C45;&#x7B2C; 3 &#x540D;&#xFF0C;&#x5DF2;&#x7ECF;&#x5FAE;&#x5E45;&#x9886;&#x5148;&#x5982;&#x82F1;&#x56FD;&#x3001;&#x5FB7;&#x56FD;&#x3001;&#x6CD5;&#x56FD;&#x7B49;&#x6B27;&#x6D32;&#x4F20;&#x7EDF; IT &#x5F3A;&#x56FD;&#x3002;</p>
<p><img src="https://images.gitbook.cn/dc225780-d415-11e8-80d1-917ffa8847fa" alt="enter image description here"></p>
<p>&#x4EE5; repo &#x6570;&#x91CF;&#x548C;&#x5F00;&#x53D1;&#x8005;&#x6570;&#x91CF;&#x7684;&#x603B;&#x548C;&#x8BC4;&#x6BD4;&#xFF0C;2018 &#x5E74;&#x7F8E;&#x56FD;&#x4ECD;&#x7136;&#x7EE7;&#x7EED;&#x5E9E;&#x5927;&#x7684;&#x4F18;&#x52BF;&#x9886;&#x5148;&#x7FA4;&#x96C4;&#x3002;&#x5FB7;&#x56FD;&#x82F1;&#x56FD;&#x5360;&#x636E;&#x4E8C;&#x4E09;&#x540D;&#x3002;&#x4E2D;&#x56FD;&#x4F5C;&#x4E3A;&#x65B0;&#x8D77;&#x4E4B;&#x79C0;&#x6210;&#x4E3A;&#x4E9A;&#x6D32;&#x7B2C;&#x4E00;&#xFF0C;&#x5168;&#x7403;&#x7B2C;&#x56DB;&#x3002;</p>
<p><strong>2017 &#x56DE;&#x987E; Forbes: 7 Technology Trends to dominate 2017</strong></p>
<ol>
<li><strong>IoT and Smart Home Tech</strong></li>
<li><strong>AR and VR</strong></li>
<li><strong>Machine Learning</strong></li>
<li><strong>Automation</strong></li>
<li><strong>Humanized Big Data</strong></li>
<li><strong>Physical-Digital Integrations</strong></li>
<li><strong>Everything On-Demand</strong></li>
</ol>
<p>&#x8FD9;&#x662F; Forbes &#x6742;&#x5FD7;&#x5728; 2017 &#x4ECE;&#x6BD4;&#x8F83;&#x5546;&#x4E1A;&#x7684;&#x89D2;&#x5EA6;&#x9884;&#x6D4B;&#x4FE1;&#x606F;&#x6280;&#x672F;&#x7684;&#x8D8B;&#x52BF;&#x3002;&#x8BF4;&#x660E;&#x4E86;&#x6BD4;&#x8F83;&#x5E7F;&#x6CDB;&#x7684;&#x8D8B;&#x52BF;&#xFF0C;&#x6BCF;&#x4E2A;&#x9879;&#x76EE;&#x90FD;&#x662F;&#x4FE1;&#x606F;&#x6280;&#x672F;&#x975E;&#x5E38;&#x5DE8;&#x5927;&#x7684;&#x8BFE;&#x9898;&#xFF0C;&#x5305;&#x542B;&#x7269;&#x8054;&#x7F51;&#x3001;AR&#x3001;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x3001;&#x4ECE;&#x4EBA;&#x7684;&#x89D2;&#x5EA6;&#x770B;&#x5230;&#x7684;&#x5927;&#x6570;&#x636E;&#xFF0C;&#x4E91;&#x8BA1;&#x7B97;&#x7684;&#x6269;&#x5145;&#xFF0C;&#x5B9E;&#x4F53;&#x548C;&#x6570;&#x5B57;&#x5316;&#x7684;&#x96C6;&#x6210;&#x3002;</p>
<p>Gartner &#x5BF9; 2017 &#x4FE1;&#x606F;&#x6280;&#x672F;&#x7684;&#x8D8B;&#x52BF;&#x9884;&#x5224;&#xFF1A;</p>
<p><img src="https://images.gitbook.cn/21cdd000-d418-11e8-80d1-917ffa8847fa" alt="enter image description here"></p>
<ul>
<li><strong>Trend No. 1: AI &amp; Advanced Machine Learning</strong></li>
<li><strong>Trend No. 2: Intelligent Apps</strong></li>
<li><strong>Trend No. 3: Intelligent Things</strong></li>
<li><strong>Trend No. 4: Virtual &amp; Augmented Reality</strong></li>
<li><strong>Trend No. 5: Digital Twin</strong></li>
<li><strong>Trend No. 6: Blockchain</strong></li>
<li><strong>Trend No. 7: Conversational Systems</strong></li>
</ul>
<p>Gatner &#x5BF9;&#x4E8E;&#x4FE1;&#x606F;&#x6280;&#x672F;&#x7684;&#x9884;&#x6D4B;&#x6BD4;&#x8F83;&#x6DF1;&#x5165;&#xFF0C;&#x5176;&#x4E2D;&#x7B2C;&#x4E00;&#x7C7B;&#x662F;&#x4EE5;&#x667A;&#x80FD;&#x4E3A;&#x4E3B;&#x7684;&#x65B9;&#x5411;&#xFF0C;&#x5305;&#x542B;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x7279;&#x522B;&#x5728;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x8303;&#x7574;&#x662F;&#x503C;&#x5F97;&#x5173;&#x6CE8;&#x3002;&#x624B;&#x673A;App&#x548C;&#x667A;&#x80FD;&#x7684;&#x7ED3;&#x5408;&#xFF0C;&#x5177;&#x6709;&#x667A;&#x80FD;&#x7279;&#x6027;&#x7684;&#x7269;&#x8054;&#x7F51;&#xFF0C;&#x4E5F;&#x662F;&#x4EE4;&#x4EBA;&#x6DF1;&#x7701;&#x7684;&#x65B9;&#x5411;&#x3002;</p>
<p>&#x548C; Forbes &#x540C;&#x6837;&#x9884;&#x6D4B; AR/VR &#x548C;&#x5B9E;&#x4F53;&#x548C;&#x6570;&#x5B57;&#x5316;&#x7684;&#x96C6;&#x6210;&#xFF08;Digital Twin&#xFF09;&#x7684;&#x8D8B;&#x52BF;&#x3002;&#x533A;&#x5757;&#x94FE;&#x7684;&#x8BAE;&#x9898;&#x5F00;&#x59CB;&#x88AB;&#x63D0;&#x51FA;&#x6765;&#x6210;&#x4E3A;&#x5173;&#x6CE8;&#x7684;&#x8D8B;&#x52BF;&#x3002;&#x667A;&#x80FD;&#x673A;&#x5668;&#x4EBA;&#xFF08;Bot&#xFF09;&#x7684;&#x5E94;&#x7528;&#x4EE5;&#x66F4;&#x52A0;&#x5E7F;&#x6CDB;&#x7684;&#x65B9;&#x5F0F;&#x8FDB;&#x5165;&#x4FE1;&#x606F;&#x6280;&#x672F;&#x7684;&#x9886;&#x57DF;&#x3002;</p>
<p><strong>2018 &#x8D8B;&#x52BF;</strong></p>
<p>Gartner &#x5BF9; 2018 &#x4FE1;&#x606F;&#x6280;&#x672F;&#x7684;&#x8D8B;&#x52BF;&#x9884;&#x5224;&#xFF1A;</p>
<p><img src="https://images.gitbook.cn/0b592240-d416-11e8-80d1-917ffa8847fa" alt="enter image description here"></p>
<ul>
<li><strong>Trend No. 1: AI Foundation</strong></li>
<li><strong>Trend No. 2: Intelligent Apps and Analytics</strong></li>
<li><strong>Trend No. 3: Intelligent Things</strong></li>
<li><strong>Trend No. 4: Digital Twins</strong></li>
<li><strong>Trend No. 5: Cloud to the Edge</strong></li>
<li><strong>Trend No. 6: Conversational Platforms</strong></li>
<li><strong>Trend No. 7: Immersive Experience</strong></li>
<li><strong>Trend No. 8: Blockchain</strong></li>
</ul>
<p>Gartner &#x63A5;&#x7EED;&#x524D;&#x4E00;&#x5E74;&#x7684;&#x9884;&#x6D4B;&#xFF0C;&#x628A;&#x667A;&#x80FD;&#x7684;&#x8303;&#x7574;&#x5730;&#x4F4D;&#x5230;&#x4EE5; AI &#x4E3A;&#x57FA;&#x7840;&#x7684;&#x5404;&#x79CD;&#x667A;&#x80FD;&#xFF0C;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x65B9;&#x5411;&#x3002;&#x8FD8;&#x662F;&#x7EE7;&#x7EED;&#x5173;&#x6CE8;&#x624B;&#x673A; App &#x548C;&#x667A;&#x80FD;&#x7684;&#x7ED3;&#x5408;&#x8FD8;&#x6709;&#x5177;&#x6709;&#x667A;&#x80FD;&#x7279;&#x6027;&#x7684;&#x7269;&#x8054;&#x7F51;&#x3002;</p>
<p>&#x53D7;&#x5230;&#x6B27;&#x76DF;&#x5BF9;&#x6570;&#x636E;&#x5B58;&#x653E;&#x7684;&#x9650;&#x5236;&#x548C;&#x7528;&#x6237;&#x5BF9;&#x901F;&#x5EA6;&#x3001;&#x8D39;&#x7528;&#x7684;&#x654F;&#x611F;&#x4EE5;&#x53CA;&#x7269;&#x8054;&#x7F51;&#x5BF9;&#x5E26;&#x5BBD;&#x548C;&#x8BA1;&#x7B97;&#x7684;&#x8981;&#x6C42;&#xFF0C;&#x4E91;&#x8BA1;&#x7B97;&#x4E5F;&#x6F14;&#x8FDB;&#x5230;&#x96FE;&#x8BA1;&#x7B97;&#x548C;&#x8FB9;&#x7F18;&#x8BA1;&#x7B97;&#x3002;</p>
<p>&#x7531; VR/AR &#x5230;&#x66F4;&#x8FD1;&#x4E00;&#x6B65;&#x7684;&#x6C89;&#x6D78;&#x5F0F;&#x4F53;&#x9A8C;&#x3002;</p>
<p>&#x533A;&#x5757;&#x94FE;&#x4ECE; 2017 &#x5E74;&#x5173;&#x6CE8;&#x7684;&#x8D8B;&#x52BF;&#xFF0C;&#x5230; 2018 &#x5F00;&#x59CB;&#x6709;&#x6BD4;&#x8F83;&#x6DF1;&#x5165;&#x7684;&#x7814;&#x7A76;&#xFF0C;&#x5E76;&#x4E14;&#x6295;&#x5165;&#x5B9E;&#x9645;&#x7684;&#x5E94;&#x7528;&#x3002;</p>
<p><strong>&#x5168;&#x7403;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x5360;&#x6BD4;&#x8D8B;&#x52BF;&#x6392;&#x540D;</strong></p>
<p><img src="https://images.gitbook.cn/22631d10-d416-11e8-80d1-917ffa8847fa" alt="enter image description here"></p>
<p>2017 &#x5E74;&#x9886;&#x5148;&#x7684;&#x8BED;&#x8A00;&#x57FA;&#x672C;&#x7684;&#x6392;&#x540D;&#x6CA1;&#x6709;&#x5927;&#x7684;&#x6539;&#x53D8;&#xFF0C;&#x4F46;&#x662F;&#x6BD4;&#x4F8B;&#x5374;&#x90FD;&#x7F29;&#x5C0F;&#x4E86;&#xFF0C;&#x53EF;&#x80FD;&#x7684;&#x539F;&#x56E0;&#x662F;&#x7A0B;&#x5E8F;&#x5458;&#x5728;&#x5C1D;&#x8BD5;&#x65B0;&#x7684;&#x8BED;&#x8A00;&#x548C;&#x65B0;&#x7684;&#x65B9;&#x5411;&#x3002;&#x8FD9;&#x4E2A;&#x5C1D;&#x8BD5;&#x7684;&#x7ED3;&#x679C;&#x5728; 2018 &#x5E74;&#x53CD;&#x5E94;&#x51FA;&#x6765;&#x7684;&#x5F62;&#x5F0F;&#x662F;&#x7531; 2017 &#x5E74;&#x6392;&#x5728;&#x7B2C; 4 &#x4F4D;&#x7684; Python &#x5347;&#x81F3;&#x7B2C;&#x4E09;&#x5448;&#x73B0;&#x3002;&#x5176;&#x4E2D;&#x7684;&#x610F;&#x4E49;&#x4E5F;&#x53CD;&#x5E94;&#x51FA;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x5728; 2018 &#x66F4;&#x52A0;&#x83B7;&#x5F97;&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x8BA4;&#x53EF;&#x4E0E;&#x63A5;&#x53D7;&#x3002;&#x4F20;&#x7EDF;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00; C/C++ &#x5DF2;&#x7ECF;&#x5728;&#x8FD9;&#x6837;&#x7684;&#x8D8B;&#x52BF;&#x4E0B;&#x9000;&#x5C45;&#x7B2C;&#x56DB;&#xFF0C;&#x4E5F;&#x8C61;&#x5F81;&#x4F20;&#x7EDF;&#x7684;&#x6280;&#x672F;&#x9886;&#x57DF;&#x9762;&#x4E34;&#x6D88;&#x9000;&#x7684;&#x73B0;&#x8C61;&#x3002;</p>
<p><strong>GitHub 2017-2018</strong>&#xFF1A;GitHub 2017-2018 statistics</p>
<p><img src="https://images.gitbook.cn/391497a0-d416-11e8-80d1-917ffa8847fa" alt="enter image description here"></p>
<p>GitHub &#x5728; 2008 &#x6B63;&#x5F0F;&#x8FD0;&#x8425;&#x5230;&#x73B0;&#x4ECA;&#x5DF2;&#x7ECF; 10 &#x5E74;&#xFF0C;&#x5927;&#x7EA6;&#x5728; 2015 &#x66F4;&#x52A0;&#x53D7;&#x5230;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x7684;&#x9752;&#x7750;&#x800C;&#x5FEB;&#x901F;&#x7684;&#x6269;&#x5F20;&#x3002;&#x4ECE; 2017 &#x5230; 2018 &#x65E0;&#x8BBA;&#x5728;&#x4EBA;&#x6570;&#x548C;&#x4EE3;&#x7801; repo &#x7684;&#x6570;&#x91CF;&#xFF0C;&#x90FD;&#x6709;&#x60CA;&#x4EBA;&#x7684;&#x6210;&#x957F;&#x3002;&#x56E0;&#x4E3A;&#x8FD9;&#x6837;&#x7684;&#x91CF;&#x7EA7;&#x5177;&#x6709;&#x4EE3;&#x8868;&#x6027;&#xFF0C;&#x4F7F;&#x5F97; GitHub &#x7684;&#x5404;&#x7C7B;&#x6570;&#x636E;&#x6210;&#x4E3A;&#x5F00;&#x6E90;&#x7684;&#x6307;&#x6807;&#x548C;&#x53C2;&#x8003;&#x3002;</p>
<p>2017 GitHub Keywords</p>
<p><img src="https://images.gitbook.cn/cd5922a0-d416-11e8-80d1-917ffa8847fa" alt="enter image description here"></p>
<p>&#x6839;&#x636E; GitHub &#x5173;&#x952E;&#x5B57;&#x7684;&#x663E;&#x793A;&#xFF0C;&#x673A;&#x5668;&#x5B66;&#x4E60;&#xFF08;Machine-learning&#xFF09;&#x6BEB;&#x65E0;&#x60AC;&#x5FF5;&#x6210;&#x4E3A;&#x6700;&#x5927;&#x7684;&#x5173;&#x6CE8;&#x70ED;&#x95E8;&#x8BCD;&#x6C47;&#x3002;&#x6E38;&#x620F;&#xFF08;Game&#xFF09;&#x6210;&#x4E3A;&#x53E6;&#x4E00;&#x4E2A;&#x70ED;&#x95E8;&#x8BCD;&#x6C47;&#x3002;</p>
<p><img src="https://images.gitbook.cn/64c14850-d3b5-11e8-b055-6fdf72668cfc" alt="enter image description here"></p>
<p>GitHub topic &#x662F;&#x4F9D;&#x636E;&#x6BCF;&#x4E2A; repo &#x81EA;&#x4E3B;&#x9009;&#x62E9;&#x7684;&#x6807;&#x7B7E;&#xFF08;tag&#xFF09;&#x5F52;&#x7C7B;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x4E3B;&#x9898;&#x4E0B;&#x3002;&#x8FD9;&#x4E2A;&#x6392;&#x540D;&#x65B9;&#x5F0F;&#x662F;&#x6309;&#x7167;&#x8BE5;&#x4E3B;&#x9898;&#x6240;&#x6709; repo &#x7684;&#x53C2;&#x4E0E;&#x8005;&#x6388;&#x4E88;&#x7684;&#x661F;&#x6570;&#xFF08;star&#xFF09;&#x603B;&#x548C;&#x4EE5;&#x8861;&#x91CF;&#x53D7;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x8BA4;&#x53EF;&#x7684;&#x7A0B;&#x5EA6;&#x3002;</p>
<ul>
<li>JavaScript &#x4F5C;&#x4E3A;&#x811A;&#x672C;&#x8BED;&#x8A00;&#xFF0C;&#x7ECF;&#x5E38;&#x548C;&#x5176;&#x4ED6;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x5982; Java &#x548C; Python &#x642D;&#x914D;&#xFF0C;&#x672C;&#x8EAB;&#x4E5F;&#x53EF;&#x4EE5;&#x5728; web &#x5F00;&#x53D1;&#x91CC;&#x9762;&#x7B80;&#x5355;&#x529F;&#x80FD;&#x5B9E;&#x73B0;&#x6709;&#x5176;&#x8D21;&#x732E;&#xFF0C;&#x52A0;&#x4E0A;&#x76F8;&#x5BF9;&#x6BD4;&#x8F83;&#x5BB9;&#x6613;&#x4E0A;&#x624B;&#x7684;&#x4F18;&#x52BF;&#xFF0C;&#x83B7;&#x5F97;&#x5F00;&#x53D1;&#x8005;&#x7684;&#x559C;&#x7231;&#x5360;&#x636E;&#x7B2C;&#x4E00;&#x3002;</li>
<li>React &#x4E0E; Node.JS &#x4F5C;&#x4E3A; Web &#x5F00;&#x53D1;&#x6846;&#x67B6;&#x6392;&#x540D;&#x4E8C;&#x4E09;&#x3002;</li>
<li>Python &#x6709;&#x8BED;&#x6CD5;&#x7B80;&#x6D01;&#x9AD8;&#x6548;&#x7684;&#x4F18;&#x52BF;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x6570;&#x636E;&#x5206;&#x6790;&#x7684;&#x652F;&#x6301;&#x6709;&#x4E30;&#x5BCC;&#x7684;&#x79EF;&#x7D2F;&#xFF0C;&#x5728;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x6D6A;&#x6F6E;&#x7684;&#x63A8;&#x54C4;&#x4E0B;&#xFF0C;&#x6709;&#x6392;&#x540D;&#x4E0A;&#x5347;&#x7684;&#x8D8B;&#x52BF;&#x6765;&#x5230;&#x6210;&#x4E3A;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x7684;&#x7B2C;&#x4E00;&#x6765;&#x5230;&#x603B;&#x4F53;&#x6392;&#x540D;&#x7B2C;&#x516D;&#x3002;</li>
<li>&#x673A;&#x5668;&#x5B66;&#x4E60;&#x4E0E;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x4F5C;&#x4E3A;&#x70ED;&#x95E8;&#x7684;&#x4E3B;&#x9898;&#xFF0C;&#x7ECF;&#x8FC7;&#x4E0D;&#x5230; 2 &#x5E74;&#x7684;&#x79EF;&#x7D2F;&#x6392;&#x540D; 12&#x3001;13&#xFF0C;&#x800C;&#x4E14;&#x6CA1;&#x6709;&#x6D88;&#x9000;&#x7684;&#x8FF9;&#x8C61;&#xFF0C;&#x4EE5;&#x540E;&#x4E0A;&#x5347;&#x7684;&#x673A;&#x4F1A;&#x975E;&#x5E38;&#x5927;&#x3002;</li>
<li>Java &#x5728;&#x540E;&#x53F0;&#x6570;&#x636E;&#x5904;&#x7406;&#x3001;&#x590D;&#x6742;&#x529F;&#x80FD;&#x5B9E;&#x73B0;&#xFF0C;&#x5404;&#x79CD;&#x652F;&#x6301;&#x6846;&#x67B6;&#x7684;&#x54C1;&#x8D28;&#x548C;&#x9009;&#x62E9;&#x4E0A;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x79EF;&#x7D2F;&#x548C;&#x4F18;&#x52BF;&#xFF0C;&#x4ECD;&#x7136;&#x662F;&#x53D7;&#x5230;&#x5F00;&#x53D1;&#x8005;&#x7684;&#x6B22;&#x8FCE;&#xFF0C;&#x4F46;&#x662F;&#x4E5F;&#x5904;&#x4E8E;&#x6301;&#x5E73;&#x7A33;&#x5B9A;&#x7684;&#x72B6;&#x6001;&#x3002;</li>
</ul>
<p><img src="https://images.gitbook.cn/85aae170-d3b5-11e8-a9a3-fd92848cdb84" alt="enter image description here"></p>
<p>&#x8BB8;&#x591A;&#x4EBA;&#x5E94;&#x8BE5;&#x5BF9; freeCodeCamp &#x8FD9;&#x4E2A;&#x6392;&#x540D;&#x7B2C;&#x4E00;&#x7684; repo &#x548C;&#x5176;&#x4ED6;&#x5982; awesome&#x3001;Your-Don&#x2019;t-Know-JS &#x7B49;&#x6392;&#x5728;&#x524D;&#x9762;&#x7684; repo &#x611F;&#x5230;&#x964C;&#x751F;&#x548C;&#x4E0D;&#x89E3;&#x3002;&#x8FD9;&#x4E9B;&#x662F;&#x4EE5;&#x63A8;&#x5E7F;&#x548C;&#x670D;&#x52A1;&#x67D0;&#x4E00;&#x7406;&#x5FF5;&#x7684; repo&#xFF0C;&#x53EF;&#x80FD;&#x56E0;&#x4E3A;&#x9F13;&#x52B1;&#x5176;&#x7528;&#x6237;&#x70B9;&#x8D5E;&#x52A0;&#x661F;&#x6570;&#xFF0C;&#x6240;&#x4EE5;&#x62E5;&#x6709;&#x603B;&#x591A;&#x7684;&#x661F;&#x6570;&#x800C;&#x6392;&#x5728;&#x9AD8;&#x4F4D;&#x3002;</p>
<p>&#x867D;&#x7136;&#x548C;&#x4E00;&#x822C;&#x5F00;&#x53D1;&#x8005;&#x7684;&#x5BF9;&#x661F;&#x6570;&#x7684;&#x7ED9;&#x4E0E;&#x7684;&#x91C7;&#x53D6;&#x8C28;&#x614E;&#x7684;&#x65B9;&#x5F0F;&#x4E0D;&#x540C;&#xFF0C;&#x4F46;&#x662F; GitHub &#x4E5F;&#x63D0;&#x51FA; GitHub &#x4E0D;&#x4EC5;&#x662F;&#x4EE3;&#x7801;&#x5E93;&#xFF0C;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x610F;&#x89C1;&#x4EA4;&#x6362;&#x7684;&#x5E73;&#x53F0;&#xFF08;Hub&#xFF09;&#x7684;&#x8BBA;&#x70B9;&#x3002;&#x4E5F;&#x8BB8;&#x8FD9;&#x6837;&#x7684;&#x673A;&#x5236;&#x4E5F;&#x662F;&#x63D0;&#x5021;&#x5F00;&#x6E90;&#x3001;&#x81EA;&#x7531;&#x3001;&#x521B;&#x65B0;&#x7684;&#x4E00;&#x79CD;&#x8BA4;&#x53EF;&#x5427;&#x3002;</p>
<p>&#x6709;&#x8DA3;&#x7684;&#x662F;&#xFF0C;bootstrap &#x4F5C;&#x4E3A; topic &#x5E76;&#x6CA1;&#x6709;&#x6392;&#x5728;&#x524D;&#x9762;&#xFF0C;&#x4F46;&#x662F;&#x5355;&#x5C31; repo &#x7684;&#x89D2;&#x5EA6;&#xFF0C;&#x5374;&#x6709;&#x6BD4;&#x5176;&#x4ED6; repo &#x9AD8;&#x7684;&#x661F;&#x6570;&#x800C;&#x6210;&#x4E3A;&#x7B2C;&#x4E8C;&#x3002;Google &#x7684; Tensorflow &#x4F5C;&#x4E3A;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7684;&#x6846;&#x67B6;&#xFF0C;&#x4EE5; repo &#x53D7;&#x559C;&#x7231;&#x7684;&#x7A0B;&#x5EA6;&#x9AD8;&#x5C45;&#x7B2C;&#x4E94;&#xFF0C;&#x5728;&#x4E0A;&#x5347;&#x7684;&#x901F;&#x5EA6;&#x548C;&#x559C;&#x7231;&#x7684;&#x7A0B;&#x5EA6;&#x5B9E;&#x5728;&#x4EE4;&#x4EBA;&#x60CA;&#x8BB6;&#x3002;</p>
<p>&#x6392;&#x540D;&#x7B2C;&#x4E5D;&#x7684; JavaScript &#x5B9E;&#x9645;&#x662F; javascrip style guide &#x7684;&#x4E00;&#x4E2A;&#x4EE5; javascript &#x4E3A;&#x5F00;&#x53D1;&#x4E3B;&#x9898;&#x7684;&#x6587;&#x6863;&#x96C6;&#x6210;&#x3002;&#x4E0D;&#x662F; javascript &#x672C;&#x8EAB;&#x7684;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x4ECE;&#x8FD9;&#x4E2A;&#x5B9E;&#x9645;&#x7684;&#x6392;&#x540D;&#x4E3A;&#x4F8B;&#xFF0C;&#x4E5F;&#x663E;&#x73B0;&#x51FA; GitHub &#x7528;&#x661F;&#x6570;&#x4E3A;&#x6392;&#x540D;&#x4F9D;&#x636E;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x6709;&#x5176;&#x4E0D;&#x7B26;&#x5408;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x8BA4;&#x77E5;&#x7684;&#x5730;&#x65B9;&#x3002;</p>
<p><strong>&#x5F00;&#x6E90;&#x7684;&#x73B0;&#x51B5;</strong></p>
<p>&#x7531;&#x4EE5;&#x4E0A; GitHub &#x7684;&#x6392;&#x540D;&#x6216;&#x662F;&#x5206;&#x7C7B;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#x7531;&#x7528;&#x6237;&#x81EA;&#x5DF1;&#x7ED9;&#x661F;&#x6570;&#x6216;&#x662F;&#x9009;&#x62E9;&#x81EA;&#x8BA2; tag &#x6765;&#x8FDB;&#x884C;&#x5206;&#x7C7B;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x867D;&#x7136;&#x8BA9;&#x7528;&#x6237;&#x6709;&#x6BD4;&#x8F83;&#x9AD8;&#x7684;&#x81EA;&#x7531;&#x9009;&#x62E9;&#x548C;&#x8BC4;&#x5224;&#x65B9;&#x5F0F;&#xFF0C;&#x4F46;&#x662F;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x5931;&#x516C;&#x5E73;&#x7684;&#x5730;&#x65B9;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x6765;&#x770B;&#x4E00;&#x4E0B;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x7684;&#x7406;&#x60F3;&#x7684;&#x60C5;&#x51B5;&#xFF1A;</p>
<p><img src="https://images.gitbook.cn/16a29450-d417-11e8-80d1-917ffa8847fa" alt="enter image description here"></p>
<p>&#x5BF9;&#x4E8E;&#x89C4;&#x8303;&#x7684;&#x5F00;&#x53D1;&#x9879;&#x76EE;&#xFF0C;&#x9879;&#x76EE;&#x8BF4;&#x660E;&#x3001;&#x6587;&#x6863;&#x3001;&#x67B6;&#x6784;&#x3001;&#x4EE3;&#x7801;&#x90FD;&#x662F;&#x975E;&#x5E38;&#x6E05;&#x695A;&#x548C;&#x6709;&#x6761;&#x7406;&#xFF0C;&#x6240;&#x4EE5;&#x7528;&#x6237;&#x4E5F;&#x4F1A;&#x6709;&#x591A;&#x7684; star &#x548C; fork &#x6570;&#x3002;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x8FD9;&#x4E9B;&#x8BF4;&#x660E;&#x6587;&#x6863;&#x7B49;&#x6587;&#x5B57;&#xFF0C;&#x7EFC;&#x5408; star/fork &#x6570;&#x5224;&#x65AD;&#x662F;&#x4E0D;&#x662F;&#x8FD9;&#x4E2A;&#x662F;&#x8981;&#x627E;&#x7684;&#x9879;&#x76EE;/&#x4EE3;&#x7801;&#x3002;</p>
<p>&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x53C2;&#x8003;&#x9879;&#x76EE;&#x4E2D;&#x63D0;&#x4F9B;&#x7684;&#x8303;&#x4F8B;&#x751A;&#x81F3;&#x662F;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;&#x65B9;&#x5F0F;&#xFF0C;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x7684;&#x5185;&#x5BB9;&#x3002;</p>
<p>&#x751A;&#x81F3;&#x7528;&#x6237;&#x8FD8;&#x53EF;&#x4EE5;&#x5BF9;&#x8FD9;&#x4E2A;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x4F5C;&#x51FA;&#x8D21;&#x732E;&#xFF0C;&#x589E;&#x52A0;&#x4FEE;&#x6539;&#x5F00;&#x6E90;&#x4EE3;&#x7801;&#x3002;
&#x4F7F;&#x7528;&#x8FD9;&#x6837;&#x7684;&#x5F00;&#x6E90;&#xFF0C;&#x7701;&#x65F6;&#x53C8;&#x7701;&#x5FC3;&#xFF01;</p>
<p>&#x4F46;&#x662F;&#x771F;&#x5B9E;&#x7684;&#x60C5;&#x5F62;&#xFF0C;&#x4E0D;&#x4E00;&#x5B9A;&#x662F;&#x5982;&#x60F3;&#x8C61;&#x7684;&#x4E50;&#x89C2;&#xFF1A;</p>
<p><img src="https://images.gitbook.cn/2b83bbb0-d417-11e8-80d1-917ffa8847fa" alt="enter image description here"></p>
<ul>
<li>&#x4F46;&#x662F;&#x5F00;&#x6E90;&#x91CC;&#x6709;&#x66F4;&#x591A;&#x7684;&#x5B9E;&#x9A8C;&#x6027;&#x8D28;&#x6216;&#x662F;&#x4E0D;&#x5B8C;&#x5584;&#x7684;&#x9879;&#x76EE;&#xFF0C;&#x56E0;&#x4E3A;&#x6CA1;&#x6709;&#x53D7;&#x5230;&#x5173;&#x6CE8;&#xFF0C;&#x6240;&#x4EE5;&#x6CA1;&#x6709;&#x661F;&#x6570;&#x53EF;&#x4EE5;&#x53C2;&#x8003;&#xFF0C;&#x4F7F;&#x7528;&#x8005;&#x5E94;&#x8BE5;&#x5C1D;&#x8BD5;&#x4F7F;&#x7528;&#x8FD8;&#x662F;&#x9009;&#x62E9;&#x5176;&#x4ED6;&#x661F;&#x6570;&#x9AD8;&#x4F46;&#x662F;&#x4E0D;&#x4E00;&#x5B9A;&#x7B26;&#x5408;&#x81EA;&#x5DF1;&#x9700;&#x6C42;&#x7684;&#x9879;&#x76EE;&#xFF1F;</li>
<li>&#x5177;&#x6709;&#x540C;&#x7C7B; tag &#x7684;&#x9879;&#x76EE;&#x53EF;&#x80FD;&#x591A;&#x8FBE;&#x6570;&#x767E;&#x4E2A;&#xFF0C;&#x7528;&#x6237;&#x5E94;&#x8BE5;&#x5982;&#x4F55;&#x9009;&#x62E9;&#xFF1F;</li>
<li>&#x8BB8;&#x591A;&#x7684;&#x9879;&#x76EE;&#x6587;&#x6863;&#x8BF4;&#x660E;&#x53EF;&#x80FD;&#x4E5F;&#x4E0D;&#x662F;&#x975E;&#x5E38;&#x9F50;&#x5168;&#xFF0C;&#x7528;&#x6237;&#x5982;&#x4F55;&#x9009;&#x62E9;?</li>
<li>&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x53EF;&#x80FD;&#x5BF9;&#x5176;&#x4ED6;&#x6846;&#x67B6;&#x6709;&#x4F9D;&#x5B58;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x5982;&#x4F55;&#x77E5;&#x9053;&#x53BB;&#x8BC4;&#x91CF;&#x662F;&#x5426;&#x7B26;&#x5408;&#x5DF2;&#x6709;&#x7684;&#x6846;&#x67B6;&#x6216;&#x662F;&#x4F9D;&#x8D56;&#x5E93;&#xFF0C;&#x800C;&#x4E0D;&#x7528;&#x52A0;&#x5165;&#x66F4;&#x591A;&#x4F9D;&#x5B58;&#x7684;&#x6846;&#x67B6;&#x548C;&#x4F9D;&#x8D56;&#x5E93;&#x800C;&#x589E;&#x52A0;&#x81EA;&#x5DF1;&#x9879;&#x76EE;&#x7684;&#x590D;&#x6742;&#x5EA6;&#x548C;&#x7EF4;&#x62A4;&#x7684;&#x98CE;&#x9669;&#xFF1F;</li>
<li>&#x9879;&#x76EE;&#x662F;&#x5426;&#x6709;&#x53EF;&#x80FD;&#x592A;&#x5E38;&#x66F4;&#x65B0;&#x6216;&#x662F;&#x6CA1;&#x6709;&#x66F4;&#x65B0;&#xFF1F;</li>
</ul>
<p>&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x8BA9;&#x8BC4;&#x4F30;&#x4F7F;&#x7528;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x4F1A;&#x9047;&#x5230;&#x7684;&#x95EE;&#x9898;&#x2026;</p>
<p><strong>&#x5C0F;&#x7ED3;</strong></p>
<p>&#x4FE1;&#x606F;&#x6280;&#x672F;&#x5728; 2017 &#x5E74;&#x6709;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x7684;&#x8BAE;&#x9898;&#x5F00;&#x59CB;&#x53D1;&#x9175;&#xFF0C;&#x8BB8;&#x591A;&#x7684;&#x5C1D;&#x8BD5;&#x3001;&#x5B66;&#x4E60;&#x3001;&#x7814;&#x7A76;&#x9020;&#x6210;&#x65B0;&#x7684;&#x5173;&#x6CE8;&#x548C;&#x6295;&#x5165;&#xFF0C;&#x7531;&#x8BB8;&#x591A;&#x8FF9;&#x8C61;&#x663E;&#x793A; 2017 &#x5E74;&#x662F;&#x4E00;&#x4E2A;&#x53D8;&#x52A8;&#xFF08;dynamic&#xFF09;&#x65F6;&#x671F;&#x3002;&#x8FDB;&#x5165; 2018&#xFF0C;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x7D2F;&#x79EF;&#x7814;&#x7A76;&#x4EBA;&#x5458;&#x3001;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x3001;&#x6C11;&#x95F4;&#x4F01;&#x4E1A;&#x4EE5;&#x81F3;&#x4E8E;&#x56FD;&#x5BB6;&#x7EA7;&#x522B;&#x7684;&#x5173;&#x6CE8;&#xFF0C;&#x5728;&#x5168;&#x7403;&#x6380;&#x8D77;&#x4EBA;&#x529B;&#x4E0E;&#x8D44;&#x6E90;&#x6295;&#x5165;&#x7684;&#x98CE;&#x6F6E;&#x3002;&#x8FD9;&#x4E2A;&#x73B0;&#x8C61;&#x53EF;&#x4EE5;&#x4ECE;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x7684;&#x6392;&#x540D;&#x5728; 2018 &#x5E74; Python &#x5347;&#x81F3;&#x7B2C;&#x4E09;&#x3001;&#x8FD8;&#x6709;&#x5728; GitHub &#x5305;&#x62EC; Tensorflow &#x7B49;&#x5C5E;&#x4E8E;&#x673A;&#x5668;&#x5B66;&#x4E60; / &#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7684;&#x7C7B;&#x522B;&#x6392;&#x540D;&#x5FEB;&#x901F;&#x722C;&#x5347;&#x7684;&#x73B0;&#x8C61;&#x5F97;&#x5230;&#x9A8C;&#x8BC1;&#x3002;</p>
<p>&#x4EE5; JavaScript/Node.js &#x7B49;&#x6846;&#x67B6;&#x4E3A;&#x4EE3;&#x8868;&#x7684;&#x624B;&#x673A;&#x5E94;&#x7528;&#x548C;&#x4E92;&#x8054;&#x7F51;&#x76F8;&#x5173;&#x7684;&#x5F00;&#x6E90;&#xFF0C;&#x4ECD;&#x7136;&#x662F;&#x6700;&#x5927;&#x5B97;&#x548C;&#x70ED;&#x95E8;&#x7684;&#x9879;&#x76EE;&#xFF0C;&#x57FA;&#x672C;&#x4E0A;&#x662F;&#x4EE5;&#x6301;&#x5E73;&#x7684;&#x72B6;&#x6001;&#x7EF4;&#x6301;&#x5728;&#x539F;&#x6709;&#x8F68;&#x8FF9;&#x7EE7;&#x7EED;&#x8FD0;&#x4F5C;&#x3002;&#x4E0D;&#x7BA1;&#x4ECE;&#x6D3B;&#x8DC3;&#x5EA6;&#x3001;&#x8D21;&#x732E;&#x5EA6;&#x3001;&#x53C2;&#x4E0E;&#x5EA6;&#x548C;&#x6DB5;&#x76D6;&#x5EA6;&#x90FD;&#x662F;&#x9886;&#x5148;&#x7684;&#x60C5;&#x5F62;&#x3002;&#x7531; Java &#x4EE3;&#x8868;&#x7684;&#x4F20;&#x7EDF;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x79EF;&#x7D2F;&#xFF0C;&#x5728;&#x4EE5;&#x5E94;&#x7528;&#x548C;&#x57FA;&#x7840;&#x6846;&#x67B6;&#x9879;&#x76EE;&#x7684;&#x5E7F;&#x5EA6;&#x6DF1;&#x5EA6;&#x4ECD;&#x65E7;&#x76F8;&#x5F53;&#x539A;&#x5B9E;&#xFF0C;&#x867D;&#x7136;&#x6210;&#x9879;&#x76EE;&#x548C;&#x8D21;&#x732E;&#x8005;&#x957F;&#x5DF2;&#x7ECF;&#x6709;&#x9971;&#x548C;&#x7684;&#x73B0;&#x8C61;&#x3002;</p>
<p>&#x5148;&#x524D;&#x65B0;&#x5174;&#x7684;&#x70ED;&#x95E8;&#x6280;&#x672F;&#x5982;&#x7269;&#x8054;&#x7F51;&#x3001;&#x5BB9;&#x5668;&#x6280;&#x672F;&#x548C;&#x533A;&#x5757;&#x94FE;&#x63A5;&#x7EED;&#x524D;&#x9762;&#x7684;&#x52A8;&#x80FD;&#x4ECD;&#x7136;&#x6709;&#x521B;&#x65B0;&#x7684;&#x8BAE;&#x9898;&#x548C;&#x9879;&#x76EE;&#x51FA;&#x73B0;&#xFF0C;&#x8BA8;&#x8BBA;&#x548C;&#x53C2;&#x4E0E;&#x7684;&#x70ED;&#x5EA6;&#x8FD8;&#x662F;&#x6BD4;&#x8F83;&#x9AD8;&#x3002;&#x76F8;&#x8F83;&#x4E8E;&#x4EE5;&#x5F80;&#x7684;&#x70ED;&#x95E8;&#x8BAE;&#x9898;&#x5982;&#x4E91;&#x8BA1;&#x7B97;&#x548C;&#x5927;&#x6570;&#x636E;&#x6709;&#x4E86;&#x76F8;&#x5BF9;&#x6210;&#x957F;&#x7F13;&#x6162;&#x7684;&#x8D8B;&#x52BF;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x4E8E;&#x8D21;&#x732E;&#x8005;&#x7684;&#x53C2;&#x4E0E;&#x6BD4;&#x8F83;&#x7A33;&#x5B9A;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                
                <a href="grank.html" class="navigation navigation-next navigation-unique" aria-label="Next page: Grank篇">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"指南针篇","level":"1.3.1","depth":2,"next":{"title":"Grank篇","level":"1.3.2","depth":2,"path":"chapter-dataanalysis/grank.md","ref":"chapter-dataanalysis/grank.md","articles":[]},"previous":{"title":"数据篇","level":"1.3","depth":1,"ref":"","articles":[{"title":"指南针篇","level":"1.3.1","depth":2,"path":"chapter-dataanalysis/compass.md","ref":"chapter-dataanalysis/compass.md","articles":[]},{"title":"Grank篇","level":"1.3.2","depth":2,"path":"chapter-dataanalysis/grank.md","ref":"chapter-dataanalysis/grank.md","articles":[]}]},"dir":"ltr"},"config":{"plugins":[],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"开源社","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"2018中国开源年度报告","gitbook":"*","description":"2018中国开源年度报告"},"file":{"path":"chapter-dataanalysis/compass.md","mtime":"2019-11-20T04:45:48.192Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-11-20T04:48:12.409Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

